[UNK]	0
[PAD]	0
[SOS]	0
[EOS]	0
▁የ	-0
▁በ	-1
▁አ	-2
▁እ	-3
▁መ	-4
▁።	-5
▁ከ	-6
▁እን	-7
▁ተ	-8
▁ለ	-9
ቸው	-10
▁ይ	-11
▁ወ	-12
▁ያ	-13
▁የሚ	-14
▁ነ	-15
▁ስ	-16
ዎች	-17
ላይ	-18
▁ማ	-19
▁እንደ	-20
▁ም	-21
▁የተ	-22
▁ብ	-23
ዋል	-24
ነት	-25
▁ው	-26
▁በመ	-27
▁ግ	-28
▁ላይ	-29
▁ባ	-30
ስት	-31
▁ሰ	-32
▁ሲ	-33
▁እንዲ	-34
▁አስ	-35
▁እና	-36
ውን	-37
▁ሀ	-38
▁ደ	-39
ንግ	-40
▁በአ	-41
▁ነው	-42
▁በተ	-43
▁ጥ	-44
ቶች	-45
▁ገ	-46
ሆኑ	-47
በት	-48
▁የአ	-49
▁ክ	-50
ሆን	-51
▁ቀ	-52
▁ድ	-53
▁የመ	-54
ለው	-55
ንድ	-56
▁ት	-57
ኢት	-58
ኢትዮ	-59
▁"	-60
▁ህ	-61
ደረ	-62
ሆነ	-63
ጵያ	-64
ዚህ	-65
ኢትዮጵያ	-66
ችን	-67
▁ወደ	-68
በር	-69
ቸውን	-70
▁ሁ	-71
▁ለመ	-72
▁ሚ	-73
▁ለማ	-74
▁ቤ	-75
▁አመ	-76
ስጥ	-77
ገር	-78
▁በማ	-79
▁እንደሚ	-80
ደር	-81
▁ጋ	-82
▁1	-83
▁ውስጥ	-84
▁ል	-85
▁2	-86
ተኛ	-87
▁ዘ	-88
▁ቢ	-89
▁ጉ	-90
ረት	-91
ሪያ	-92
▁ግን	-93
▁ከተ	-94
▁ጠ	-95
ለት	-96
▁ሊ	-97
ጊዜ	-98
▁ጋር	-99
ራት	-100
▁(	-101
▁ባለ	-102
▁እየ	-103
ድር	-104
▁ታ	-105
▁ሳ	-106
ድረ	-107
▁የሚያ	-108
▁እንዳ	-109
ንግስት	-110
▁ጊዜ	-111
▁ካ	-112
▁ኢ	-113
በረ	-114
ንም	-115
▁ይህ	-116
▁አን	-117
ለም	-118
ስተ	-119
▁ምክ	-120
ሮች	-121
▁ስራ	-122
ርት	-123
ንያ	-124
▁አቶ	-125
▁ፍ	-126
▁አገ	-127
ትን	-128
▁በሚ	-129
ንት	-130
▁የማ	-131
▁ኮ	-132
ሎች	-133
ረጃ	-134
ዲስ	-135
ቱን	-136
▁መሆኑ	-137
▁አይ	-138
00	-139
ራዊ	-140
ገባ	-141
ጀመ	-142
▁ስለ	-143
▁ጉዳ	-144
▁ዋ	-145
ሪካ	-146
▁እስ	-147
ላቸው	-148
▁ፕ	-149
▁መስ	-150
▁ሚኒ	-151
▁የም	-152
▁አካ	-153
▁ች	-154
▁ቅ	-155
ከል	-156
▁ጨ	-157
ዎችን	-158
መለ	-159
▁ቤት	-160
ግባ	-161
▁ነበር	-162
ታት	-163
▁አለ	-164
ታው	-165
ሁን	-166
▁የነ	-167
ማሪ	-168
ያን	-169
ይም	-170
▁ሲሆን	-171
ዮን	-172
ተር	-173
▁መን	-174
▁አስተ	-175
▁ድር	-176
▁መንግስት	-177
▁ቡ	-178
ሰራ	-179
ማት	-180
▁መሰ	-181
▁ፈ	-182
▁ያለ	-183
ታወ	-184
ገድ	-185
ባቸው	-186
ጠና	-187
ላል	-188
▁አበ	-189
01	-190
ድረግ	-191
▁መሆኑን	-192
ሰብ	-193
▁ሆ	-194
ታል	-195
▁ከአ	-196
ሉት	-197
▁ገል	-198
▁ከፍ	-199
ከተ	-200
▁ከተማ	-201
ረው	-202
▁ኢትዮጵያ	-203
▁ዳ	-204
ብር	-205
ንስ	-206
▁ሌ	-207
ለያ	-208
ኛው	-209
▁ከመ	-210
▁እየተ	-211
ልጣ	-212
ላት	-213
በሩ	-214
▁ነገር	-215
▁አንድ	-216
ናት	-217
▁በእ	-218
ስራ	-219
ደረገ	-220
ናቸው	-221
ቅር	-222
▁ሙ	-223
ናል	-224
▁አል	-225
ገለ	-226
▁ብር	-227
ተዋል	-228
ገኘ	-229
▁አም	-230
▁የእ	-231
ልግ	-232
▁ቀን	-233
ኋላ	-234
▁አመት	-235
ግር	-236
▁የኢትዮጵያ	-237
▁ደግ	-238
▁የህ	-239
ገኙ	-240
▁ሀይ	-241
ታቸው	-242
ሊዮን	-243
ሚያ	-244
ሽን	-245
▁አባ	-246
▁በዚህ	-247
▁አበባ	-248
▁ክፍ	-249
▁ደግሞ	-250
▁ምር	-251
ድን	-252
▁ሚኒስት	-253
ለዋል	-254
ጠር	-255
ባቢ	-256
▁ቦ	-257
▁የው	-258
▁ክል	-259
▁ስር	-260
▁ኤ	-261
ርድ	-262
▁በኋላ	-263
▁ቁ	-264
ተው	-265
ፊት	-266
ሁም	-267
▁መል	-268
ትና	-269
▁ሁሉ	-270
ከላ	-271
▁በላይ	-272
ቷል	-273
▁ወይም	-274
▁የግ	-275
መን	-276
▁ምን	-277
ራል	-278
ክል	-279
ጥር	-280
▁ገልፀ	-281
▁ምክንያ	-282
▁እያ	-283
ጠቀ	-284
▁የሰ	-285
ዳን	-286
ዎቹ	-287
▁ዝ	-288
▁እር	-289
ረስ	-290
▁የወ	-291
ፓር	-292
▁ሳይ	-293
▁ከፍተኛ	-294
ክት	-295
ዝብ	-296
ኔታ	-297
ኞች	-298
▁አብ	-299
▁መካ	-300
▁ወቅ	-301
▁በቀ	-302
ቦች	-303
▁3	-304
ምሮ	-305
ናግ	-306
▁እንዲሁም	-307
▁ጠቅ	-308
መር	-309
▁ዶ	-310
ላፊ	-311
ረዋል	-312
▁ን	-313
ረጋ	-314
▁ሁኔታ	-315
ለያዩ	-316
▁እስከ	-317
▁ለአ	-318
▁ባን	-319
▁ሰዎች	-320
ከት	-321
▁ያስ	-322
ልግሎ	-323
ካሄ	-324
ላለ	-325
ቀረ	-326
ጨማሪ	-327
ችል	-328
▁ጨዋ	-329
ቅም	-330
ገን	-331
ዮች	-332
ታዊ	-333
▁ደረጃ	-334
ብረ	-335
ጠበ	-336
አት	-337
ገል	-338
▁እድ	-339
▁አዲስ	-340
▁ማስ	-341
ረዳ	-342
ፈል	-343
▁ገልፀዋል	-344
▁ኢን	-345
▁ያለው	-346
▁ብቻ	-347
▁ተናግ	-348
▁መሰረት	-349
ቀር	-350
▁እንደሆነ	-351
▁ሀላፊ	-352
ጠቃ	-353
ያስ	-354
▁ሆነ	-355
መራ	-356
ምህ	-357
▁መካከል	-358
▁ተቋ	-359
▁ድርጅ	-360
ጣት	-361
▁ብለዋል	-362
▁ወቅት	-363
ሳይ	-364
ናገ	-365
▁201	-366
▁ኩ	-367
▁፣	-368
▁ብዙ	-369
▁ከዚህ	-370
ቶችን	-371
▁አድር	-372
▁ፖ	-373
ፍሪካ	-374
ንግድ	-375
ወሰ	-376
ቃል	-377
▁ይህን	-378
ገሪ	-379
ሏል	-380
ግለ	-381
▁ኮሚ	-382
▁አገልግሎ	-383
ያው	-384
▁ጀ	-385
▁ፕሮ	-386
የት	-387
ባት	-388
ሩት	-389
ይት	-390
ያቄ	-391
ም፣	-392
▁የኢ	-393
ገኝ	-394
▁ጨዋታ	-395
ርስ	-396
▁አቀ	-397
▁በሰ	-398
ደረጉ	-399
▁ክልል	-400
▁መረጃ	-401
መል	-402
▁ስም	-403
▁;	-404
▁ጥያቄ	-405
ታቸውን	-406
ርካ	-407
▁የነበረ	-408
▁መንገድ	-409
▁ፓር	-410
ግራ	-411
▁አማ	-412
▁ናቸው	-413
▁ዋና	-414
▁በመሆኑ	-415
ሪዎች	-416
▁እነ	-417
ፌዴ	-418
▁ግብ	-419
ምር	-420
▁ጎ	-421
▁ተናግረዋል	-422
▁ምክንያት	-423
ወት	-424
▁ሶ	-425
ዘብ	-426
ባንያ	-427
▁ዘር	-428
▁ጉዳይ	-429
የር	-430
ኖች	-431
▁የሀ	-432
ምና	-433
▁የሆነ	-434
▁ተብ	-435
▁የት	-436
▁መጠ	-437
▁አካባቢ	-438
▁በተለ	-439
""	-440
▁አመታት	-441
▁ሰው	-442
▁ፕሬ	-443
▁አስታው	-444
ምን	-445
ገና	-446
ዘጋ	-447
ቢያ	-448
ፈፀ	-449
▁ሚሊዮን	-450
ላክ	-451
▁:	-452
ደው	-453
ቋል	-454
▁4	-455
▁ቆ	-456
ጠው	-457
ነሳ	-458
▁ሽ	-459
▁ሆኖ	-460
▁ፅ	-461
ፈው	-462
▁ሚኒስትር	-463
ሪፖ	-464
▁ያህ	-465
▁ሺ	-466
በው	-467
▁ብሄ	-468
ጀመሪያ	-469
▁ምክር	-470
መው	-471
▁""	-472
▁ሜ	-473
▁በኢትዮጵያ	-474
ለን	-475
ሪክ	-476
መድ	-477
ኩል	-478
ለቱ	-479
▁ተወ	-480
▁የሚያስ	-481
ወጣ	-482
ገሪቱ	-483
ለቲ	-484
▁አስተዳ	-485
ንግስ	-486
ራቸው	-487
▁በፊት	-488
▁እንዲያ	-489
ፍት	-490
ላሉ	-491
▁በግ	-492
▁በህ	-493
ለሁ	-494
▁ኩባንያ	-495
▁ይች	-496
▁ቦታ	-497
▁5	-498
▁በመቶ	-499
ቀው	-500
ልቅ	-501
ችሁ	-502
▁ከእ	-503
ብት	-504
ኖር	-505
▁የስ	-506
ሰው	-507
▁ጠቅላይ	-508
▁ከሚ	-509
▁ቢሆን	-510
ኤል	-511
▁አሰ	-512
ምህርት	-513
ግኘ	-514
▁የበ	-515
ስፋ	-516
▁ፋ	-517
ላማ	-518
ዛሬ	-519
ት፣	-520
ክር	-521
▁ኦ	-522
ለቲካ	-523
ርያ	-524
ሩን	-525
ነው	-526
▁ችግር	-527
ስቴ	-528
ዚያ	-529
▁ህግ	-530
▁ያል	-531
ከና	-532
ይና	-533
▁በሀ	-534
ደጋ	-535
▁ውጤ	-536
ደም	-537
▁አስፈ	-538
▁አው	-539
ቅረ	-540
ረድ	-541
▁የታ	-542
▁የባ	-543
ክስ	-544
▁ቤቱ	-545
▁ያሉ	-546
ሳብ	-547
▁ድረስ	-548
▁ራ	-549
▁አገልግሎት	-550
▁አሁን	-551
▁ዜ	-552
መስ	-553
ገው	-554
ውያን	-555
▁በተጨማሪ	-556
▁ተግባ	-557
ምነት	-558
ሳኔ	-559
ኮኖ	-560
▁ወር	-561
▁ሌሎች	-562
▁ፓርቲ	-563
▁ሲሆን፣	-564
ክተር	-565
▁ባንክ	-566
ሉም	-567
ንና	-568
ጠቅ	-569
▁ሂ	-570
▁ሞ	-571
ጣም	-572
ገኘው	-573
ጀት	-574
▁ሁለት	-575
ሜሪካ	-576
▁ረ	-577
▁ችግ	-578
▁እንደተ	-579
▁ተቀ	-580
▁አጋ	-581
▁አለም	-582
▁አሳ	-583
ሰማ	-584
ዳንት	-585
ቅስ	-586
ባል	-587
ጨረ	-588
▁በስ	-589
ላም	-590
ሱን	-591
▁ወን	-592
ገኛ	-593
▁ግንባ	-594
ገቡ	-595
▁መንግስ	-596
▁በም	-597
ወቅ	-598
ኝነት	-599
▁የውጭ	-600
ቃት	-601
▁ር	-602
▁ሺህ	-603
▁ሴ	-604
▁ኳ	-605
ሳት	-606
▁በኩል	-607
▁መር	-608
ግብ	-609
ጆች	-610
▁ለው	-611
ዶች	-612
ለች	-613
▁)	-614
ቃሴ	-615
ሞች	-616
▁ሲያ	-617
▁በት	-618
▁ማእ	-619
ቅስቃሴ	-620
▁አዋ	-621
▁ፕሬዚ	-622
▁በየ	-623
▁ሚኒስቴ	-624
▁ድጋ	-625
▁ሀይል	-626
▁ተከ	-627
ያዘ	-628
ብረት	-629
ጦር	-630
ደረገው	-631
ገለፁ	-632
▁ነገ	-633
ሰባ	-634
▁አቀፍ	-635
ግኘት	-636
▁ቡድን	-637
ነስ	-638
ስልጣ	-639
▁አለመ	-640
▁ልማት	-641
▁የስራ	-642
▁ቴ	-643
▁መግለ	-644
▁በሁ	-645
▁በርካ	-646
201	-647
ፈት	-648
ነበረ	-649
▁አር	-650
▁ሌላ	-651
▁ቡድ	-652
▁በጣም	-653
▁ፖሊ	-654
▁የተባ	-655
ፈጠ	-656
▁ውሳኔ	-657
ንቀ	-658
ሰቡ	-659
▁ፀ	-660
ደረግ	-661
ጡት	-662
▁ህዝብ	-663
▁ህዝ	-664
▁6	-665
▁እንቅስቃሴ	-666
▁ዲ	-667
▁ባህ	-668
▁በማለት	-669
ቤት	-670
መጣ	-671
በል	-672
▁ገን	-673
ሻሻ	-674
ትል	-675
ሀን	-676
▁የቀ	-677
ጠናቀ	-678
ባኤ	-679
▁የኮ	-680
▁ጀምሮ	-681
▁ልዩ	-682
▁ያሉት	-683
ልክ	-684
ብሄ	-685
▁አገር	-686
▁ፍርድ	-687
▁ለሚ	-688
▁የተለያዩ	-689
▁የፖ	-690
▁ቁጥር	-691
▁ኪ	-692
ሪፖር	-693
▁ውድ	-694
▁እንደሚያ	-695
በያ	-696
ዩኒ	-697
▁ይሆ	-698
ቸዋል	-699
ፖርት	-700
ጫዋ	-701
▁ለተ	-702
▁-	-703
ሰጥ	-704
▁በሌ	-705
▁ከማ	-706
▁መሆ	-707
▁ምንም	-708
▁ቢሊዮን	-709
▁ምርጫ	-710
▁እንዳለ	-711
▁ለማስ	-712
ከራ	-713
▁ማሀ	-714
▁ጭ	-715
ክራ	-716
ጥታ	-717
ከናወ	-718
ፉት	-719
ኮኖሚ	-720
ሬት	-721
ጋት	-722
▁በበ	-723
▁ማድረግ	-724
▁ሚኒስቴር	-725
▁7	-726
▁በው	-727
ቡብ	-728
▁በርካታ	-729
▁ማን	-730
▁በጥ	-731
▁ጉዳዮች	-732
▁እንዲህ	-733
▁አስረድ	-734
ላር	-735
▁ፕሮጀ	-736
ጨረሻ	-737
መረ	-738
ድሞ	-739
ጠት	-740
▁አይነት	-741
ሰሩ	-742
▁አዳ	-743
ደት	-744
ደራ	-745
ምንት	-746
ንን	-747
ጿል	-748
▁ላ	-749
▁አስተዳደር	-750
ያዎች	-751
▁አቅ	-752
ቫይ	-753
ምጃ	-754
መለከተ	-755
ጤና	-756
▁ዙ	-757
ኮች	-758
▁ድጋፍ	-759
ማይ	-760
ረጋገ	-761
▁የነበሩ	-762
ቅድ	-763
ቀዋል	-764
ብራ	-765
ችሉ	-766
ክልሉ	-767
ቂቃ	-768
▁የመንግስት	-769
▁አቅር	-770
ለተኛ	-771
ከር	-772
▁ግንኙ	-773
▁አገሮች	-774
ባይ	-775
▁ህይ	-776
▁ያለውን	-777
▁እንዳይ	-778
መሳ	-779
▁እነዚህ	-780
▁ብሄራዊ	-781
ዱስት	-782
▁እንደነ	-783
ንዳ	-784
ሳተ	-785
▁ለማድረግ	-786
▁አመራ	-787
ፈለ	-788
▁መግለጫ	-789
▁ጣ	-790
ቋቋ	-791
ሰረ	-792
ሳል	-793
ቀመ	-794
▁ደቂቃ	-795
▁?	-796
▁አንዱ	-797
▁ሙሉ	-798
▁ጠቁ	-799
▁8	-800
ካይ	-801
ሁኑ	-802
▁የማይ	-803
▁ዶላር	-804
19	-805
▁ብሎ	-806
▁ድርጅት	-807
ዱስ	-808
ጠቀም	-809
▁ተቋማት	-810
ሮችን	-811
▁አክ	-812
ተኞች	-813
ናቸውን	-814
ከተማ	-815
ጋራ	-816
ቀት	-817
ፌዴራል	-818
▁አባላት	-819
ያዊ	-820
▁በደ	-821
▁ዘመን	-822
▁ቤቶች	-823
▁በማድረግ	-824
▁ባለስልጣ	-825
በትን	-826
ሙሉ	-827
▁ግንባታ	-828
▁ድን	-829
ከፍ	-830
▁ያህል	-831
▁ሀገ	-832
▁እው	-833
▁ኳስ	-834
▁እርምጃ	-835
ቱም	-836
ቻቸው	-837
ራንስ	-838
ን፣	-839
▁ሰራ	-840
▁ግድ	-841
▁ጥሩ	-842
ደርግ	-843
▁ስርአት	-844
200	-845
▁ትኩ	-846
ከላከ	-847
▁ዘርፍ	-848
▁200	-849
▁ተጫዋ	-850
ጠበቅ	-851
▁በታ	-852
▁ቃል	-853
▁በተለይ	-854
ደርጉ	-855
▁ቤተ	-856
ፋት	-857
▁የሆኑ	-858
▁ቀደም	-859
▁ዝግ	-860
▁አይደ	-861
ጥብ	-862
▁ዋጋ	-863
▁ጉባኤ	-864
ነቱ	-865
ቀጥ	-866
ረም	-867
ጠቃላይ	-868
ህን	-869
▁እንጂ	-870
▁ተፈ	-871
▁ተብሎ	-872
▁ማለት	-873
▁ዘመ	-874
ላቸውን	-875
▁ውይ	-876
ሉን	-877
▁ትምህርት	-878
▁ምስ	-879
▁መድረ	-880
▁የሚል	-881
ጎች	-882
▁ዛሬ	-883
▁ነፃ	-884
ላጊ	-885
▁የደ	-886
ከሰ	-887
ዱስትሪ	-888
▁ሊያ	-889
▁ተጠ	-890
ሯል	-891
▁ባለሙ	-892
ሳቸው	-893
ቾች	-894
ገነ	-895
▁ይታወ	-896
▁የነበረው	-897
ይሬ	-898
▁የተሰ	-899
▁አስረድተዋል	-900
▁ይችላል	-901
▁ኮሚቴ	-902
ቻል	-903
ልማት	-904
▁ፕሬዚዳንት	-905
▁ንግድ	-906
▁19	-907
▁ሚኒስትሩ	-908
ኦሮ	-909
▁ግንኙነት	-910
▁ስብ	-911
ታይ	-912
ደግ	-913
ፍራ	-914
ቆጣ	-915
ዛት	-916
ገቢ	-917
▁ጨምሮ	-918
መዋል	-919
ጨዋ	-920
ነጋ	-921
▁ገንዘብ	-922
▁ሱ	-923
▁መጠን	-924
ኖሩ	-925
▁የሚገኙ	-926
ላሽ	-927
▁ይሁን	-928
▁በተለያዩ	-929
ነሱ	-930
ኑን	-931
▁ማሳ	-932
▁ሀሳብ	-933
▁ጥቅም	-934
ዘር	-935
ዴት	-936
▁ሳምንት	-937
ዳጅ	-938
▁ክለ	-939
▁ሲሉ	-940
ረን	-941
ላጎ	-942
▁ቡና	-943
መሳሳይ	-944
▁ሶስት	-945
▁በማስ	-946
▁ዳይሬ	-947
ክለ	-948
▁በቅር	-949
▁ለእ	-950
▁የንግድ	-951
▁እድል	-952
ልፅ	-953
▁ተስፋ	-954
ጀል	-955
▁የፖለቲካ	-956
▁ማህ	-957
▁እንኳ	-958
▁ከሆነ	-959
▁ሳይሆን	-960
ሪፖርተር	-961
ቨር	-962
▁በአዲስ	-963
▁በአንድ	-964
▁አካላት	-965
▁ልጆች	-966
የው	-967
▁ጥረት	-968
▁ገቢ	-969
▁አፈ	-970
ስር	-971
ሳሌ	-972
▁ዘንድ	-973
▁ዴ	-974
▁ክፍል	-975
ፃሚ	-976
ካባቢ	-977
▁ሰብ	-978
▁ይገኛ	-979
▁አንዳ	-980
ትር	-981
ያዝ	-982
ለውን	-983
▁9	-984
▁እጅ	-985
▁እንደነበር	-986
ሞክራ	-987
▁ይህም	-988
በዋል	-989
ውም	-990
▁እንዴት	-991
▁ፍላጎ	-992
▁ቆይ	-993
▁መቀ	-994
▁የኤ	-995
▁ያሳ	-996
ገለፁት	-997
▁የፀ	-998
ጋል	-999
▁ምክትል	-1000
ስና	-1001
▁በወ	-1002
ፅሀ	-1003
▁የመጀመሪያ	-1004
መት	-1005
▁መሳ	-1006
ገንዘብ	-1007
ሄድ	-1008
▁በነ	-1009
ህፈት	-1010
ገብ	-1011
ከላከያ	-1012
ጀመር	-1013
ችንን	-1014
▁በአሁኑ	-1015
▁የጥ	-1016
▁ይህንን	-1017
ካሄድ	-1018
▁ቀናት	-1019
ብረተ	-1020
ቅረብ	-1021
▁ይሆናል	-1022
▁ጉዳት	-1023
▁ሰጥ	-1024
ጠራ	-1025
ቦት	-1026
ነር	-1027
ካም	-1028
ናዊ	-1029
▁ተከት	-1030
ሎጂ	-1031
▁ቅዱስ	-1032
▁ከባ	-1033
ንጫ	-1034
▁የምር	-1035
ግራይ	-1036
▁ለመስ	-1037
▁ውጤት	-1038
▁ሄ	-1039
▁ተጨማሪ	-1040
ሮና	-1041
ውል	-1042
▁ወራት	-1043
▁ፈቃ	-1044
ገለፀ	-1045
ንቀሳ	-1046
ቹን	-1047
ለጠ	-1048
▁ስምምነት	-1049
ቡን	-1050
ገደ	-1051
ከለ	-1052
ንተ	-1053
ስተኛ	-1054
▁በሙሉ	-1055
ላዊ	-1056
▁ሲል	-1057
▁አፍሪካ	-1058
▁ቀር	-1059
ችው	-1060
▁የአለም	-1061
ዲያ	-1062
ሲቲ	-1063
▁መሆን	-1064
ቅና	-1065
▁ህገ	-1066
ቧል	-1067
ከላከል	-1068
▁ጌ	-1069
▁አስፈላጊ	-1070
▁አት	-1071
▁የፋ	-1072
ዳር	-1073
▁አድ	-1074
▁ቋ	-1075
▁በፍ	-1076
▁ፖሊስ	-1077
ልና	-1078
አዊ	-1079
▁በመስ	-1080
▁አሸ	-1081
▁እስካ	-1082
▁ያላቸው	-1083
▁አይደለም	-1084
ሌክት	-1085
ደረሰ	-1086
▁ምላሽ	-1087
ቀረቡ	-1088
▁የቆ	-1089
ስተዳ	-1090
ሻለ	-1091
▁እኔ	-1092
ማሽ	-1093
መንት	-1094
▁አህ	-1095
▁ተደር	-1096
▁እንዳል	-1097
▁ገለ	-1098
ኛውም	-1099
ላላ	-1100
▁10	-1101
ነዚህ	-1102
▁ዩኒ	-1103
▁ይገባ	-1104
ሰቦች	-1105
▁ከዚያ	-1106
..	-1107
ማራ	-1108
ጥጥር	-1109
▁ተከትሎ	-1110
▁ትር	-1111
ሶች	-1112
▁ተጠቃ	-1113
ሽኑ	-1114
▁መብት	-1115
▁ሸ	-1116
▁ጫ	-1117
ቨርሲቲ	-1118
▁በኢ	-1119
▁የህዝብ	-1120
መዘ	-1121
ርስቲ	-1122
ገት	-1123
▁ደን	-1124
ጭት	-1125
ብሪካ	-1126
▁የአዲስ	-1127
▁ውይይት	-1128
ሬሽን	-1129
▁ተገል	-1130
▁እንደማይ	-1131
ረር	-1132
ቆጠ	-1133
ሞክራሲ	-1134
▁አጥ	-1135
ቀረበ	-1136
▁ዮ	-1137
በቃ	-1138
▁ጦር	-1139
▁በድ	-1140
▁ዞ	-1141
▁መሪ	-1142
▁መሆናቸውን	-1143
▁15	-1144
ቂያ	-1145
▁ልጅ	-1146
▁ለውጥ	-1147
▁የሁ	-1148
▁ሁሉም	-1149
▁ለህ	-1150
▁ለማግኘት	-1151
ነትን	-1152
ጋሚ	-1153
▁ትኩረት	-1154
▁አካል	-1155
▁ስራዎች	-1156
▁ወጣ	-1157
ሙት	-1158
▁ትልቅ	-1159
▁ለም	-1160
▁ሆነው	-1161
▁አሰራ	-1162
▁ባለፈው	-1163
▁የኢን	-1164
▁አቅም	-1165
ቨስት	-1166
▁የአፍሪካ	-1167
በታል	-1168
▁በተጨማሪም	-1169
ፃፀ	-1170
ጠል	-1171
▁የካ	-1172
▁ዶክተር	-1173
▁ፅህፈት	-1174
ዝር	-1175
▁በሚል	-1176
▁እንድ	-1177
▁መሳሪያ	-1178
ጥሮ	-1179
▁ድም	-1180
▁አደጋ	-1181
▁መንገ	-1182
ናገሩት	-1183
▁ሰአት	-1184
ጓል	-1185
▁12	-1186
▁አስታውቋል	-1187
ጅት	-1188
▁በተመለከተ	-1189
ደርስ	-1190
ምት	-1191
▁አምላክ	-1192
ሰር	-1193
▁ቻ	-1194
▁ነጥብ	-1195
▁ምርት	-1196
▁ስልጣ	-1197
ክሮ	-1198
▁ወጪ	-1199
ወስ	-1200
▁ወይ	-1201
▁20	-1202
▁ግለ	-1203
▁በዚህም	-1204
ፍጠር	-1205
▁ቢሮ	-1206
▁አዋጅ	-1207
እራ	-1208
▁ማስተ	-1209
ታወቀ	-1210
▁በባ	-1211
ሎችን	-1212
በራዊ	-1213
▁ነዋ	-1214
ተት	-1215
▁ውጪ	-1216
▁ማድረ	-1217
ጣይ	-1218
ቃቤ	-1219
ፎች	-1220
ከታ	-1221
▁ብለው	-1222
ስታ	-1223
ንካ	-1224
▁የህግ	-1225
ዘው	-1226
ሱም	-1227
▁አሰልጣ	-1228
▁ፕሮጀክ	-1229
ክምና	-1230
▁ይችላሉ	-1231
▁መሀ	-1232
ካዮች	-1233
▁የሚሰ	-1234
ኦሮሚያ	-1235
ጣሪ	-1236
ላው	-1237
ታደ	-1238
▁ንጉ	-1239
ፅሀፍ	-1240
▁በበኩ	-1241
ተን	-1242
ራን	-1243
▁አደ	-1244
▁መደ	-1245
ታማ	-1246
ጮች	-1247
▁ወንድ	-1248
▁አንዳንድ	-1249
▁የዋ	-1250
▁ተቃ	-1251
ዳማ	-1252
▁መብ	-1253
▁ከወ	-1254
ሁንም	-1255
ሱስ	-1256
▁ቫይ	-1257
▁በአለም	-1258
መለስ	-1259
ብርና	-1260
ማር	-1261
ደረጉት	-1262
▁ጠቁመዋል	-1263
ነገ	-1264
▁በመሆኑም	-1265
▁አስፈፃሚ	-1266
▁ሂደት	-1267
▁ትእ	-1268
20	-1269
▁ከሰ	-1270
▁ያልተ	-1271
ዘጋጀ	-1272
▁11	-1273
ክኖ	-1274
▁ህይወት	-1275
▁ችግሮች	-1276
▁ስል	-1277
▁አያ	-1278
ጣሚ	-1279
ድስት	-1280
▁ገበያ	-1281
▁የገ	-1282
ርፖ	-1283
ከፍተኛ	-1284
▁ተመል	-1285
የሱስ	-1286
▁በቅርቡ	-1287
▁ገብ	-1288
▁አስታውቀዋል	-1289
▁ውሀ	-1290
▁ይፋ	-1291
▁ቅር	-1292
ወጥ	-1293
▁ኩባንያዎች	-1294
▁ባለመ	-1295
▁እቅድ	-1296
▁ስብሰባ	-1297
▁በተለይም	-1298
ው፣	-1299
▁አካባቢዎች	-1300
▁ይታወሳል	-1301
▁አሉ	-1302
▁የግብ	-1303
ሟል	-1304
▁ድርጅቶች	-1305
ቀስ	-1306
▁ስርአ	-1307
ካል	-1308
ንባ	-1309
▁የብ	-1310
▁በዘ	-1311
ፈር	-1312
▁ና	-1313
ዳሚ	-1314
የም	-1315
▁ፊ	-1316
▁መለ	-1317
▁እንደሚገባ	-1318
▁ዙሪያ	-1319
▁እስካሁን	-1320
▁የፌዴራል	-1321
▁ተገልጿል	-1322
▁ባለው	-1323
ያዙ	-1324
▁ቢሆንም	-1325
▁አንፃ	-1326
▁በብ	-1327
▁መሰረ	-1328
▁አባል	-1329
ማቸው	-1330
▁ያህዌ	-1331
ንፃ	-1332
ጠየ	-1333
▁ተፅ	-1334
ካሄደው	-1335
▁ጊ	-1336
ላን	-1337
▁ነው፤	-1338
ኤፍ	-1339
▁የራ	-1340
▁ፋብሪካ	-1341
ሌሎች	-1342
▁ተጠቃሚ	-1343
ነግ	-1344
▁በዋ	-1345
▁በሆነ	-1346
ጠይ	-1347
▁መው	-1348
▁አላማ	-1349
▁ዜጎች	-1350
▁ታው	-1351
እክት	-1352
▁ጋዜ	-1353
▁አስተያ	-1354
ሰጣ	-1355
ሰዋል	-1356
▁አሁንም	-1357
በሩት	-1358
▁ጥናት	-1359
ሶስት	-1360
ባቸውን	-1361
ሌክትሪክ	-1362
ብኝ	-1363
ዎችና	-1364
▁አማካ	-1365
▁ርእ	-1366
ክኖሎጂ	-1367
ይናንስ	-1368
ልም	-1369
ያያዘ	-1370
ርክ	-1371
▁ፍላጎት	-1372
▁ሁለቱ	-1373
ሸነ	-1374
▁አድርጎ	-1375
▁የቻ	-1376
ፈፀም	-1377
▁ተማሪ	-1378
▁ቶ	-1379
ላቀ	-1380
ፍትሄ	-1381
▁የምት	-1382
ክቶ	-1383
ሀት	-1384
መለከ	-1385
▁ዳር	-1386
▁ስለዚህ	-1387
▁በራ	-1388
ራሉ	-1389
ሜን	-1390
ቢት	-1391
▁በረ	-1392
▁አንቀ	-1393
▁ኢንዱስትሪ	-1394
▁ስለሚ	-1395
ሳቢ	-1396
እኖ	-1397
ሱት	-1398
▁ምርመራ	-1399
ሰን	-1400
▁ስት	-1401
▁የሆነው	-1402
▁በሌላ	-1403
ሷል	-1404
ታችን	-1405
▁ቡድኑ	-1406
ዲህ	-1407
▁ሁለተኛ	-1408
▁ሜትር	-1409
▁አህመድ	-1410
▁ወጥ	-1411
ጀመረ	-1412
▁ሰላም	-1413
▁አምስት	-1414
ቀርብ	-1415
ማን	-1416
▁መጥ	-1417
▁ውጭ	-1418
▁የዘ	-1419
ይል	-1420
▁አንፃር	-1421
ብን	-1422
▁ባል	-1423
▁መም	-1424
▁14	-1425
▁ከሁ	-1426
ኞቹ	-1427
▁አቃቤ	-1428
ቂት	-1429
▁ዩኒቨርሲቲ	-1430
▁ሰነ	-1431
ስን	-1432
▁ኮሚሽን	-1433
▁የክልሉ	-1434
▁ታሪክ	-1435
▁አማራ	-1436
ረጋግ	-1437
▁ጠይ	-1438
▁ሀገራት	-1439
ናው	-1440
ሰረተ	-1441
▁አግ	-1442
▁በኮ	-1443
▁ተጠር	-1444
▁2012	-1445
ምድ	-1446
ብሄር	-1447
▁አቋ	-1448
▁የባን	-1449
▁መዝ	-1450
ወጡ	-1451
▁ቃ	-1452
▁ተፅእኖ	-1453
ነበረው	-1454
▁አመልክ	-1455
ጠብ	-1456
ዎን	-1457
▁ዳይሬክተር	-1458
▁መልኩ	-1459
ክተ	-1460
▁ለዚህ	-1461
▁ካል	-1462
▁መታ	-1463
ቶቹ	-1464
ደን	-1465
▁ወረዳ	-1466
▁እለት	-1467
መዝ	-1468
ዱን	-1469
▁በጉ	-1470
ውሮ	-1471
▁ሊግ	-1472
ኗል	-1473
▁አራት	-1474
ብሄራዊ	-1475
▁የተቀ	-1476
▁ጥቃት	-1477
ጠቅላይ	-1478
▁ነገሮች	-1479
ከብ	-1480
ሀብ	-1481
ጥነት	-1482
▁ንግ	-1483
ንቲ	-1484
ከበር	-1485
▁ትን	-1486
▁አሰራር	-1487
▁የተወሰ	-1488
▁አላ	-1489
▁ይገኛል	-1490
ዲሱ	-1491
▁የአሜሪካ	-1492
ሜዳ	-1493
ረጥ	-1494
▁ጥሪ	-1495
ሎት	-1496
ረብ	-1497
▁በጀት	-1498
▁ወንጀል	-1499
▁ቢሆንም፣	-1500
▁ይዞ	-1501
▁ተብሏል	-1502
ከርካ	-1503
ቨስትመንት	-1504
ሊዝ	-1505
▁ሰራዊ	-1506
ፈልግ	-1507
▁ኢኮኖሚ	-1508
ፎር	-1509
▁ተግባር	-1510
ደገ	-1511
▁ኮን	-1512
▁ኬ	-1513
ምፒ	-1514
▁13	-1515
በኛ	-1516
▁ከነ	-1517
ራር	-1518
በብ	-1519
ዛዝ	-1520
▁በመሆን	-1521
▁ሜዳ	-1522
ዋሳ	-1523
ረጋገጥ	-1524
▁መኖ	-1525
ንሲ	-1526
▁በሚያ	-1527
ማኖ	-1528
የን	-1529
▁ሙከራ	-1530
ዮር	-1531
▁እጅግ	-1532
▁የፍ	-1533
▁የተመ	-1534
ደሩ	-1535
ገራ	-1536
▁ባይ	-1537
ሊያ	-1538
ጋቸው	-1539
ምሩ	-1540
ግል	-1541
ኪያ	-1542
ሳስ	-1543
ግና	-1544
ፈረ	-1545
ቦችን	-1546
▁ሀብት	-1547
▁የከተማ	-1548
▁ድርጊ	-1549
▁አየር	-1550
▁ከው	-1551
አዴ	-1552
ካባቢው	-1553
▁የገንዘብ	-1554
ኖረው	-1555
▁ስታ	-1556
▁እንኳን	-1557
ቀርቡ	-1558
▁በቁ	-1559
ካት	-1560
▁ለማሳ	-1561
▁መሬት	-1562
ስማ	-1563
ነትና	-1564
ግዚ	-1565
ባሳ	-1566
▁የሌ	-1567
▁መንግስታት	-1568
▁የቡ	-1569
ዚሁ	-1570
▁የምን	-1571
▁ደር	-1572
▁ክስ	-1573
ያንዳን	-1574
ደኛ	-1575
▁ተገቢ	-1576
▁ስነ	-1577
▁የገለፁት	-1578
ቁት	-1579
▁እድገት	-1580
ይን	-1581
▁በመግለ	-1582
▁ባለሙያዎች	-1583
▁የሞ	-1584
▁መስመር	-1585
▁ጅ	-1586
ሳቸውን	-1587
▁ተግባራዊ	-1588
ባባ	-1589
▁መዋ	-1590
▁ይገባል	-1591
▁የግል	-1592
ርትራ	-1593
ቤተ	-1594
▁አስተዋ	-1595
ሪፖርት	-1596
ለፍ	-1597
▁ስፍራ	-1598
▁ባለፉት	-1599
ስትና	-1600
ሽከርካ	-1601
▁ሰራተኞች	-1602
ሙን	-1603
ፒታል	-1604
▁ካለ	-1605
▁ታውቋል	-1606
▁ጨዋታዎች	-1607
ወር	-1608
▁ባንኮች	-1609
ነቱን	-1610
▁ዝር	-1611
ልፍ	-1612
▁የጎ	-1613
▁18	-1614
ዳት	-1615
ሰበ	-1616
ስቲ	-1617
▁በር	-1618
▁በአገሪቱ	-1619
ግባት	-1620
▁ወል	-1621
ጥረት	-1622
▁16	-1623
ካሄደ	-1624
▁ሪፖርት	-1625
▁አመራሮች	-1626
▁እንደሚችል	-1627
▁ሀሳ	-1628
▁በሽ	-1629
▁ፓ	-1630
ንቋ	-1631
▁ገልጿል	-1632
▁አለበት	-1633
▁ሆኖም	-1634
▁የፕ	-1635
▁ሀገር	-1636
ፍታት	-1637
ገናኛ	-1638
ስብ	-1639
ገባው	-1640
ዳሴ	-1641
▁ፈቃድ	-1642
መለክ	-1643
▁የተሻለ	-1644
ሰብአዊ	-1645
▁ሊቀ	-1646
ያይ	-1647
ረርሽ	-1648
▁መተ	-1649
ዛሪ	-1650
▁ፕሮግራ	-1651
ቆጣጠር	-1652
ረሱ	-1653
▁በበኩላቸው	-1654
በረሰብ	-1655
▁እቃ	-1656
▁የቀድሞ	-1657
ቻቸውን	-1658
ብረተሰቡ	-1659
ዋን	-1660
▁በተያያዘ	-1661
▁አጋጣሚ	-1662
ዷል	-1663
▁የተለ	-1664
▁ድምፅ	-1665
▁ከሀ	-1666
ስቱ	-1667
▁ሚና	-1668
ከፈ	-1669
ራንስፖርት	-1670
▁አሜሪካ	-1671
▁ስላ	-1672
▁የጤና	-1673
▁ድርሻ	-1674
ፊያ	-1675
ገዋል	-1676
▁የውሀ	-1677
ራቸውን	-1678
ዱት	-1679
ዳታ	-1680
▁የቴ	-1681
▁ነበሩ	-1682
ምላክ	-1683
▁ኮርፖ	-1684
▁ሱዳን	-1685
▁ክፍያ	-1686
▁ጎል	-1687
ከፋ	-1688
ለማ	-1689
▁ይልቅ	-1690
ጀመርያ	-1691
ዎች፣	-1692
ቆም	-1693
▁ዞን	-1694
ወጣው	-1695
▁ሀላፊነት	-1696
▁ስልጣን	-1697
ሰጡ	-1698
▁በጋራ	-1699
ሻገር	-1700
ፈልጉ	-1701
ዮርጊ	-1702
▁ሰር	-1703
▁አንቀፅ	-1704
ስራቅ	-1705
▁ሪ	-1706
▁ትክ	-1707
ንካራ	-1708
▁አስታወቀ	-1709
ኛል	-1710
▁17	-1711
▁ያደር	-1712
▁በወቅ	-1713
▁ተወካዮች	-1714
▁ለሪፖርተር	-1715
ጅም	-1716
ኛውን	-1717
▁መፍትሄ	-1718
▁አለው	-1719
▁ባህር	-1720
▁አፈፃፀ	-1721
ድሩ	-1722
ቋቋም	-1723
▁እንዲሆን	-1724
ቀም	-1725
▁መመር	-1726
ረዳት	-1727
▁ስጋት	-1728
▁ፕሮጀክት	-1729
▁መልካም	-1730
ያህ	-1731
▁በመቀ	-1732
ጀንሲ	-1733
▁30	-1734
▁2013	-1735
▁ቫይረስ	-1736
▁የሙ	-1737
▁እኛ	-1738
ናፊ	-1739
▁ክልሎች	-1740
▁የመስ	-1741
▁የልማት	-1742
ህአዴ	-1743
ደጋጋሚ	-1744
ቲት	-1745
▁ሊሆን	-1746
▁ውድድር	-1747
▁ቱ	-1748
▁የሚለው	-1749
▁ለሁ	-1750
50	-1751
▁አብዛ	-1752
መቱ	-1753
ፅኦ	-1754
▁የድ	-1755
ጋዊ	-1756
▁እንደሚያስ	-1757
▁አጋማሽ	-1758
ክሲ	-1759
ተና	-1760
ኞችን	-1761
ወሀት	-1762
▁የኢኮኖሚ	-1763
▁ሀይሎች	-1764
▁መመ	-1765
▁ከህ	-1766
▁የሚገኘው	-1767
ደረጃ	-1768
▁የፀጥታ	-1769
▁ዝግጅት	-1770
ባሉ	-1771
▁በአጠቃላይ	-1772
▁አብይ	-1773
▁ወታደ	-1774
▁ተመሳሳይ	-1775
▁እንግ	-1776
▁ኢየሱስ	-1777
ማል	-1778
▁የተነሳ	-1779
▁ትእዛዝ	-1780
▁ማእከል	-1781
ባለ	-1782
▁ክፍለ	-1783
▁ሆቴ	-1784
▁የሚያስችል	-1785
▁ከኢትዮጵያ	-1786
▁ብድር	-1787
▁ብሏል	-1788
ሁፍ	-1789
▁ፊት	-1790
ህር	-1791
▁የሰው	-1792
ጫወ	-1793
▁እግር	-1794
ቻችን	-1795
▁ማሻሻ	-1796
▁መስራት	-1797
▁ከተሞች	-1798
ረታ	-1799
▁በመንግስት	-1800
▁መስሪያ	-1801
▁ተጫዋቾች	-1802
ዳሪ	-1803
▁ስለመ	-1804
ገንባት	-1805
ጠን	-1806
▁ስቴ	-1807
ዊት	-1808
ያቸው	-1809
▁አገራት	-1810
▁ክርስቲ	-1811
▁ስን	-1812
ህአዴግ	-1813
▁ምንዛሪ	-1814
▁ንብረት	-1815
ባቂ	-1816
▁ያላ	-1817
▁አጠቃላይ	-1818
ፈጠረ	-1819
▁ግብር	-1820
ጫወት	-1821
▁የለ	-1822
▁የአገሪቱ	-1823
▁በይ	-1824
▁አስተዋፅኦ	-1825
▁ኢትዮጵያን	-1826
▁መፅሀፍ	-1827
▁ማግኘት	-1828
ውጣት	-1829
ጠናቀቅ	-1830
▁በእር	-1831
▁ተሳት	-1832
▁ፖለቲካ	-1833
ወዳ	-1834
▁እንደሌ	-1835
▁እንዳለበት	-1836
▁የበለጠ	-1837
ፈቀ	-1838
▁የጋራ	-1839
ጣን	-1840
▁ከግ	-1841
▁ቀጥ	-1842
▁የምርጫ	-1843
▁ቅድ	-1844
▁ህይወ	-1845
ም፤	-1846
ፈራ	-1847
ሰት	-1848
ሸን	-1849
▁ከዚያም	-1850
▁የነበሩት	-1851
▁መጋ	-1852
▁የሚመ	-1853
ደብ	-1854
ልን	-1855
▁የሚሆኑ	-1856
ሰጠው	-1857
ርማ	-1858
▁ተሳ	-1859
ሰድ	-1860
▁ህዝቦች	-1861
ቱት	-1862
ውና	-1863
▁ጤና	-1864
ስቶ	-1865
▁መቆ	-1866
▁ሮ	-1867
▁ለመቀ	-1868
ላማዊ	-1869
ስትራ	-1870
▁ተጠና	-1871
▁በተመሳሳይ	-1872
▁ከቀ	-1873
ሰል	-1874
▁ከባድ	-1875
▁አገሪ	-1876
ዘን	-1877
▁ፓርቲዎች	-1878
▁አልተ	-1879
ያል	-1880
▁ገፅ	-1881
ጋሪ	-1882
ዳቤ	-1883
▁ቦርድ	-1884
ምረት	-1885
ዩት	-1886
ያህዌ	-1887
ግዚአ	-1888
▁ጣቢያ	-1889
▁ጊዮርጊ	-1890
▁ይጠበ	-1891
▁የነበረውን	-1892
ቤቱ	-1893
▁መነ	-1894
▁ከስ	-1895
ግዚአብሄር	-1896
ባብ	-1897
▁ጠንካራ	-1898
▁ደብ	-1899
▁ነበረ	-1900
ቶችና	-1901
▁ሰፊ	-1902
▁አሰልጣኝ	-1903
ዘጋጅ	-1904
▁ድንጋ	-1905
▁ሀብ	-1906
ራይ	-1907
ጉን	-1908
▁ምድር	-1909
▁መሆኑንም	-1910
▁ኡ	-1911
▁ጉዳዩ	-1912
ጭር	-1913
ጠረ	-1914
ፁም	-1915
ኳይ	-1916
ጣጫ	-1917
ፈን	-1918
▁ወረርሽ	-1919
ዳቸው	-1920
ርያም	-1921
▁የወጣ	-1922
▁ስሜ	-1923
▁ባለስልጣን	-1924
▁አመቱ	-1925
▁ይጠበቃል	-1926
▁ምእራ	-1927
▁የክ	-1928
▁ጎን	-1929
▁በጎ	-1930
ከናወን	-1931
▁ረገድ	-1932
▁ዴሞክራሲ	-1933
▁በከፍተኛ	-1934
ቸኳይ	-1935
▁ቴክኖሎጂ	-1936
▁ስለሆነ	-1937
ነኛ	-1938
▁ነዋሪዎች	-1939
▁የአገር	-1940
ውሞ	-1941
ቻሉ	-1942
ገነባ	-1943
ራም	-1944
ቂቅ	-1945
▁እምነት	-1946
▁በክ	-1947
▁የለም	-1948
//	-1949
ሊየን	-1950
▁ቋንቋ	-1951
ሀል	-1952
▁ከታ	-1953
ታፊ	-1954
▁24	-1955
▁ሰላ	-1956
ጠቁ	-1957
▁አመራር	-1958
በልጥ	-1959
መለከት	-1960
▁ዩ	-1961
▁ላለ	-1962
▁ለሰ	-1963
▁ተጠቅ	-1964
ከታተ	-1965
▁ተከላ	-1966
▁በወቅቱ	-1967
▁ይናገ	-1968
ሱዳን	-1969
▁በታች	-1970
▁አምባሳ	-1971
▁የማስ	-1972
ናገር	-1973
▁የል	-1974
በረታ	-1975
▁መከላከያ	-1976
▁መጨረሻ	-1977
▁ጦርነት	-1978
▁ፍት	-1979
▁በቂ	-1980
▁ግጭት	-1981
ላንድ	-1982
ብብር	-1983
ቀረበው	-1984
ከረም	-1985
ሆናቸው	-1986
በራት	-1987
▁አውሮ	-1988
ሪም	-1989
▁ነጋ	-1990
▁ስልጠና	-1991
ኒያ	-1992
ግባር	-1993
▁ያላቸውን	-1994
▁ልብ	-1995
▁በሌሎች	-1996
▁ቴሌ	-1997
▁መድረክ	-1998
▁አግኝ	-1999
ገኙት	-2000
▁የቦ	-2001
▁ባለሀብ	-2002
▁ባሻገር	-2003
ግባብ	-2004
▁ቢያ	-2005
▁ኖ	-2006
▁ኢትዮጵያውያን	-2007
ነቶች	-2008
ታር	-2009
ደርገው	-2010
▁የሚችል	-2011
▁አቅጣጫ	-2012
▁ጄ	-2013
▁አሸናፊ	-2014
ድድር	-2015
▁አድርጓል	-2016
▁25	-2017
ስተዋ	-2018
▁ኪሎ	-2019
ጀመረው	-2020
ል፣	-2021
▁ክፍሎች	-2022
▁ተቋም	-2023
▁የኮሮና	-2024
▁አስተያየት	-2025
▁ዝቅ	-2026
▁የሽ	-2027
▁ከበ	-2028
▁ድል	-2029
ላቅ	-2030
ገልፃ	-2031
▁በል	-2032
ሳተፉ	-2033
ስራኤል	-2034
▁አማካይ	-2035
▁የትምህርት	-2036
ውሮፓ	-2037
▁ጥር	-2038
▁ወጣቶች	-2039
ሬሽኑ	-2040
▁በአፍሪካ	-2041
▁በሰጡት	-2042
▁በክልሉ	-2043
▁ፌዴ	-2044
▁በቀጣይ	-2045
▁ሴቶች	-2046
▁ገብረ	-2047
ጫው	-2048
ንቀሳቀ	-2049
▁ፎ	-2050
▁የቅ	-2051
▁ጫና	-2052
▁መንግስቱ	-2053
ገዛ	-2054
ናይት	-2055
▁አለማ	-2056
▁ግድብ	-2057
ባዊ	-2058
▁መልእክት	-2059
ርቶ	-2060
▁ንጉስ	-2061
▁የጠ	-2062
▁መንፈ	-2063
ፉን	-2064
ቻለ	-2065
▁ቡድኖች	-2066
▁የጦር	-2067
▁ሻ	-2068
▁ፀሀ	-2069
▁ጭምር	-2070
ሶማ	-2071
▁መርሀ	-2072
▁የሚታ	-2073
▁መድ	-2074
ሬዳ	-2075
▁ወስ	-2076
ነስተኛ	-2077
▁ከአንድ	-2078
ጠናከር	-2079
▁እርዳታ	-2080
▁ተገኝ	-2081
▁ዋንጫ	-2082
▁አሳስ	-2083
▁ኤጀንሲ	-2084
▁ጉዞ	-2085
ንቃ	-2086
▁መንገዶች	-2087
▁ምት	-2088
▁ተች	-2089
▁የጉ	-2090
▁ለመስጠት	-2091
ሬታ	-2092
▁ማብራ	-2093
▁ተከሳ	-2094
▁የኦ	-2095
▁የድር	-2096
▁የሚታወ	-2097
▁በአል	-2098
▁ደጋ	-2099
▁ቦታዎች	-2100
ክልል	-2101
ፌደ	-2102
▁ሰራዊት	-2103
▁የሰብአዊ	-2104
ጣል	-2105
▁ፕሬዝ	-2106
ሳዊ	-2107
▁በቅ	-2108
ጧል	-2109
ላለፍ	-2110
11	-2111
ጠቀሙ	-2112
▁ስቴት	-2113
▁የሚፈ	-2114
▁የፋይናንስ	-2115
ምስት	-2116
▁የሲ	-2117
▁ግለሰቦች	-2118
ጀመሩ	-2119
▁አራ	-2120
▁በመተ	-2121
ስ፣	-2122
ዝም	-2123
▁ጥያቄዎች	-2124
▁ግልፅ	-2125
ድሮ	-2126
ፏል	-2127
ይወት	-2128
▁ይመስ	-2129
▁ማለ	-2130
▁እንዳለው	-2131
▁ስድስት	-2132
▁ተዋ	-2133
▁በሁለቱ	-2134
ነህ	-2135
▁በፍጥነት	-2136
▁ሀይለ	-2137
▁መክ	-2138
▁መስጠት	-2139
ከባ	-2140
▁ያመለክ	-2141
▁አዳዲስ	-2142
ጠበቀ	-2143
ጠሩ	-2144
መሰ	-2145
▁ሩ	-2146
ስተካ	-2147
▁ደቡብ	-2148
▁ለመከላከል	-2149
ባበ	-2150
▁ምክንያቱም	-2151
ንጉ	-2152
ስተር	-2153
▁ይገልፃ	-2154
▁ያደረገ	-2155
▁ህጋዊ	-2156
▁ፖሊሲ	-2157
▁ወገ	-2158
ጠኛ	-2159
ርባ	-2160
ደሰ	-2161
ናሽ	-2162
ሬዳዋ	-2163
ገም	-2164
▁ሀላፊዎች	-2165
▁የዳ	-2166
▁እጥረት	-2167
ውው	-2168
ችለው	-2169
30	-2170
▁እንዳስ	-2171
ልስ	-2172
ብዛ	-2173
▁ትክክለ	-2174
ቀረቡት	-2175
▁አስመል	-2176
▁ዙር	-2177
▁ጆ	-2178
▁ጥበቃ	-2179
▁ተደርጎ	-2180
ንታ	-2181
▁ሌላው	-2182
ቀበ	-2183
ለህ	-2184
ሳኝ	-2185
▁እየሰራ	-2186
▁የሆኑት	-2187
▁ዝርዝር	-2188
▁የሚችሉ	-2189
▁ካሳ	-2190
ጠኝ	-2191
▁የሰላም	-2192
▁የተባለው	-2193
▁ይኼ	-2194
▁የመጨረሻ	-2195
ዎቹን	-2196
ሸነፍ	-2197
▁ተከታ	-2198
▁ለማወቅ	-2199
▁ኮሚሽ	-2200
ልቁ	-2201
ቀጥል	-2202
▁ያው	-2203
▁የፍት	-2204
▁ተማሪዎች	-2205
ለቀ	-2206
ናይትድ	-2207
▁ማብራሪያ	-2208
▁መቶ	-2209
▁2010	-2210
▁እንደሚገኝ	-2211
▁የአየር	-2212
ሞን	-2213
ካሂ	-2214
▁ጃ	-2215
ምህር	-2216
▁ሂደ	-2217
▁ፕሮጀክቶች	-2218
ፋር	-2219
▁ደብዳቤ	-2220
▁ተሳትፎ	-2221
▁ከሌሎች	-2222
▁በተደጋጋሚ	-2223
ካተ	-2224
ውስ	-2225
ሀንስ	-2226
▁፤	-2227
▁ይላል	-2228
▁ከም	-2229
▁ለኢትዮጵያ	-2230
ያት	-2231
▁ለመፍታት	-2232
▁በኤ	-2233
▁አበባ፣	-2234
▁አዲሱ	-2235
▁በቁጥጥር	-2236
▁ምል	-2237
▁ማሀበር	-2238
ዳል	-2239
2012	-2240
▁ተሰ	-2241
▁በደቡብ	-2242
▁የወደ	-2243
ላችሁ	-2244
▁ያገኘ	-2245
ከረ	-2246
000	-2247
ያንዳንዱ	-2248
ነታቸው	-2249
▁የመን	-2250
▁በአገር	-2251
▁ሀም	-2252
▁የአማራ	-2253
▁ምግብ	-2254
ማኖት	-2255
10	-2256
ዛሬው	-2257
▁ኢንተር	-2258
ንቲባ	-2259
▁አድርገው	-2260
▁መሀመድ	-2261
ኪና	-2262
ምጣት	-2263
ድብ	-2264
▁አስር	-2265
ፈፀመ	-2266
▁ህንፃ	-2267
▁ገለፃ	-2268
▁አትሌ	-2269
ፍን	-2270
▁በመግለፅ	-2271
▁ባለሙያ	-2272
▁የመጣ	-2273
▁መግባ	-2274
15	-2275
▁2011	-2276
▁አመልክተዋል	-2277
▁ዜና	-2278
ንቶ	-2279
▁ተችሏል	-2280
▁ጠባቂ	-2281
ሩም	-2282
▁እዚህ	-2283
▁ወዲህ	-2284
ታን	-2285
▁ተጋ	-2286
ፓርቲ	-2287
ባለው	-2288
ላቁ	-2289
▁ህፃ	-2290
▁ቁጥጥር	-2291
ላቂ	-2292
▁አስኪያ	-2293
ሻሻል	-2294
ወያ	-2295
ፖር	-2296
ምባ	-2297
▁ባለስልጣናት	-2298
▁ከውጭ	-2299
ይቶ	-2300
▁አልፎ	-2301
▁ጥና	-2302
▁በከተማ	-2303
ጨዋታው	-2304
▁እንድት	-2305
▁መሪዎች	-2306
▁ትና	-2307
▁ሊቀመን	-2308
ኬሽን	-2309
ዲት	-2310
▁መደረጉ	-2311
▁ሆኗል	-2312
▁ተሳታፊ	-2313
▁ከሚያ	-2314
ሾች	-2315
▁ለምን	-2316
▁አፈፃፀም	-2317
ግጥ	-2318
መጡ	-2319
18	-2320
▁የበላይ	-2321
▁በመጀመሪያ	-2322
▁ኔ	-2323
▁ምንጮች	-2324
ላኩ	-2325
▁እሱ	-2326
ያቂ	-2327
▁ጊዮርጊስ	-2328
▁የለው	-2329
▁በስተ	-2330
▁22	-2331
ኖራቸው	-2332
ማማ	-2333
▁ንግግር	-2334
ገልግሎ	-2335
ቆጠር	-2336
ሀኒ	-2337
ርዱ	-2338
▁ጓ	-2339
ዝና	-2340
ራች	-2341
የሁ	-2342
ንደ	-2343
▁ጋዜጣ	-2344
ፈልጋ	-2345
ባቸዋል	-2346
▁ባንኩ	-2347
▁ተሽከርካ	-2348
▁ዘግ	-2349
ጨት	-2350
ገረ	-2351
▁ረቂቅ	-2352
ስተዋል	-2353
ርቅ	-2354
ቃወ	-2355
▁ግብፅ	-2356
ታወቁ	-2357
▁ፈተና	-2358
▁አረ	-2359
▁በመጠቀም	-2360
ሳተፍ	-2361
ንጀል	-2362
▁ባለቤት	-2363
▁አጠና	-2364
▁የምግብ	-2365
ችላለ	-2366
ፈረን	-2367
▁ገበ	-2368
ክሽን	-2369
▁እርስ	-2370
▁ይላሉ	-2371
▁የሴ	-2372
▁ሴት	-2373
▁እንደሚሆን	-2374
▁መልክ	-2375
▁ችሏል	-2376
▁በዚሁ	-2377
ቡር	-2378
▁21	-2379
▁ግጭ	-2380
▁ወለ	-2381
ኒክ	-2382
▁ይሁንና	-2383
▁ማንኛውም	-2384
▁ለመስራት	-2385
▁የአንድ	-2386
▁ወረርሽኝ	-2387
ግባቡ	-2388
▁በስራ	-2389
ህና	-2390
▁እነዚህን	-2391
▁በህገ	-2392
▁ከጥ	-2393
▁ምርቶች	-2394
ናቀ	-2395
▁ጥቂት	-2396
▁መረጃዎች	-2397
ራቢ	-2398
ገውን	-2399
▁ሪፖርተር	-2400
▁አብራር	-2401
መለሱ	-2402
ብረተሰብ	-2403
▁ውጤታማ	-2404
ኳስ	-2405
▁ብዙሀን	-2406
▁አዋጁ	-2407
ሀሴ	-2408
ድረስ	-2409
▁ቋሚ	-2410
▁ሰባት	-2411
▁ከእነዚህ	-2412
▁መመሪያ	-2413
▁ሰኔ	-2414
▁መመርያ	-2415
በራቸው	-2416
▁ርእሰ	-2417
▁መሰረታዊ	-2418
ኬት	-2419
ገለፀው	-2420
▁ኢትዮጵያዊ	-2421
በራ	-2422
ኮኖሚያ	-2423
ሪምየር	-2424
▁ሰዎችን	-2425
▁ክለቦች	-2426
▁ቀላል	-2427
▁ተራ	-2428
▁ብል	-2429
ሀንነት	-2430
▁የቀረበ	-2431
▁አቋም	-2432
▁'	-2433
▁ሰለ	-2434
ካታ	-2435
ቡቲ	-2436
በኞች	-2437
▁ይዘ	-2438
▁የዩ	-2439
▁ልክ	-2440
መነ	-2441
▁ጨዋታው	-2442
▁ሲሆኑ	-2443
መደ	-2444
▁23	-2445
▁ልማ	-2446
▁የደቡብ	-2447
ጉም	-2448
▁ፕሮግራም	-2449
▁ህዝቡ	-2450
ተኛው	-2451
ሮቹ	-2452
▁ቆይታ	-2453
▁ባሉ	-2454
መሩ	-2455
ፈፀሙ	-2456
▁ተቃውሞ	-2457
▁አገሪቱ	-2458
▁ይበልጥ	-2459
▁ቅጣት	-2460
ለኝ	-2461
ንቃቄ	-2462
ታሉ	-2463
▁ማስረጃ	-2464
▁ልጆ	-2465
▁ጥቃ	-2466
▁ልምድ	-2467
▁የሚገኝ	-2468
.5	-2469
▁ውል	-2470
▁ተሰጥ	-2471
ቪድ	-2472
▁ሰነድ	-2473
▁ይገኛሉ	-2474
▁በኦሮሚያ	-2475
▁መልስ	-2476
▁ማክ	-2477
ሹራንስ	-2478
ቆጠሩ	-2479
▁በሁለት	-2480
▁ችሎ	-2481
▁ጠቅላላ	-2482
ገሪቱን	-2483
ገናኘ	-2484
▁መነሻ	-2485
▁የተፈ	-2486
▁በማሳ	-2487
▁የትግራይ	-2488
▁ዋስትና	-2489
▁በምር	-2490
ህንነት	-2491
ጠዋል	-2492
ገበ	-2493
▁አምባሳደር	-2494
ዲዮ	-2495
ጠፋ	-2496
▁ባለፈ	-2497
▁አቅርቦት	-2498
▁በዋና	-2499
ፌደራል	-2500
▁ከንቲባ	-2501
▁በየአ	-2502
▁እንዲፈ	-2503
ድኑ	-2504
▁ቅሬታ	-2505
ሄዱ	-2506
▁ምሳሌ	-2507
ሞት	-2508
ፕሎ	-2509
▁ሰብሳቢ	-2510
ጥን	-2511
በትና	-2512
ናገሩ	-2513
ቆጥ	-2514
▁እድሜ	-2515
ገባት	-2516
ፈጠረው	-2517
▁ህክምና	-2518
ታዎች	-2519
▁ተግባራት	-2520
▁ብሄር	-2521
ዘርፉ	-2522
▁ሁሉንም	-2523
▁በቀጥታ	-2524
▁በመጨረሻ	-2525
መልከት	-2526
▁ክት	-2527
ሳሰ	-2528
▁ማር	-2529
▁ገና	-2530
▁ለሀ	-2531
▁አቅርበዋል	-2532
ዥን	-2533
ረዱ	-2534
▁ስምም	-2535
▁የተናገሩት	-2536
ማቸውን	-2537
▁በአግባቡ	-2538
በሌ	-2539
▁ሹ	-2540
ኮኖሚያዊ	-2541
ርፍ	-2542
ጦች	-2543
ይቱ	-2544
▁አስቀ	-2545
▁በሁለተኛ	-2546
▁አድርገዋል	-2547
▁ዛ	-2548
▁ማሻሻያ	-2549
▁አነስተኛ	-2550
▁ያስረዳ	-2551
▁የውድድር	-2552
ጥቃት	-2553
▁እውነ	-2554
▁ዮሀንስ	-2555
▁ማረ	-2556
▁አማራጭ	-2557
ወደ	-2558
ሰጣቸው	-2559
ጠውን	-2560
ጣቸው	-2561
▁መግ	-2562
▁ሊሆኑ	-2563
▁ይታ	-2564
▁አስመልክቶ	-2565
▁አንተ	-2566
ስቸኳይ	-2567
▁አጥቂ	-2568
▁የዚህ	-2569
ጊዜው	-2570
▁የዋጋ	-2571
▁የሚለውን	-2572
ጅቱ	-2573
ንግሊዝ	-2574
ስተዳደር	-2575
ሆኑም	-2576
▁መኮ	-2577
▁ለህዝብ	-2578
▁መንግስታዊ	-2579
▁ተለ	-2580
▁እንደገለፁት	-2581
▁መወሰ	-2582
▁28	-2583
▁በማን	-2584
▁የደረ	-2585
▁ብርሀ	-2586
▁በህግ	-2587
▁መስከረም	-2588
▁በመሆኑ፣	-2589
▁ደጋፊ	-2590
▁ይታወቃል	-2591
▁የኦሮሚያ	-2592
▁ዘገባ	-2593
ኒው	-2594
▁ይናገራሉ	-2595
ርስቶ	-2596
▁እስራ	-2597
▁ጠይቀዋል	-2598
▁እየተደረገ	-2599
ገሩ	-2600
▁ጳ	-2601
▁በዚያ	-2602
▁አግባብ	-2603
▁ወሳኝ	-2604
▁ከሁለት	-2605
▁ትናንት	-2606
▁ወይዘ	-2607
▁ድርጊት	-2608
▁ካር	-2609
▁ወረ	-2610
ቷን	-2611
▁ጌታ	-2612
▁ሀብረት	-2613
ዛቤ	-2614
▁ጥቅምት	-2615
▁ደመ	-2616
▁ተያይ	-2617
▁ሚሊየን	-2618
▁ክለብ	-2619
ነጋገር	-2620
▁27	-2621
ያጭ	-2622
▁እም	-2623
ለያየ	-2624
▁መረጃዎችን	-2625
▁ይደ	-2626
ሪው	-2627
▁ደረ	-2628
▁ባለሀብቶች	-2629
▁አላቸው	-2630
▁ፍሬ	-2631
▁ስራዎችን	-2632
▁ሊቀመንበር	-2633
ሪት	-2634
▁የሚያደርጉ	-2635
▁ይኖ	-2636
ገመ	-2637
ዋሚ	-2638
▁በውጭ	-2639
ንብ	-2640
▁ተደራ	-2641
▁ኢንቨስትመንት	-2642
ግም	-2643
ቻላል	-2644
▁ልዩነት	-2645
▁ተቀባይ	-2646
▁አጀ	-2647
▁ዘመቻ	-2648
▁ፕሬዚዳን	-2649
▁ወገኖች	-2650
▁ተስፋዬ	-2651
▁የህክምና	-2652
▁አኳ	-2653
▁ጂ	-2654
ሮው	-2655
ጡን	-2656
ዮችን	-2657
▁ስጋ	-2658
▁ሶስተኛ	-2659
ጣጥ	-2660
▁አማካኝነት	-2661
ፍና	-2662
▁ወደፊት	-2663
▁መሸ	-2664
▁ፍቅር	-2665
▁በነበረው	-2666
▁አስደ	-2667
▁ቀጠ	-2668
ከሉ	-2669
ኳር	-2670
ሀዊ	-2671
ሊስ	-2672
ንባታ	-2673
▁ለምሳሌ	-2674
▁ያመለክታል	-2675
ገራችን	-2676
ፕሎማ	-2677
▁ለፍ	-2678
▁ይቻላል	-2679
ስትራክሽን	-2680
▁ወቅታዊ	-2681
ላከ	-2682
▁በሁሉም	-2683
ደል	-2684
▁ስህ	-2685
▁በትግራይ	-2686
▁የሆነውን	-2687
▁በዛሬው	-2688
▁ለብ	-2689
▁አቢ	-2690
ጠናቀቁ	-2691
ኢን	-2692
ቃቸው	-2693
ሳካ	-2694
▁ለመፍጠር	-2695
ከናወኑ	-2696
▁ይሄ	-2697
ዶችን	-2698
▁ያስተ	-2699
ነታቸውን	-2700
▁ማጣ	-2701
▁ትውል	-2702
▁ይዘው	-2703
▁እንደገለፁ	-2704
ላትን	-2705
▁የግብርና	-2706
▁ኤሌክትሪክ	-2707
ባበር	-2708
ለበት	-2709
ጋና	-2710
▁የመከላከያ	-2711
▁ዘመናዊ	-2712
ጀር	-2713
▁ጥቅ	-2714
▁አወ	-2715
ላይታ	-2716
▁ህብረት	-2717
▁()	-2718
▁ያደረገው	-2719
▁ትንሽ	-2720
▁ይኖር	-2721
▁መደበኛ	-2722
▁የደረሰ	-2723
▁እንደተናገሩት	-2724
ኒስት	-2725
ልጋ	-2726
▁26	-2727
▁ወገን	-2728
▁በቀላሉ	-2729
▁እንደገና	-2730
ስፋት	-2731
▁ማስታወ	-2732
ዳዩ	-2733
▁ተመ	-2734
ዳና	-2735
▁የቤት	-2736
የአ	-2737
▁አፍ	-2738
▁ጉብኝ	-2739
ሆነው	-2740
▁የባለ	-2741
▁የኤሌክትሪክ	-2742
▁ድርድር	-2743
▁ዴሞክራሲያዊ	-2744
ዳረ	-2745
▁ተጠርጣሪ	-2746
▁ስሜት	-2747
▁በግልፅ	-2748
▁ግንቦት	-2749
▁እየተሰራ	-2750
ኖችን	-2751
ፈጠሩ	-2752
▁የይ	-2753
▁ከአዲስ	-2754
▁አርብ	-2755
▁የምታ	-2756
▁ቶን	-2757
▁ግም	-2758
▁አውሮፕ	-2759
ካሄዱ	-2760
▁ሀዋሳ	-2761
▁የተደረገ	-2762
▁ኢኮኖሚያዊ	-2763
▁የመጀመሪያው	-2764
▁!	-2765
▁ሬ	-2766
▁የሚተ	-2767
ንፈ	-2768
ቫይረሱ	-2769
ኩት	-2770
▁ያስፈል	-2771
ሰስ	-2772
▁እንደማ	-2773
▁የባንኩ	-2774
ገልግሎት	-2775
▁ባደረጉት	-2776
ጣቱ	-2777
ፋሉ	-2778
ቀፍ	-2779
ጠኞች	-2780
ንድን	-2781
▁መዘ	-2782
ራዘ	-2783
▁አማካይነት	-2784
ክተሩ	-2785
▁ኩባንያው	-2786
ዝቡ	-2787
ቀመጥ	-2788
▁የባንክ	-2789
▁ደስታ	-2790
▁ወይዘሮ	-2791
▁የተሰማ	-2792
▁ፈፅ	-2793
▁መጀመሪያ	-2794
ፋን	-2795
199	-2796
ቴጂ	-2797
ገበያ	-2798
▁እያደረገ	-2799
ቻለው	-2800
▁ያሉትን	-2801
▁በፖ	-2802
በርካታ	-2803
▁ነጋዴ	-2804
ቀል	-2805
▁የሰራ	-2806
▁እንደገለፁት፣	-2807
▁የተመሰረተ	-2808
▁አሳስበዋል	-2809
▁ቅርንጫ	-2810
▁ትብብር	-2811
ጋጠ	-2812
ያዘው	-2813
▁ተቋማ	-2814
▁አለባቸው	-2815
▁አብራርተዋል	-2816
▁አርሶ	-2817
▁ከዚህም	-2818
ደርሱ	-2819
▁የተገኘ	-2820
▁በአካባቢው	-2821
ቀሳ	-2822
ጨዋታ	-2823
▁ሲሆን፤	-2824
ችልም	-2825
ብርሀ	-2826
▁ዘርፎች	-2827
▁በፅ	-2828
▁በቦ	-2829
ቅርብ	-2830
▁ነጥ	-2831
ለካ	-2832
▁ወጣት	-2833
ሎቹ	-2834
▁ጭማሪ	-2835
▁በፕ	-2836
-1	-2837
▁የብሄራዊ	-2838
ከናው	-2839
▁በቀጣ	-2840
ሎስ	-2841
▁ራሱን	-2842
▁በሀላ	-2843
ሁድ	-2844
▁አቤቱ	-2845
ራሽ	-2846
▁የመጀመርያ	-2847
▁ነፃነት	-2848
ስቡ	-2849
▁የዲ	-2850
▁የተባበሩት	-2851
▁ስፖርት	-2852
ልፅግና	-2853
▁አስኪያጅ	-2854
▁በአማራ	-2855
▁የቱ	-2856
▁ስደ	-2857
▁ሆቴል	-2858
▁ቀድሞ	-2859
▁አብዱ	-2860
ነሰ	-2861
▁ያመ	-2862
ከላዊ	-2863
▁ነው፣	-2864
ዳሜ	-2865
▁መስተዳ	-2866
▁/	-2867
ሮጀ	-2868
ሳሉ	-2869
▁ልም	-2870
▁ወታደራዊ	-2871
ገልፁ	-2872
ህል	-2873
▁ለአንድ	-2874
ረጋጋት	-2875
ለል	-2876
ውሰድ	-2877
▁ያስታወ	-2878
▁ክር	-2879
▁ችሎት	-2880
▁እውቅና	-2881
▁አንድነት	-2882
ሪዝም	-2883
▁አንዳን	-2884
▁የአምላክ	-2885
ጎችን	-2886
▁የሚገባ	-2887
ተኝነት	-2888
▁የዜ	-2889
ሂሳብ	-2890
ክታር	-2891
▁ሆስ	-2892
▁ኑ	-2893
...	-2894
ስተው	-2895
መለከተው	-2896
▁የፅ	-2897
▁ምንጭ	-2898
▁ቀዳሚ	-2899
▁አረጋግ	-2900
▁በቀለ	-2901
▁በመስጠት	-2902
-0	-2903
ክሩ	-2904
ዋቂ	-2905
ጋዜ	-2906
▁እንደሆኑ	-2907
በትም	-2908
▁ፕሬዝዳንት	-2909
▁ድንጋጌ	-2910
ንቀሳቀሱ	-2911
▁ይቀ	-2912
▁ምሁ	-2913
▁ተያይዞ	-2914
▁የተለየ	-2915
▁አለመሆኑ	-2916
ጋጥ	-2917
12	-2918
▁ፀሀፊ	-2919
▁ያደረጉት	-2920
ርስቶስ	-2921
▁ጠቅሰዋል	-2922
▁የእር	-2923
▁አክሲ	-2924
▁ፍፁም	-2925
ጀመርያው	-2926
▁ሰጥተዋል	-2927
▁ጥላ	-2928
▁ጥራት	-2929
ሰጠ	-2930
▁እንዳለባቸው	-2931
▁50	-2932
ካን	-2933
ሜሽን	-2934
▁ኤል	-2935
▁ተጠያቂ	-2936
▁የምርመራ	-2937
▁የተከሰ	-2938
▁የተወሰነ	-2939
አብ	-2940
▁በኢን	-2941
▁በድጋሚ	-2942
ሲል	-2943
ሯቸው	-2944
▁ግዛት	-2945
ድርሻ	-2946
▁አክለዋል	-2947
▁ስትራ	-2948
▁2009	-2949
▁መሆናቸው	-2950
▁ቪ	-2951
ሳን	-2952
በላ	-2953
▁ይፈ	-2954
▁0	-2955
▁ሳቢያ	-2956
ትም	-2957
ናልባት	-2958
▁የማእ	-2959
ቢሲ	-2960
▁እንዳልሆነ	-2961
ችሁን	-2962
▁ሰላማዊ	-2963
▁ፅሁፍ	-2964
እና	-2965
ወሰን	-2966
▁ይሰጣ	-2967
▁ግዴ	-2968
ሊን	-2969
▁ተብለው	-2970
ይታ	-2971
▁የሚያሳ	-2972
▁ኮርፖሬሽን	-2973
ቐለ	-2974
▁የሚሰራ	-2975
▁መቆየ	-2976
▁ፕሮፌ	-2977
በአ	-2978
▁ስለተ	-2979
▁ካለው	-2980
ፈዋል	-2981
▁ስራው	-2982
ጣሪዎች	-2983
▁ዝግጁ	-2984
▁መጋቢት	-2985
▁እንዳሉት	-2986
ገለግ	-2987
▁ከሌ	-2988
▁አኳያ	-2989
▁ተጫዋች	-2990
▁በመሆናቸው	-2991
▁የቢ	-2992
▁ትራንስፖርት	-2993
▁ሳያ	-2994
▁ለስ	-2995
ሰልጣ	-2996
ፈለጉ	-2997
▁ስቴትስ	-2998
▁የሁለቱ	-2999
17	-3000
▁ተመስ	-3001
ቸጋሪ	-3002
▁ብሄረ	-3003
▁ዝቅተኛ	-3004
▁ሰጪ	-3005
▁ስራውን	-3006
ክለቡ	-3007
ናይ	-3008
▁ሰጥቷል	-3009
ላችን	-3010
▁ላይም	-3011
▁መጠቀም	-3012
ቾችን	-3013
ሰኞ	-3014
▁ብቃት	-3015
▁ቻይና	-3016
▁29	-3017
ኮም	-3018
▁ዳዊት	-3019
▁ጅማ	-3020
▁ተመራ	-3021
▁ድረ	-3022
▁ካሉ	-3023
ዘጋጀት	-3024
ፈልገው	-3025
ጀምር	-3026
▁ተል	-3027
▁ተወዳ	-3028
ዘዋ	-3029
▁እንደምት	-3030
ላቸዋል	-3031
▁የሚመራ	-3032
▁ቁር	-3033
▁ኢንጂ	-3034
ኔት	-3035
▁ሳምን	-3036
▁የነዳጅ	-3037
▁ተቀባይነት	-3038
ንቀሳቀስ	-3039
መና	-3040
ጥረው	-3041
▁የሚሉት	-3042
ሴን	-3043
▁ሰብአዊ	-3044
▁ከሳ	-3045
▁አጀንዳ	-3046
▁በፀ	-3047
▁ከት	-3048
60	-3049
▁እስኪ	-3050
ሶችን	-3051
▁በካ	-3052
ቪዥን	-3053
▁ቀጠሮ	-3054
▁እቅ	-3055
ይማኖት	-3056
▁መፈ	-3057
▁ነዋሪ	-3058
▁ይኸ	-3059
ጣኝ	-3060
▁ሰን	-3061
ከተል	-3062
▁ሪፖር	-3063
▁አዳማ	-3064
▁የብድር	-3065
▁የኢንዱስትሪ	-3066
▁ጀም	-3067
ቶች፣	-3068
ያንስ	-3069
▁ታስ	-3070
▁እናንተ	-3071
▁ጉል	-3072
▁ቅድመ	-3073
▁40	-3074
▁ኮሚቴው	-3075
ኩባንያ	-3076
▁የቻይና	-3077
ሴት	-3078
▁ኤር	-3079
▁መገኘ	-3080
ጓዝ	-3081
ቻይና	-3082
▁ርቀት	-3083
▁ችግሮችን	-3084
ሙስ	-3085
ጀም	-3086
▁እንደሚገኙ	-3087
ንክ	-3088
ሬዚ	-3089
▁ከመስ	-3090
▁2008	-3091
ተኮ	-3092
▁አሻ	-3093
ቲክ	-3094
▁ግርማ	-3095
ኦሮሞ	-3096
ችኋ	-3097
▁የእድ	-3098
▁ፖለቲካዊ	-3099
▁ጉድ	-3100
ፎርሜሽን	-3101
▁በግብ	-3102
ቆይ	-3103
▁በአሜሪካ	-3104
▁ክርስቲያ	-3105
▁ድርጅቱ	-3106
▁በሀገሪቱ	-3107
▁ተቀብ	-3108
▁ከተለያዩ	-3109
▁ዱ	-3110
ካኤል	-3111
▁የስነ	-3112
▁ሁኔታዎች	-3113
▁ምናልባት	-3114
▁ማለትም	-3115
▁ሀምሌ	-3116
ጠኝነት	-3117
ባር	-3118
ረፍት	-3119
▁የሊ	-3120
▁ታደሰ	-3121
▁ማርያም	-3122
14	-3123
ከናወነ	-3124
ላእክት	-3125
▁ፕሪምየር	-3126
▁.	-3127
ጠቀሱት	-3128
▁ባወጣው	-3129
▁፲	-3130
▁በመም	-3131
▁የገቢ	-3132
▁መፍጠር	-3133
መም	-3134
ግግር	-3135
▁ዳን	-3136
▁ገደ	-3137
▁ታላቅ	-3138
▁ብዬ	-3139
ገራቸው	-3140
▁ገፃ	-3141
▁የወንጀል	-3142
ተናል	-3143
▁የሚሉ	-3144
▁መስጠ	-3145
▁ማሀበራት	-3146
▁በውይ	-3147
▁ተደርጓል	-3148
▁ነሀሴ	-3149
▁ከደ	-3150
▁ከፋ	-3151
ገናኝ	-3152
▁ለዘ	-3153
▁://	-3154
ኔራል	-3155
ፓርላማ	-3156
ኤስ	-3157
▁መርማሪ	-3158
▁በሚገኘው	-3159
▁ጊዜያት	-3160
▁መፍ	-3161
▁ማቅረብ	-3162
ቱ፣	-3163
▁ደንብ	-3164
ነገር	-3165
ዶቹ	-3166
▁አብሮ	-3167
▁እግዚአብሄር	-3168
▁ደም	-3169
ፆች	-3170
▁ለወ	-3171
▁የን	-3172
▁በህዝብ	-3173
▁የጠቆ	-3174
▁አቅራቢ	-3175
ራው	-3176
▁መጣ	-3177
▁በመጥ	-3178
▁ምክንያቶች	-3179
ዴሞክራሲ	-3180
▁የግድ	-3181
▁አገራዊ	-3182
▁ጠቁመው	-3183
ወሰነ	-3184
▁ይሆዋ	-3185
በሪያ	-3186
▁ሄክታር	-3187
▁ስትራቴጂ	-3188
ቪል	-3189
ጊያ	-3190
▁ጉዳዩን	-3191
▁አንስቶ	-3192
ወስድ	-3193
▁ለማሳደግ	-3194
▁በሁለተኛው	-3195
▁ሉ	-3196
▁የምና	-3197
ቆች	-3198
▁የተቀመ	-3199
▁እንዳሉ	-3200
▁ነኝ	-3201
▁ታማ	-3202
▁ግዥ	-3203
▁ውድድ	-3204
ጁን	-3205
ዎችም	-3206
▁የወሰ	-3207
▁ሲባል	-3208
▁የገበያ	-3209
▁በሳ	-3210
▁የተባሉ	-3211
▁ለፍርድ	-3212
▁የሚኖሩ	-3213
አይ	-3214
▁ተገ	-3215
▁የሚባል	-3216
▁የፋና	-3217
የሩ	-3218
▁አመለካ	-3219
ልቃ	-3220
▁ተስማ	-3221
ረከ	-3222
ጥሩ	-3223
▁ነዳጅ	-3224
▁የሀይል	-3225
▁መጨ	-3226
▁የመል	-3227
▁የቁ	-3228
▁የካቲት	-3229
ሞላ	-3230
▁ገዥ	-3231
▁ለዚህም	-3232
▁አስቸጋሪ	-3233
ሌት	-3234
▁ለመገንባት	-3235
▁ክርስቲያን	-3236
መለከታቸው	-3237
ሊክ	-3238
▁እንደመ	-3239
▁የሚሆን	-3240
▁ተነ	-3241
▁ፍቃ	-3242
▁አቅርቦ	-3243
ሏቸው	-3244
▁እንደሚችሉ	-3245
ሲያ	-3246
▁ሆይ	-3247
ናቂ	-3248
▁ምርጥ	-3249
▁ካፒታል	-3250
▁ህፃናት	-3251
ድቅ	-3252
▁እየታ	-3253
▁ቀይ	-3254
▁የባህር	-3255
▁ተሸ	-3256
ወገድ	-3257
ኬንያ	-3258
▁ያደርጋል	-3259
▁የያህዌ	-3260
▁ዋነኛ	-3261
2013	-3262
▁አስተያየ	-3263
▁መቅ	-3264
▁አስተዳደሩ	-3265
▁ቀጣይ	-3266
▁ደቂቃዎች	-3267
መቻ	-3268
▁ገልፀው	-3269
ሊሞች	-3270
▁የፓርቲ	-3271
ዘጋጁ	-3272
▁ደስ	-3273
▁ድንበር	-3274
▁ጌታቸው	-3275
ቋረጥ	-3276
▁የሚጠ	-3277
▁መድሀኒ	-3278
ሪስ	-3279
▁ቲ	-3280
▁ይመስላል	-3281
ግዳ	-3282
▁እንደሆነም	-3283
▁መንፈስ	-3284
▁የተከ	-3285
▁ዘዴ	-3286
▁በድር	-3287
ችግ	-3288
ሮድ	-3289
▁ህገወጥ	-3290
እክ	-3291
▁ወርቅ	-3292
40	-3293
ምረ	-3294
▁ባስ	-3295
▁ሰአ	-3296
ቤል	-3297
▁በዝ	-3298
ደርጋ	-3299
▁ስምንት	-3300
▁አልነበረ	-3301
▁ዝግጅ	-3302
▁የተደረገው	-3303
▁በእርግጥ	-3304
▁ቆይቷል	-3305
▁በአጭር	-3306
▁መገናኛ	-3307
▁ፒ	-3308
▁ሁለተኛው	-3309
▁ቀውስ	-3310
▁የሚደረግ	-3311
▁የመሬት	-3312
▁በየአመቱ	-3313
▁ድቻ	-3314
▁በይፋ	-3315
▁ጨረታ	-3316
ማሉ	-3317
ገነቡ	-3318
ሪንግ	-3319
ባባሪ	-3320
▁በሙ	-3321
▁መኖሪያ	-3322
▁ወዳ	-3323
▁አሳል	-3324
▁ሲሉም	-3325
ጪው	-3326
▁በነፃ	-3327
▁ለማቅረብ	-3328
▁ትክክለኛ	-3329
▁መሰረተ	-3330
▁ለመግ	-3331
ዋእ	-3332
▁ክትትል	-3333
▁ለማረጋገጥ	-3334
▁ክስተ	-3335
▁ለመሆን	-3336
ልጣን	-3337
▁ማረጋገ	-3338
▁አድራ	-3339
▁ላለፉት	-3340
ላጆች	-3341
▁ምስራቅ	-3342
▁ቀጣ	-3343
ዩኒኬሽን	-3344
▁ምእራፍ	-3345
▁ያለበት	-3346
▁ታሪካ	-3347
▁መብቶች	-3348
ገቡት	-3349
▁እንስ	-3350
▁ምህ	-3351
▁ፈጣን	-3352
▁በራሱ	-3353
▁ኬንያ	-3354
▁የምክር	-3355
▁ሊያስ	-3356
▁ከመንግስት	-3357
ገማ	-3358
▁ለጥ	-3359
ፓን	-3360
ዘጋጀው	-3361
▁100	-3362
▁አስቀድሞ	-3363
ሟላ	-3364
25	-3365
2011	-3366
▁ለግ	-3367
▁ምቹ	-3368
▁ደሳ	-3369
▁አማካሪ	-3370
▁የሀገሪቱ	-3371
ሰቦ	-3372
▁የሳ	-3373
▁በኋላ፣	-3374
በተ	-3375
ይጣ	-3376
▁ጠቃ	-3377
▁ኮንት	-3378
▁እንዳላቸው	-3379
ገባቸው	-3380
▁የኢትዮጵያን	-3381
▁ደህንነት	-3382
ፍሬ	-3383
▁ደሀንነት	-3384
ሽት	-3385
▁መልሶ	-3386
▁የአውሮፓ	-3387
ሳቁ	-3388
▁መኮንን	-3389
▁ነበር፤	-3390
▁ስርአቱ	-3391
ክኒክ	-3392
▁ግዙ	-3393
▁ሎ	-3394
ማግ	-3395
▁በሶ	-3396
▁መሀል	-3397
▁አቻ	-3398
▁ንብረ	-3399
▁ዘንድሮ	-3400
▁ወንጀ	-3401
▁የሚሰጥ	-3402
ክክር	-3403
▁በዳ	-3404
▁አደረጃ	-3405
ንዳንድ	-3406
▁የቤተ	-3407
▁ትርጉም	-3408
▁እንድን	-3409
▁ኮሚሽነር	-3410
▁የሶ	-3411
▁የተመረ	-3412
ቋረ	-3413
ዲያው	-3414
▁በአብዛ	-3415
ጨመረ	-3416
ዎት	-3417
▁የተገኘው	-3418
▁ማህበረሰብ	-3419
ወጣት	-3420
▁እንዲሆኑ	-3421
ሁዳ	-3422
▁የቆየ	-3423
▁በአንፃ	-3424
▁ማህበራዊ	-3425
▁ለሚያ	-3426
▁ትርፍ	-3427
▁ጠቃሚ	-3428
ረጅም	-3429
▁በትክ	-3430
▁ኢትዮ	-3431
▁1.	-3432
▁የተወ	-3433
▁የክልል	-3434
ጠነ	-3435
ቁር	-3436
▁ይቅር	-3437
▁በቡ	-3438
ያቸውን	-3439
▁ተከታታይ	-3440
▁ማክሰኞ	-3441
ዚቃ	-3442
▁ደሳለኝ	-3443
ሳሰብ	-3444
▁ይገልፃሉ	-3445
▁ቀበሌ	-3446
ሸጥ	-3447
▁ትስ	-3448
ጎብ	-3449
ነት፣	-3450
▁ምድብ	-3451
13	-3452
▁ባደረገው	-3453
ራምፕ	-3454
ሚንቶ	-3455
ፌዴሪ	-3456
ፈፅ	-3457
▁ያደረጉ	-3458
በታ	-3459
እራብ	-3460
▁በቴ	-3461
▁መጠየ	-3462
▁በመጠ	-3463
▁ብዛት	-3464
ከሩ	-3465
▁የህዳሴ	-3466
ዋት	-3467
ሚዎች	-3468
▁ዳይሬክተሩ	-3469
▁ኢንስ	-3470
ላለች	-3471
ሰና	-3472
▁አጠቃ	-3473
▁ታክስ	-3474
▁ዘላቂ	-3475
▁ብርሀኑ	-3476
▁የቴሌ	-3477
▁መከላከል	-3478
ሀሳስ	-3479
ሶማሌ	-3480
ቃሉ	-3481
▁ጠብ	-3482
ከቱ	-3483
▁በገ	-3484
▁በማቅረብ	-3485
▁ናት	-3486
?"	-3487
▁መፃ	-3488
▁ከብ	-3489
ልማ	-3490
ተኞችን	-3491
▁በእጅ	-3492
▁ሰሞ	-3493
▁በፌዴራል	-3494
▁ትልቁ	-3495
▁ክብር	-3496
▁አመታዊ	-3497
ረክ	-3498
ገበው	-3499
▁አቤቱታ	-3500
▁ዘግቧል	-3501
ውጣ	-3502
▁የተቋቋ	-3503
▁የጠቅላይ	-3504
ዮቹ	-3505
ማግሌ	-3506
ነበር	-3507
ይህ	-3508
ጃሉ	-3509
▁ፌ	-3510
▁ተር	-3511
▁ሰለሞን	-3512
▁ያስፈልጋል	-3513
▁የተሻ	-3514
ራፊ	-3515
ዳጊ	-3516
▁ቢያንስ	-3517
▁የግንባታ	-3518
▁በተካሄደው	-3519
▁የኢንቨስትመንት	-3520
▁መጀመ	-3521
▁በዋናነት	-3522
▁የትራንስፖርት	-3523
ክቷል	-3524
▁መሰል	-3525
▁የእስራኤል	-3526
▁ቅዳሜ	-3527
ሰቢያ	-3528
▁ሰኞ	-3529
ገኘውን	-3530
ጌታ	-3531
ለቱን	-3532
▁ምግባር	-3533
▁ሀይሉ	-3534
▁ማቆ	-3535
▁ቀሪ	-3536
▁በሊ	-3537
ቁሟል	-3538
ላቱ	-3539
▁ሰማ	-3540
▁ያሸን	-3541
ናሽናል	-3542
▁በስተቀር	-3543
▁የተቃ	-3544
▁ተገለፀ	-3545
▁የሚቆጠሩ	-3546
ጋቸውን	-3547
▁እያለ	-3548
▁ማሀበረሰብ	-3549
መለከቱ	-3550
▁ሰላምና	-3551
▁ጥንቃቄ	-3552
▁ተናግሯል	-3553
▁የወደቁ	-3554
▁ከበደ	-3555
▁ግምት	-3556
▁የአገሪቱን	-3557
▁እኩል	-3558
▁ሰራተኛ	-3559
▁የመንገድ	-3560
▁ስህተት	-3561
ጣኔ	-3562
▁ግንዛቤ	-3563
▁አቢይ	-3564
▁ጉብኝት	-3565
▁ስርጭት	-3566
ኖስ	-3567
ህሳስ	-3568
ምባሲ	-3569
ገልፅ	-3570
▁እንደም	-3571
▁በሽታ	-3572
▁ይደረ	-3573
ደገፍ	-3574
ጠይቅ	-3575
▁የቡና	-3576
▁ኮሚሽኑ	-3577
▁እየተካሄደ	-3578
▁ሚዲያ	-3579
▁አብርሀ	-3580
▁ሳምንታት	-3581
ዲን	-3582
▁አልቻ	-3583
▁የጣ	-3584
▁ምስክ	-3585
▁በተደረገው	-3586
▁ማመን	-3587
▁ወንዶች	-3588
▁ስታዲ	-3589
ዳቸውን	-3590
ሟላት	-3591
▁ችግሩን	-3592
▁እህ	-3593
መዝገብ	-3594
16	-3595
በት፣	-3596
ውውር	-3597
ሬን	-3598
ዝገባ	-3599
▁በብዙ	-3600
▁ተልእ	-3601
▁ተቀም	-3602
▁ሲነ	-3603
▁የህወሀት	-3604
ገንዝ	-3605
▁የሀገር	-3606
ረጋጋ	-3607
▁ህዳሴ	-3608
▁ገልፀው፣	-3609
▁እጩ	-3610
▁በሚመለከት	-3611
▁ባለቤ	-3612
▁ያለመ	-3613
▁በእነዚህ	-3614
እምሮ	-3615
ሰበው	-3616
▁የሚወ	-3617
ችውን	-3618
▁ካልተ	-3619
▁የተጣ	-3620
▁ለቀ	-3621
▁መስክ	-3622
▁የመላእክት	-3623
▁እራ	-3624
▁ዳኛ	-3625
▁አሳይ	-3626
▁የሚገ	-3627
ፍራሉ	-3628
▁የግብፅ	-3629
ፋቸው	-3630
▁የአካባቢ	-3631
ቆዩ	-3632
▁ያድር	-3633
▁የተባለ	-3634
ሆኑት	-3635
▁ታይ	-3636
▁የሚሰሩ	-3637
▁በን	-3638
በረሰቡ	-3639
ናገድ	-3640
▁ቤተሰብ	-3641
ይጣንም	-3642
ዥም	-3643
▁በመል	-3644
▁ልኡ	-3645
መስረት	-3646
▁የፍትወት	-3647
▁ብልጫ	-3648
▁የሚገኙት	-3649
▁ተይ	-3650
▁ያሸንፋሉ	-3651
ለትን	-3652
▁እቃዎች	-3653
▁ዘርፉ	-3654
▁የፊ	-3655
▁ግዴታ	-3656
▁የሚያደርግ	-3657
▁በዚ	-3658
ሙዩኒኬሽን	-3659
▁ታዋቂ	-3660
▁ያውጃሉ	-3661
▁የያዘ	-3662
▁የእግር	-3663
▁የምርት	-3664
▁በምን	-3665
▁ስኬ	-3666
▁እነሱ	-3667
▁እንዲቀ	-3668
ካካ	-3669
▁ተወስ	-3670
▁ቅድሚያ	-3671
▁እንዳያ	-3672
▁ይደፍራሉ	-3673
▁ወንዝ	-3674
▁ገደብ	-3675
ልድ	-3676
ሰለ	-3677
▁ኔፊ	-3678
▁እንዲያስ	-3679
▁ራሳቸውን	-3680
▁መቀመ	-3681
▁ተነግ	-3682
▁ተሰማ	-3683
▁ኔፊሊሞች	-3684
ታወቅ	-3685
▁አሸን	-3686
▁ለሰይጣንም	-3687
ጠናቀቀ	-3688
▁ማየት	-3689
▁ለመጀመሪያ	-3690
▁ሲያስ	-3691
▁የቀድሞው	-3692
▁የህዝ	-3693
ሙና	-3694
▁ክለቡ	-3695
ጎል	-3696
▁ሁለቱም	-3697
ርነት	-3698
▁አገልጋ	-3699
▁መሆኑን፣	-3700
ለመ	-3701
▁ትግል	-3702
▁በሚገኙ	-3703
▁ያሳያል	-3704
▁እያንዳንዱ	-3705
▁አፅ	-3706
▁ክፍተት	-3707
ሳው	-3708
ድሮስ	-3709
▁አክሲዮን	-3710
▁የጊዜ	-3711
▁መስዋእ	-3712
ዳው	-3713
▁የመሳሰ	-3714
▁ኦሮ	-3715
▁ሀሳቦች	-3716
▁ፀጋ	-3717
▁ነገሮችን	-3718
▁የፌደራል	-3719
ሴቶች	-3720
▁ማዳ	-3721
▁በስፋት	-3722
ሉ፣	-3723
▁ማንም	-3724
▁ሰሞኑን	-3725
ሾቹ	-3726
ኖሪያ	-3727
▁ብርሀን	-3728
ጣቂ	-3729
▁2007	-3730
▁በኋላም	-3731
ኑት	-3732
ውሎስ	-3733
▁ፈር	-3734
ላካ	-3735
▁መቻ	-3736
▁በምት	-3737
▁ተሞ	-3738
ፈፀመው	-3739
▁ብቸ	-3740
▁አልባ	-3741
▁አዘጋጅ	-3742
▁70	-3743
ጠቅላላ	-3744
▁ችግሩ	-3745
▁ሽማግሌ	-3746
▁መሳሪያዎች	-3747
ጋንዳ	-3748
ከን	-3749
▁ዴኤ	-3750
ጎን	-3751
▁ሰጥቶ	-3752
▁ህጉ	-3753
▁ግንባር	-3754
▁የተፈጥሮ	-3755
▁እሁድ	-3756
▁ምልክት	-3757
▁ሌሎችም	-3758
▁መኪና	-3759
▁ለአዲስ	-3760
▁ሽልማት	-3761
▁ይሰራ	-3762
▁ከላይ	-3763
▁ከሶስት	-3764
ኤም	-3765
ፃሜ	-3766
▁የእርስ	-3767
▁ፕሮፌሰር	-3768
▁ብለን	-3769
▁በሶስት	-3770
▁ለመመለስ	-3771
ቴን	-3772
▁ታሪ	-3773
▁ለሁለት	-3774
ረግ	-3775
▁ማሽ	-3776
▁መደረጉን	-3777
▁አውጥ	-3778
▁የሂሳብ	-3779
▁ዳግም	-3780
▁ተልእኮ	-3781
ከፊ	-3782
▁ሲዳማ	-3783
▁አንደ	-3784
▁እያስ	-3785
▁ታሪካዊ	-3786
▁ክርክር	-3787
▁ትምህር	-3788
ናቃ	-3789
ጠንቀ	-3790
ስተካከል	-3791
▁ጉባኤው	-3792
ንጀ	-3793
ካከ	-3794
▁የተሳ	-3795
▁ሊጉ	-3796
▁ጄኔራል	-3797
ዮኖች	-3798
▁ትስስር	-3799
ገዝ	-3800
▁ጠቅሰው	-3801
▁ባለድርሻ	-3802
▁መልእክ	-3803
▁መኖር	-3804
▁ተመር	-3805
▁የኦሮሞ	-3806
▁ቀርቦ	-3807
▁ዘጠኝ	-3808
▁መባ	-3809
ፈቀደ	-3810
▁ይሆን	-3811
▁ከኢ	-3812
ሮድካ	-3813
ቅረፍ	-3814
ፈለግ	-3815
▁የሰጡት	-3816
ዝነስ	-3817
ፕሎማሲ	-3818
▁ሀሙስ	-3819
▁ለመቆጣጠር	-3820
▁ተሽከርካሪዎች	-3821
▁ውይይ	-3822
ህበራዊ	-3823
▁፡	-3824
▁ባህል	-3825
ቅናቄ	-3826
▁ትኩስ	-3827
ምራት	-3828
▁ንፁ	-3829
▁አምራ	-3830
▁አመልክቷል	-3831
▁ይጠቁ	-3832
▁ዳንኤል	-3833
80	-3834
ዋለሁ	-3835
▁ኢህአዴግ	-3836
▁ማጥ	-3837
▁የተሰጠው	-3838
▁ተጨዋ	-3839
ፈረንሳይ	-3840
▁አሰፋ	-3841
ሏላዊ	-3842
ከተለው	-3843
▁በአብዛኛው	-3844
ሞችን	-3845
ቱና	-3846
ደስ	-3847
ኘው	-3848
▁ግዛ	-3849
▁የፌዴ	-3850
ሊት	-3851
▁ፉ	-3852
▁ያገኘነው	-3853
▁የሆ	-3854
ምቤ	-3855
ወዝ	-3856
▁ምርምር	-3857
▁ፌዴሬሽን	-3858
▁በማይ	-3859
ላለፉ	-3860
ድና	-3861
▁እዳ	-3862
▁ሆስፒታል	-3863
ቃሽ	-3864
ጋለ	-3865
ገለፅ	-3866
▁ጥበብ	-3867
▁ማህበር	-3868
▁በድን	-3869
▁የሱዳን	-3870
▁ግለሰብ	-3871
▁ከኮ	-3872
▁ለት	-3873
▁በሚያስ	-3874
ብሮ	-3875
ዘቡ	-3876
ፎችን	-3877
▁ፓርክ	-3878
▁አዛ	-3879
▁ተነስ	-3880
ናሉ	-3881
▁ድሬዳዋ	-3882
ስቡክ	-3883
ያኑ	-3884
▁ኤርትራ	-3885
▁አገልግሎቶች	-3886
▁አቀፉ	-3887
ልኝ	-3888
▁ሁል	-3889
▁ታዲያ	-3890
▁የተመዘ	-3891
ፃፀር	-3892
▁ሽያጭ	-3893
▁በእው	-3894
▁ህብረተሰቡ	-3895
▁በጥሩ	-3896
▁ግራ	-3897
ብብ	-3898
ከም	-3899
▁አለመሆኑን	-3900
▁ፅሁ	-3901
ሆንም	-3902
▁የሸ	-3903
▁ቁሳቁ	-3904
▁ፋብሪካዎች	-3905
ቀቅ	-3906
▁እሱም	-3907
ደቢት	-3908
▁ቁጥ	-3909
▁የተሰራ	-3910
▁ቦርዱ	-3911
▁በመን	-3912
▁ምስክር	-3913
▁በኦ	-3914
▁የአን	-3915
ምሩክ	-3916
ንነት	-3917
▁ትራምፕ	-3918
▁እንደሌለ	-3919
▁የወጪ	-3920
▁ከአለም	-3921
▁ፍትሀዊ	-3922
▁ተጠርጣሪዎች	-3923
▁ጁ	-3924
▁ሞት	-3925
▁እርሻ	-3926
▁እንዲያው	-3927
ጭነት	-3928
▁በሞ	-3929
▁ህል	-3930
ዮሽ	-3931
▁ያድርጉ	-3932
ከለኛ	-3933
▁ህዝባዊ	-3934
▁መስተዳድር	-3935
▁እያሳ	-3936
መጥ	-3937
ብቅ	-3938
ንታል	-3939
▁በኮሮና	-3940
▁ተጠቁሟል	-3941
ኡዲ	-3942
2010	-3943
▁ብዙም	-3944
▁መከራ	-3945
ሸጋ	-3946
▁199	-3947
▁አክል	-3948
ርሶ	-3949
ናንተ	-3950
.2	-3951
▁በሜዳ	-3952
▁የሁለት	-3953
▁መምጣ	-3954
▁ጥፋት	-3955
ትነት	-3956
▁አጠ	-3957
▁ዝና	-3958
▁በመጥቀስ	-3959
▁የኤርትራ	-3960
ሬድ	-3961
ባባይ	-3962
▁ተቃዋሚ	-3963
▁በተቃ	-3964
▁በአመት	-3965
ፈጠር	-3966
▁[	-3967
▁ወጥቶ	-3968
▁ትውልድ	-3969
ዟል	-3970
▁አክልበ	-3971
▁እንዲሰጥ	-3972
▁የሚታወስ	-3973
ችበት	-3974
▁በቤ	-3975
ረፍ	-3976
ባክ	-3977
▁በእን	-3978
▁ዋናው	-3979
ማስ	-3980
▁መረ	-3981
ላውያን	-3982
▁ከል	-3983
▁በባለ	-3984
▁ኢንሹራንስ	-3985
ጥፍ	-3986
ጠብቁ	-3987
ረጋገጠ	-3988
ዎቻቸው	-3989
▁የሚሆነው	-3990
ማካይ	-3991
▁ካርድ	-3992
ገስ	-3993
▁ጨዋታውን	-3994
ያሜ	-3995
፱፻	-3996
ራቱ	-3997
ሙኤል	-3998
▁ትራንስ	-3999
▁በትክክል	-4000
ለድ	-4001
ምረው	-4002
▁ግዙፍ	-4003
▁ግምገማ	-4004
ፐብ	-4005
ገናኙ	-4006
ጥረ	-4007
ርሱ	-4008
▁ግብረ	-4009
▁እንዳልተ	-4010
ግበር	-4011
▁ለሙሉ	-4012
▁ሰብስ	-4013
ነበረበት	-4014
▁ያስች	-4015
ፈታ	-4016
70	-4017
▁ብት	-4018
▁መዛ	-4019
መዝግ	-4020
ሉትን	-4021
▁የተጀመረው	-4022
▁ርእስ	-4023
▁ሰይ	-4024
▁በተደረገ	-4025
▁እየጨመረ	-4026
ቅድመ	-4027
ጠየቁ	-4028
ምፒክ	-4029
ቋሚ	-4030
▁አቡ	-4031
▁አካሄድ	-4032
▁የሚሰጠው	-4033
▁ፍትህ	-4034
▁ክፉ	-4035
ገልገል	-4036
▁የሚች	-4037
ዞች	-4038
▁አዲ	-4039
▁ማቅረ	-4040
▁የማያ	-4041
ሊያን	-4042
▁በሰጠው	-4043
▁ተካ	-4044
▁አለቃ	-4045
▁በሰሜን	-4046
▁የአካል	-4047
▁ጳውሎስ	-4048
▁የሚቀ	-4049
▁የድን	-4050
▁አደሮች	-4051
ሰባሰብ	-4052
▁ገለፁ	-4053
ውንም	-4054
.6	-4055
▁ውድቅ	-4056
ዩኒቨርሲቲ	-4057
ደበ	-4058
▁ማሀበራዊ	-4059
▁የአስቸኳይ	-4060
ደራጀ	-4061
▁በቆ	-4062
ኛውንም	-4063
▁ልማትና	-4064
.3	-4065
ይይት	-4066
▁ደካ	-4067
▁ይገልፃል	-4068
ነሱት	-4069
ታችንን	-4070
▁እንቅ	-4071
ጣው	-4072
▁ሽን	-4073
▁በአስ	-4074
▁የኢፌዴሪ	-4075
▁የቤ	-4076
ሙር	-4077
በስ	-4078
ፋና	-4079
▁ከግብ	-4080
▁እንችላለ	-4081
▁ሙስና	-4082
/200	-4083
▁ፈጠራ	-4084
▁ማስከበር	-4085
▁እንዲያደርጉ	-4086
ፈለገው	-4087
▁የማሀ	-4088
▁ያልሆነ	-4089
▁በሰላም	-4090
▁የጨዋታ	-4091
ራቶ	-4092
▁በመጀመሪያው	-4093
▁የሚያሳይ	-4094
▁የኢህአዴግ	-4095
▁ብረት	-4096
▁ደንበኞች	-4097
▁በሚቀጥ	-4098
▁ኢንተርናሽናል	-4099
▁በአንፃሩ	-4100
▁በሲ	-4101
የሩሳሌ	-4102
▁ሶማ	-4103
ሳሽ	-4104
▁ለሌሎች	-4105
▁ፋይ	-4106
ያዛ	-4107
▁ኢንቨስት	-4108
▁እስራኤል	-4109
ኩስ	-4110
ክተሮች	-4111
ዩም	-4112
▁እውነት	-4113
▁አበበ	-4114
▁ማረጋገጫ	-4115
ነዋል	-4116
▁የፈ	-4117
ርና	-4118
ሴፍ	-4119
▁በመስራት	-4120
ጠየቅ	-4121
የተ	-4122
▁ኖሮ	-4123
▁የስፖርት	-4124
▁የመስመር	-4125
▁በተሻለ	-4126
▁አመለካከት	-4127
ንዴ	-4128
▁ባሉት	-4129
▁ኮንስትራክሽን	-4130
▁ቀጥሎ	-4131
▁ከነበረው	-4132
▁ከዋ	-4133
▁እንዲሁ	-4134
ሎን	-4135
ምም	-4136
▁አክለው	-4137
▁አቅርቧል	-4138
▁አስፈላጊውን	-4139
▁ካስ	-4140
▁ሂሳብ	-4141
▁የሀይማኖት	-4142
.7	-4143
▁ብሎም	-4144
ጋቢ	-4145
▁ሽፋን	-4146
▁መፅ	-4147
▁ይጠቀ	-4148
ገኙበት	-4149
▁በርስ	-4150
▁የበጀት	-4151
▁በባህር	-4152
ደቀ	-4153
▁ስላል	-4154
▁ሀላፊው	-4155
▁እንችላለን	-4156
▁በጠቅላይ	-4157
ገዳ	-4158
▁60	-4159
▁እነሱም	-4160
▁ፋይናንስ	-4161
▁ክፍት	-4162
▁እድገ	-4163
▁ይሰማ	-4164
ዘረ	-4165
▁ካም	-4166
▁ግብይት	-4167
▁የጠቆሙት	-4168
▁ይደረጋል	-4169
▁መቅረ	-4170
▁ጉዳዮችን	-4171
▁በቅርብ	-4172
▁ማግኘ	-4173
ደረሰው	-4174
▁ምዝገባ	-4175
▁ከተማን	-4176
ቸዉ	-4177
▁እንደሚደረግ	-4178
▁ጣልቃ	-4179
▁ተደራሽ	-4180
ንቅ	-4181
▁ፀረ	-4182
▁መቼ	-4183
▁የተጠቀ	-4184
▁አንስተዋል	-4185
ገዙ	-4186
▁ስታዲየም	-4187
▁አዝ	-4188
▁የሌለው	-4189
▁ይረዳ	-4190
▁እንደሚሰራ	-4191
መልስ	-4192
▁ብሩ	-4193
▁የኮን	-4194
ሆዋ	-4195
▁ኒ	-4196
▁ቤቱን	-4197
ጨምር	-4198
▁ብሮድካ	-4199
▁የቀረበው	-4200
▁እንዲደረግ	-4201
ቁን	-4202
ቶቹን	-4203
▁አስታውሰዋል	-4204
ዬን	-4205
▁ባሳ	-4206
▁ስፖር	-4207
▁የምስ	-4208
ፐር	-4209
▁ተወዳዳሪ	-4210
▁ልደ	-4211
▁ሀብታ	-4212
▁ለመቀነስ	-4213
ላቸውም	-4214
▁በዘርፉ	-4215
▁ስለሚያ	-4216
▁ግብርና	-4217
▁ከሜዳ	-4218
▁ስለመሆኑ	-4219
ላለም	-4220
ሪን	-4221
▁ባለስልጣኑ	-4222
▁አሀ	-4223
▁ይሰጣል	-4224
▁የመረጃ	-4225
▁በንግድ	-4226
▁እርምጃዎች	-4227
▁የቦርድ	-4228
▁ሰል	-4229
▁አስረድቷል	-4230
▁የብር	-4231
▁ለማስተ	-4232
ኖቹ	-4233
ደሪያ	-4234
▁ግቦች	-4235
ድም	-4236
ያዝያ	-4237
▁ሲነፃፀር	-4238
100	-4239
ለየት	-4240
ሻው	-4241
▁የላ	-4242
▁ያን	-4243
ባበሩት	-4244
▁ቻናል	-4245
▁የሚገኘውን	-4246
ህነት	-4247
▁መሆኑንና	-4248
▁ንቅናቄ	-4249
ጅማ	-4250
▁ለውጭ	-4251
ንዱ	-4252
ጉት	-4253
ሟሉ	-4254
▁እርግ	-4255
ሻንጉ	-4256
▁እግ	-4257
▁ነጥቦች	-4258
▁ጠይቋል	-4259
▁እንደሚቻል	-4260
ስኮ	-4261
ክሲዮን	-4262
▁የማድረግ	-4263
▁አንደኛ	-4264
▁ክልላዊ	-4265
▁ተጨ	-4266
▁ደርሷል	-4267
ጋይ	-4268
ደንት	-4269
▁ተጫዋቾችን	-4270
▁ከባለ	-4271
ነበ	-4272
▁ዘይት	-4273
ሊሲ	-4274
▁ተነግሯል	-4275
.4	-4276
▁ያቀ	-4277
▁ስያሜ	-4278
▁መግባት	-4279
▁ኤምባሲ	-4280
ባጭ	-4281
ጠራው	-4282
▁ራስ	-4283
ቁም	-4284
ጄሪያ	-4285
▁ግር	-4286
▁አብዛኞቹ	-4287
ራጮች	-4288
ዝርዝር	-4289
▁ለሌ	-4290
ራቅ	-4291
ዎስ	-4292
▁የለውም	-4293
▁አስተሳሰብ	-4294
▁በተለየ	-4295
▁ብልፅግና	-4296
.8	-4297
ኩባንያው	-4298
ክብ	-4299
ትናንት	-4300
ቫይረስ	-4301
ማጭ	-4302
▁በሚገባ	-4303
▁ብሄረሰቦች	-4304
ህዴ	-4305
▁ግድያ	-4306
▁እንዲያገኙ	-4307
▁የአገልግሎት	-4308
ፌስቡክ	-4309
▁ቫይረሱ	-4310
▁በፋ	-4311
ናገረው	-4312
ዋር	-4313
▁500	-4314
▁2014	-4315
▁መሰብ	-4316
▁መንገዱ	-4317
▁ያስረዳል	-4318
ከሰቱ	-4319
▁ችለዋል	-4320
ሮጀክ	-4321
▁መሆኗ	-4322
▁ማሳያ	-4323
▁በእለቱ	-4324
2009	-4325
▁ማወቅ	-4326
▁በህይወት	-4327
▁የሚሸ	-4328
▁ማረጋገጥ	-4329
▁አስተዳደ	-4330
▁በማስተ	-4331
▁የሚደረገው	-4332
ናቱ	-4333
ማሪዎች	-4334
▁ያለፈ	-4335
▁መቀመጫ	-4336
▁ቡድኑን	-4337
▁ተጠናቋል	-4338
ቢኔ	-4339
ባን	-4340
ግስት	-4341
▁በሂ	-4342
ከታተል	-4343
▁የገባ	-4344
▁ሳሙኤል	-4345
ሮን	-4346
ቀጠል	-4347
▁ታሀሳስ	-4348
ደቅ	-4349
ወሰደ	-4350
▁ለነ	-4351
▁በጉዳዩ	-4352
ባረ	-4353
ምቤላ	-4354
▁ቁልፍ	-4355
▁የሚፈልጉ	-4356
--	-4357
ኒስቴ	-4358
▁ፋሲል	-4359
ኤላውያን	-4360
▁የቆየው	-4361
▁መለስ	-4362
ኡስ	-4363
▁ተቆጣ	-4364
▁እንቅስቃሴዎች	-4365
ጎዳ	-4366
▁እውነተኛ	-4367
▁በጨዋታው	-4368
መታት	-4369
▁ሀዳር	-4370
ሶማሊያ	-4371
▁የሚሆኑት	-4372
▁እያንዳን	-4373
▁ተመልክቷል	-4374
▁አልነበረም	-4375
24	-4376
ያሉ	-4377
▁ዘው	-4378
▁እንደሚያደርግ	-4379
ግራም	-4380
▁እንደሚያስፈልግ	-4381
/2012	-4382
ራጭ	-4383
▁ጋዜጣዊ	-4384
ለጋ	-4385
▁ማእከላዊ	-4386
▁ኢንስቲት	-4387
ረኛ	-4388
▁ሳይንስ	-4389
▁ምስክሮች	-4390
ከሰት	-4391
▁አስተላል	-4392
▁መጥፎ	-4393
▁በብዛት	-4394
▁ሳይሆን፣	-4395
▁በየጊዜው	-4396
▁ወረዳዎች	-4397
▁35	-4398
▁ታጣቂ	-4399
▁ማድረጉን	-4400
▁ለራ	-4401
ለቅ	-4402
▁ከኤ	-4403
ቸውም	-4404
ቃቂ	-4405
▁አርባ	-4406
ነገረ	-4407
ጠበቁ	-4408
ስቲክስ	-4409
▁ሏላዊ	-4410
ዊው	-4411
▁በመያዝ	-4412
▁የሚከተ	-4413
▁ስለነበር	-4414
▁የሚጠበቅ	-4415
▁በሰው	-4416
▁የሚያስችሉ	-4417
▁የአካባቢው	-4418
ተገ	-4419
ረዳው	-4420
▁ወሰ	-4421
▁ኤክስ	-4422
▁አለመግባ	-4423
▁ወታደሮች	-4424
▁ደጋፊዎች	-4425
▁ጠቀ	-4426
▁ፓርላማ	-4427
▁አስተባባሪ	-4428
▁አና	-4429
ነቅ	-4430
መንግስት	-4431
▁የመሰረተ	-4432
▁የመገናኛ	-4433
ሳች	-4434
ገሉ	-4435
▁ወልደ	-4436
▁የሩ	-4437
▁ምሽት	-4438
▁አውቶ	-4439
ረበ	-4440
ጫወቱ	-4441
▁በአንዳንድ	-4442
▁መስፈር	-4443
ጠለ	-4444
ጦታ	-4445
▁መና	-4446
▁ለማካሄድ	-4447
ይሮ	-4448
▁ተነሳ	-4449
ገነባው	-4450
ፍቶ	-4451
ላንት	-4452
▁ከአገር	-4453
ገጥ	-4454
ችሉም	-4455
▁እውቀት	-4456
▁ወላይታ	-4457
▁ለማጠናከር	-4458
21	-4459
ቻለሁ	-4460
▁የሚያደር	-4461
▁እየሰሩ	-4462
▁የኮሚ	-4463
▁ውጤቶች	-4464
ገለግሉ	-4465
▁አምራች	-4466
▁እግርኳስ	-4467
ስተናግ	-4468
▁አሰጣጥ	-4469
ፕራይ	-4470
▁ደካማ	-4471
▁ግድቡ	-4472
▁አዳነ	-4473
▁ይበ	-4474
▁ወደብ	-4475
-19	-4476
▁ሙያ	-4477
▁ታማኝ	-4478
▁በመግባት	-4479
▁ጣቢያዎች	-4480
▁ባልተ	-4481
▁ለመንግስት	-4482
▁በቀን	-4483
ወሰድ	-4484
▁አውሮፕላን	-4485
ቲን	-4486
▁በግል	-4487
▁በግብፅ	-4488
▁ማቀ	-4489
▁ከጊዜ	-4490
▁የሚሰጡ	-4491
ጓዴ	-4492
ናትን	-4493
2008	-4494
▁በፈ	-4495
ሸት	-4496
▁ነን	-4497
ሰብሰብ	-4498
▁አብረው	-4499
ያስፖ	-4500
ሰልጣኝ	-4501
ሻንጉል	-4502
▁የኢትዮ	-4503
ቡእ	-4504
▁ታህሳስ	-4505
ብነት	-4506
▁ተሰጥቶ	-4507
▁ክፍተ	-4508
▁ማኔ	-4509
22	-4510
ፈቀድ	-4511
▁የህገ	-4512
▁ኮሪያ	-4513
▁ፔ	-4514
▁የሽብር	-4515
ረፈ	-4516
▁አቀባይ	-4517
▁በአዲሱ	-4518
ራችን	-4519
▁የሚችለው	-4520
▁የተፈጠረ	-4521
▁ስደተኞች	-4522
▁ሆና	-4523
▁ሲሆን፥	-4524
▁ተሽከርካሪ	-4525
▁ህወሀት	-4526
ተኩ	-4527
▁መሰረት፣	-4528
▁ለታ	-4529
▁ወደሚ	-4530
▁ሀይማኖ	-4531
▁የቴክኒክ	-4532
▁መሬ	-4533
▁ማቴ	-4534
▁ማይ	-4535
▁ተሻ	-4536
▁በመቀጠል	-4537
▁አስራ	-4538
ሳራ	-4539
ረንጓዴ	-4540
▁አስደናቂ	-4541
ሀይ	-4542
ሺህ	-4543
ባይል	-4544
ሬዚዳንት	-4545
▁ተደ	-4546
ጆቹ	-4547
ፍያ	-4548
ዘነጋ	-4549
▁ቴሌቪዥን	-4550
ጥቅ	-4551
ንስት	-4552
▁መቐለ	-4553
▁ይኸውም	-4554
▁በራሳቸው	-4555
▁ሰሜን	-4556
▁ያቀረቡት	-4557
▁በመተባበር	-4558
▁በፊ	-4559
ኒስትሮች	-4560
ችት	-4561
▁የተወሰኑ	-4562
▁መገደ	-4563
▁በሀገር	-4564
ዘግ	-4565
▁ሚኒስቴሩ	-4566
▁የጀመረው	-4567
ፈለገ	-4568
▁ለማምጣት	-4569
▁መላኩ	-4570
▁መጠበቅ	-4571
▁ማድረጉ	-4572
▁የሚገቡ	-4573
▁የበላይነት	-4574
ክርስቲ	-4575
▁በግንባ	-4576
▁እንደነበረ	-4577
▁ማእቀ	-4578
▁ሆኑ	-4579
▁በጊዜ	-4580
▁ሀጢ	-4581
▁በትምህርት	-4582
▁በዩ	-4583
▁የጋ	-4584
▁ጠቀሜ	-4585
▁ያስረዳሉ	-4586
▁ፕሬዚዳንቱ	-4587
ዋሎ	-4588
ከፈል	-4589
▁ጥረ	-4590
ወሰኑ	-4591
▁ኋላ	-4592
ምምነት	-4593
▁ተሞክሮ	-4594
▁ሚስተር	-4595
▁ምእራብ	-4596
ሪታ	-4597
▁በማሰብ	-4598
ይዝ	-4599
ስተናገ	-4600
▁በስልክ	-4601
▁አስቆጥ	-4602
▁ተጠቅሷል	-4603
▁ሰልፍ	-4604
▁ዲግ	-4605
▁አምና	-4606
▁ያልሆኑ	-4607
ማው	-4608
ቆሙ	-4609
ከው	-4610
▁ክብ	-4611
▁ህጎች	-4612
▁በቫይረሱ	-4613
▁ውስጥም	-4614
▁ጥፋ	-4615
ታወቀው	-4616
▁ለማየት	-4617
ፋስ	-4618
▁ትግራይ	-4619
▁ሀያ	-4620
▁ጊዜያዊ	-4621
ሁት	-4622
▁ትግ	-4623
▁አንድም	-4624
▁በመፍጠር	-4625
ነሳት	-4626
ሪሚ	-4627
▁እናም	-4628
▁ካለፈው	-4629
▁በብሄራዊ	-4630
▁እንዲሰጡ	-4631
▁በሆነው	-4632
▁በከተማዋ	-4633
▁ሳለ	-4634
በሳ	-4635
ጠባ	-4636
ሪነት	-4637
▁አታ	-4638
ንቀሳቃሽ	-4639
ንግተን	-4640
▁ኩንታል	-4641
ገዱ	-4642
ስቲንግ	-4643
▁ልት	-4644
ንድሮው	-4645
▁ተፈጥሮ	-4646
▁ለመቅረፍ	-4647
▁አብርሀም	-4648
ሆና	-4649
▁ክርስቶስ	-4650
ማዊ	-4651
▁መውሰድ	-4652
ንጋ	-4653
ጠናቀቀው	-4654
▁እውን	-4655
▁በመግ	-4656
ዲና	-4657
ገጠ	-4658
▁ቸ	-4659
ወሰዱ	-4660
ጠንቀቂያ	-4661
ላስ	-4662
▁እል	-4663
▁በመላው	-4664
ስፋፋ	-4665
▁መዳረ	-4666
▁ስኳር	-4667
ባኤው	-4668
▁ቢኖር	-4669
▁የመፅሀፍ	-4670
የትኛውም	-4671
▁ለሁሉም	-4672
▁ጠበ	-4673
ገኘት	-4674
▁ቃለ	-4675
▁ማው	-4676
▁ተቋሙ	-4677
▁የተሰማሩ	-4678
.9	-4679
▁የበኩ	-4680
ውሉ	-4681
አን	-4682
ኳን	-4683
▁የረ	-4684
▁ህዳር	-4685
▁ለመጠቀም	-4686
ድድሩ	-4687
▁ፍጥነት	-4688
ቆጣጠ	-4689
▁ይመ	-4690
▁ተከላካይ	-4691
▁መግባባት	-4692
▁ደርሶ	-4693
ብረቱ	-4694
▁የሚያስች	-4695
▁ከጎ	-4696
▁መድረሱን	-4697
▁ነጋዴዎች	-4698
ህም	-4699
▁ተካሂ	-4700
መኑ	-4701
▁ተሾ	-4702
▁ጓደ	-4703
ፎካካ	-4704
▁ቤቶችን	-4705
ናዳ	-4706
ደርጉት	-4707
▁ለማን	-4708
▁ስብስብ	-4709
ር፣	-4710
▁መስፈ	-4711
▁ፀጥታ	-4712
▁ምስጋና	-4713
▁የውሳኔ	-4714
▁ይገኙ	-4715
▁ማረፊያ	-4716
ፈተ	-4717
ንታዊ	-4718
▁ግብአ	-4719
▁ለአገር	-4720
▁ቱሪዝም	-4721
▁አሊ	-4722
▁ባለበት	-4723
▁ተወያይ	-4724
▁ራሱ	-4725
▁የሳይ	-4726
ልተኛ	-4727
▁ሚዛ	-4728
ዳሪዎች	-4729
▁የስልጣን	-4730
▁የኪ	-4731
▁አስገንዝ	-4732
ኮት	-4733
ወሩ	-4734
ከበረ	-4735
ወርቅ	-4736
▁ኢንጂነር	-4737
▁ለመግባት	-4738
ኑኤል	-4739
ጨረታ	-4740
▁የቡድኑ	-4741
ምረቻ	-4742
▁አደራ	-4743
▁ግንባታው	-4744
ኖረ	-4745
▁ፎቶ	-4746
▁የአል	-4747
▁የማእድን	-4748
▁ከስራ	-4749
ራፊክ	-4750
▁ዲዛ	-4751
ምንጭ	-4752
ጠበቀው	-4753
▁ከነማ	-4754
▁ጠቁሟል	-4755
ፍል	-4756
ደረሱ	-4757
▁ምልክ	-4758
▁ፈቃደኛ	-4759
▁እንዲሰሩ	-4760
ነጋግ	-4761
▁ለአለም	-4762
▁ሽብር	-4763
▁በዝርዝር	-4764
አል	-4765
▁በቢ	-4766
▁አረቢያ	-4767
▁የሚመጣ	-4768
▁ቅርንጫፍ	-4769
▁ምድ	-4770
▁በተቀ	-4771
ከለኛው	-4772
▁አባት	-4773
▁በረከት	-4774
▁ማንኛውንም	-4775
ድየም	-4776
ፈጥር	-4777
▁ለሶ	-4778
▁ጠበቃ	-4779
▁የተገኙ	-4780
▁መፃህ	-4781
▁እኔም	-4782
▁ቴዎ	-4783
▁የሰጠው	-4784
ሞኑ	-4785
ቱንና	-4786
▁ክህ	-4787
▁በአዋ	-4788
▁አደረገ	-4789
ያያ	-4790
ኩረት	-4791
▁ልን	-4792
▁ምጣኔ	-4793
ብስ	-4794
▁መንግስትና	-4795
▁ያም	-4796
▁ዜጎችን	-4797
▁መዝገብ	-4798
▁አምራቾች	-4799
▁ድንቅ	-4800
▁ሰአታት	-4801
▁ከሚገኙ	-4802
▁የለውጥ	-4803
▁ካሬ	-4804
▁ሀይሌ	-4805
▁ወዲያው	-4806
▁መኖራቸውን	-4807
▁ብሮድካስቲንግ	-4808
ኛዎቹ	-4809
▁በመታ	-4810
▁መኖሩን	-4811
