[UNK]	0
[PAD]	0
[SOS]	0
[EOS]	0
▁የ	-0
▁በ	-1
▁አ	-2
▁እ	-3
▁መ	-4
▁።	-5
▁ከ	-6
▁እን	-7
▁ተ	-8
▁ለ	-9
ቸው	-10
▁ይ	-11
▁ወ	-12
▁ያ	-13
▁የሚ	-14
▁ነ	-15
▁ስ	-16
ዎች	-17
ላይ	-18
▁ማ	-19
▁እንደ	-20
▁ም	-21
▁የተ	-22
▁ብ	-23
ዋል	-24
ነት	-25
▁ው	-26
▁በመ	-27
▁ላይ	-28
▁ግ	-29
▁ባ	-30
ስት	-31
▁ሰ	-32
▁ሲ	-33
▁እንዲ	-34
▁አስ	-35
▁እና	-36
ውን	-37
▁ሀ	-38
▁ደ	-39
ንግ	-40
▁በአ	-41
▁ነው	-42
▁በተ	-43
▁ጥ	-44
ቶች	-45
▁ገ	-46
ሆኑ	-47
በት	-48
▁የአ	-49
▁ክ	-50
ሆን	-51
▁ቀ	-52
▁ድ	-53
▁የመ	-54
ለው	-55
ንድ	-56
▁ት	-57
ኢት	-58
ኢትዮ	-59
▁"	-60
▁ህ	-61
ደረ	-62
ሆነ	-63
ጵያ	-64
ዚህ	-65
ኢትዮጵያ	-66
ችን	-67
▁ወደ	-68
በር	-69
ቸውን	-70
▁ሁ	-71
▁ለመ	-72
▁ሚ	-73
▁ለማ	-74
▁ቤ	-75
▁አመ	-76
ስጥ	-77
ገር	-78
▁በማ	-79
▁እንደሚ	-80
ደር	-81
▁ጋ	-82
▁1	-83
▁ውስጥ	-84
▁ል	-85
▁2	-86
ተኛ	-87
▁ዘ	-88
▁ቢ	-89
▁ጉ	-90
ረት	-91
ሪያ	-92
▁ግን	-93
▁ከተ	-94
ለት	-95
▁ጠ	-96
▁ሊ	-97
ጊዜ	-98
▁ጋር	-99
ራት	-100
▁ባለ	-101
▁(	-102
▁እየ	-103
ድር	-104
▁ታ	-105
▁ሳ	-106
ድረ	-107
▁የሚያ	-108
▁እንዳ	-109
ንግስት	-110
▁ጊዜ	-111
▁ካ	-112
▁ኢ	-113
በረ	-114
ንም	-115
▁ይህ	-116
▁አን	-117
ለም	-118
ስተ	-119
▁ምክ	-120
ሮች	-121
ርት	-122
▁ስራ	-123
ንያ	-124
▁አቶ	-125
▁ፍ	-126
▁አገ	-127
ትን	-128
▁በሚ	-129
ንት	-130
▁ኮ	-131
▁የማ	-132
ሎች	-133
ረጃ	-134
ዲስ	-135
ቱን	-136
▁መሆኑ	-137
▁አይ	-138
ራዊ	-139
ገባ	-140
ጀመ	-141
▁ስለ	-142
▁ጉዳ	-143
00	-144
ሪካ	-145
▁ዋ	-146
▁እስ	-147
ላቸው	-148
▁ፕ	-149
▁መስ	-150
▁ሚኒ	-151
▁የም	-152
▁አካ	-153
▁ች	-154
▁ቅ	-155
ከል	-156
▁ጨ	-157
ዎችን	-158
መለ	-159
▁ቤት	-160
ግባ	-161
▁ነበር	-162
ታት	-163
▁አለ	-164
ታው	-165
ሁን	-166
▁የነ	-167
ማሪ	-168
ያን	-169
ይም	-170
▁ሲሆን	-171
ዮን	-172
ተር	-173
▁መን	-174
▁አስተ	-175
▁መንግስት	-176
▁ቡ	-177
▁ድር	-178
ሰራ	-179
ማት	-180
▁መሰ	-181
▁ፈ	-182
ታወ	-183
▁ያለ	-184
ገድ	-185
ጠና	-186
ላል	-187
ባቸው	-188
▁አበ	-189
01	-190
ድረግ	-191
ሰብ	-192
▁መሆኑን	-193
▁ሆ	-194
ታል	-195
▁ከአ	-196
ሉት	-197
▁ገል	-198
ከተ	-199
▁ከፍ	-200
ረው	-201
▁ከተማ	-202
▁ዳ	-203
▁ኢትዮጵያ	-204
ብር	-205
ንስ	-206
▁ሌ	-207
ለያ	-208
ኛው	-209
▁ከመ	-210
▁እየተ	-211
ልጣ	-212
ላት	-213
በሩ	-214
▁ነገር	-215
▁አንድ	-216
ናት	-217
▁በእ	-218
ስራ	-219
ደረገ	-220
ናቸው	-221
ቅር	-222
ገለ	-223
▁አል	-224
▁ሙ	-225
ናል	-226
▁ብር	-227
▁አም	-228
ተዋል	-229
ገኘ	-230
▁የእ	-231
ልግ	-232
▁ቀን	-233
ኋላ	-234
▁አመት	-235
ግር	-236
▁የኢትዮጵያ	-237
▁የህ	-238
▁ደግ	-239
ገኙ	-240
ሚያ	-241
ሊዮን	-242
▁ሀይ	-243
ታቸው	-244
ሽን	-245
▁አባ	-246
▁በዚህ	-247
▁አበባ	-248
▁ክፍ	-249
▁ደግሞ	-250
▁ምር	-251
▁ሚኒስት	-252
ድን	-253
ለዋል	-254
ጠር	-255
ባቢ	-256
▁ቦ	-257
▁የው	-258
▁ክል	-259
▁ስር	-260
ርድ	-261
▁ኤ	-262
▁በኋላ	-263
▁ቁ	-264
ተው	-265
ፊት	-266
ሁም	-267
▁መል	-268
▁ሁሉ	-269
ትና	-270
ከላ	-271
▁ወይም	-272
▁በላይ	-273
ቷል	-274
▁የግ	-275
▁ምን	-276
መን	-277
ራል	-278
ጥር	-279
ክል	-280
▁ገልፀ	-281
▁ምክንያ	-282
▁እያ	-283
▁የሰ	-284
ጠቀ	-285
ዳን	-286
ዎቹ	-287
ረስ	-288
▁ዝ	-289
▁እር	-290
ፓር	-291
▁የወ	-292
ክት	-293
▁ሳይ	-294
▁ከፍተኛ	-295
ዝብ	-296
ኔታ	-297
▁አብ	-298
ኞች	-299
▁መካ	-300
▁በቀ	-301
ቦች	-302
▁ወቅ	-303
ምሮ	-304
ናግ	-305
▁ጠቅ	-306
▁እንዲሁም	-307
▁3	-308
መር	-309
▁ዶ	-310
ላፊ	-311
ረዋል	-312
ለያዩ	-313
▁እስከ	-314
▁ሁኔታ	-315
ረጋ	-316
▁ለአ	-317
▁ን	-318
▁ባን	-319
▁ሰዎች	-320
ከት	-321
▁ያስ	-322
ልግሎ	-323
ካሄ	-324
ጨማሪ	-325
ቀረ	-326
ላለ	-327
ችል	-328
ቅም	-329
▁ጨዋ	-330
ገን	-331
ዮች	-332
ታዊ	-333
ብረ	-334
▁ደረጃ	-335
አት	-336
ጠበ	-337
ገል	-338
▁እድ	-339
▁አዲስ	-340
▁ማስ	-341
ፈል	-342
ረዳ	-343
▁ያለው	-344
▁ኢን	-345
▁ገልፀዋል	-346
▁ተናግ	-347
▁ብቻ	-348
▁መሰረት	-349
ቀር	-350
▁እንደሆነ	-351
▁ሀላፊ	-352
ጠቃ	-353
▁ሆነ	-354
ያስ	-355
ምህ	-356
መራ	-357
▁መካከል	-358
▁ተቋ	-359
▁ድርጅ	-360
ጣት	-361
▁ብለዋል	-362
ሳይ	-363
▁ወቅት	-364
ናገ	-365
▁201	-366
▁ኩ	-367
▁ከዚህ	-368
▁ብዙ	-369
ቶችን	-370
ንግድ	-371
▁ፖ	-372
ወሰ	-373
▁አድር	-374
ፍሪካ	-375
ቃል	-376
▁ይህን	-377
ግለ	-378
ገሪ	-379
▁ኮሚ	-380
ሏል	-381
▁አገልግሎ	-382
▁፣	-383
ያው	-384
የት	-385
▁ጀ	-386
▁ፕሮ	-387
ባት	-388
ይት	-389
ሩት	-390
ም፣	-391
ያቄ	-392
▁የኢ	-393
ገኝ	-394
ታቸውን	-395
▁አቀ	-396
ርስ	-397
ደረጉ	-398
▁በሰ	-399
▁መረጃ	-400
▁ክልል	-401
▁ስም	-402
▁ጨዋታ	-403
መል	-404
▁ጥያቄ	-405
▁የነበረ	-406
▁ፓር	-407
ርካ	-408
▁መንገድ	-409
▁;	-410
▁አማ	-411
ግራ	-412
▁ዋና	-413
▁በመሆኑ	-414
ሪዎች	-415
▁ናቸው	-416
▁እነ	-417
ፌዴ	-418
▁ግብ	-419
ምር	-420
▁ጎ	-421
▁ተናግረዋል	-422
▁ምክንያት	-423
ወት	-424
▁ሶ	-425
ባንያ	-426
ዘብ	-427
▁ዘር	-428
▁ጉዳይ	-429
የር	-430
▁የሀ	-431
ኖች	-432
▁ተብ	-433
ምና	-434
▁የሆነ	-435
▁መጠ	-436
▁የት	-437
▁,	-438
▁አካባቢ	-439
""	-440
▁አመታት	-441
▁በተለ	-442
▁ሰው	-443
▁ፕሬ	-444
▁አስታው	-445
ምን	-446
ቢያ	-447
ዘጋ	-448
ገና	-449
ፈፀ	-450
▁ሚሊዮን	-451
ላክ	-452
ደው	-453
ቋል	-454
▁ቆ	-455
ነሳ	-456
ጠው	-457
▁4	-458
▁ሽ	-459
▁ሆኖ	-460
▁ፅ	-461
ፈው	-462
▁ሚኒስትር	-463
▁ብሄ	-464
ሪፖ	-465
▁ያህ	-466
በው	-467
▁ምክር	-468
▁ሺ	-469
ጀመሪያ	-470
መው	-471
▁ሜ	-472
▁በኢትዮጵያ	-473
ሪክ	-474
መድ	-475
ለን	-476
ለቱ	-477
ኩል	-478
▁የሚያስ	-479
▁ተወ	-480
ወጣ	-481
ለቲ	-482
ገሪቱ	-483
▁አስተዳ	-484
ራቸው	-485
▁በፊት	-486
ንግስ	-487
▁""	-488
ፍት	-489
▁በግ	-490
▁እንዲያ	-491
▁በህ	-492
ላሉ	-493
ለሁ	-494
▁ይች	-495
▁ኩባንያ	-496
▁ቦታ	-497
▁በመቶ	-498
▁5	-499
ልቅ	-500
ቀው	-501
ችሁ	-502
ብት	-503
ኖር	-504
▁የስ	-505
ሰው	-506
▁ከእ	-507
▁ጠቅላይ	-508
▁ከሚ	-509
ኤል	-510
▁አሰ	-511
ግኘ	-512
ምህርት	-513
▁ቢሆን	-514
▁የበ	-515
ስፋ	-516
▁ፋ	-517
ዛሬ	-518
ላማ	-519
ክር	-520
ት፣	-521
ለቲካ	-522
▁ኦ	-523
ሩን	-524
ርያ	-525
ነው	-526
ስቴ	-527
ዚያ	-528
▁ችግር	-529
▁ያል	-530
ከና	-531
ደጋ	-532
▁ህግ	-533
ይና	-534
▁በሀ	-535
▁ውጤ	-536
ደም	-537
▁አስፈ	-538
▁:	-539
▁አው	-540
▁የታ	-541
ረድ	-542
ክስ	-543
ቅረ	-544
▁የባ	-545
ሳብ	-546
▁ቤቱ	-547
▁ድረስ	-548
▁ያሉ	-549
▁ራ	-550
▁አገልግሎት	-551
▁አሁን	-552
መስ	-553
ገው	-554
▁ተግባ	-555
▁በተጨማሪ	-556
▁ዜ	-557
ውያን	-558
ሳኔ	-559
ምነት	-560
▁ወር	-561
ኮኖ	-562
▁ሌሎች	-563
▁ፓርቲ	-564
ክተር	-565
▁ሲሆን፣	-566
▁ባንክ	-567
▁ሂ	-568
ሉም	-569
ጣም	-570
ንና	-571
ገኘው	-572
ጠቅ	-573
▁ሞ	-574
ጀት	-575
ሜሪካ	-576
▁ሁለት	-577
▁እንደተ	-578
▁ችግ	-579
▁ተቀ	-580
▁ረ	-581
▁አጋ	-582
▁አሳ	-583
▁አለም	-584
ዳንት	-585
ሰማ	-586
ባል	-587
ቅስ	-588
ላም	-589
ጨረ	-590
ሱን	-591
▁ወን	-592
▁በስ	-593
▁ግንባ	-594
ገኛ	-595
ገቡ	-596
▁መንግስ	-597
▁የውጭ	-598
ኝነት	-599
▁በም	-600
ወቅ	-601
ቃት	-602
▁ር	-603
▁ሺህ	-604
ሳት	-605
▁ሴ	-606
▁ኳ	-607
▁መር	-608
▁በኩል	-609
▁ለው	-610
ለች	-611
ግብ	-612
ጆች	-613
ዶች	-614
ሞች	-615
ቃሴ	-616
▁ሲያ	-617
▁ማእ	-618
▁በት	-619
▁ድጋ	-620
▁ፕሬዚ	-621
ቅስቃሴ	-622
▁በየ	-623
▁ሚኒስቴ	-624
▁አዋ	-625
ያዘ	-626
ብረት	-627
▁ሀይል	-628
▁ተከ	-629
ጦር	-630
ሰባ	-631
ገለፁ	-632
ግኘት	-633
ደረገው	-634
▁ነገ	-635
▁ቡድን	-636
▁አቀፍ	-637
ስልጣ	-638
ነስ	-639
▁አለመ	-640
▁ልማት	-641
▁ቴ	-642
▁መግለ	-643
ነበረ	-644
▁የስራ	-645
ፈት	-646
201	-647
▁በርካ	-648
▁በጣም	-649
▁በሁ	-650
▁ሌላ	-651
▁አር	-652
▁ቡድ	-653
▁ፖሊ	-654
▁የተባ	-655
ፈጠ	-656
ንቀ	-657
▁ውሳኔ	-658
ሰቡ	-659
▁ፀ	-660
ጡት	-661
ደረግ	-662
ሻሻ	-663
▁ዲ	-664
▁በማለት	-665
▁ባህ	-666
ቤት	-667
▁ህዝ	-668
ትል	-669
▁ህዝብ	-670
▁እንቅስቃሴ	-671
ባኤ	-672
በል	-673
▁6	-674
መጣ	-675
▁የኮ	-676
▁ገን	-677
▁የቀ	-678
▁ጀምሮ	-679
ጠናቀ	-680
ሀን	-681
▁ልዩ	-682
▁ያሉት	-683
ብሄ	-684
ልክ	-685
▁ፍርድ	-686
▁የፖ	-687
▁ኪ	-688
▁አገር	-689
▁ቁጥር	-690
▁የተለያዩ	-691
▁ለሚ	-692
▁ውድ	-693
ሪፖር	-694
በያ	-695
▁እንደሚያ	-696
ጫዋ	-697
ዩኒ	-698
▁ይሆ	-699
ፖርት	-700
ቸዋል	-701
▁ለተ	-702
ሰጥ	-703
▁በሌ	-704
▁ከማ	-705
▁ቢሊዮን	-706
▁ምንም	-707
▁ምርጫ	-708
▁መሆ	-709
▁ማሀ	-710
▁እንዳለ	-711
▁ለማስ	-712
▁ጭ	-713
ጥታ	-714
ክራ	-715
ከራ	-716
ከናወ	-717
ሬት	-718
▁በበ	-719
ፉት	-720
ኮኖሚ	-721
ጋት	-722
▁ማድረግ	-723
▁ሚኒስቴር	-724
▁ጉዳዮች	-725
▁ማን	-726
▁በው	-727
▁7	-728
ቡብ	-729
▁በርካታ	-730
▁በጥ	-731
▁እንዲህ	-732
መረ	-733
▁አስረድ	-734
ላር	-735
▁ፕሮጀ	-736
ድሞ	-737
▁አዳ	-738
ጨረሻ	-739
ደት	-740
ጠት	-741
▁አይነት	-742
ሰሩ	-743
ንን	-744
ምንት	-745
ደራ	-746
ጿል	-747
▁አስተዳደር	-748
▁ላ	-749
ያዎች	-750
ቫይ	-751
▁አቅ	-752
▁ድጋፍ	-753
ጤና	-754
መለከተ	-755
▁ዙ	-756
ምጃ	-757
ማይ	-758
ኮች	-759
ረጋገ	-760
▁የነበሩ	-761
ቀዋል	-762
▁-	-763
ብራ	-764
ቅድ	-765
ችሉ	-766
ቂቃ	-767
▁የመንግስት	-768
ክልሉ	-769
ለተኛ	-770
▁ግንኙ	-771
ከር	-772
▁አገሮች	-773
መሳ	-774
ባይ	-775
▁ብሄራዊ	-776
▁አቅር	-777
▁ህይ	-778
▁እንዳይ	-779
▁ያለውን	-780
ዱስት	-781
▁እነዚህ	-782
ንዳ	-783
▁አመራ	-784
▁እንደነ	-785
▁ለማድረግ	-786
▁መግለጫ	-787
▁ጣ	-788
ፈለ	-789
ሳተ	-790
ቀመ	-791
ሰረ	-792
ቋቋ	-793
ሳል	-794
▁)	-795
▁አንዱ	-796
▁ደቂቃ	-797
19	-798
▁ሙሉ	-799
ካይ	-800
▁ጠቁ	-801
▁?	-802
▁ዶላር	-803
ጠቀም	-804
▁ድርጅት	-805
▁8	-806
ዱስ	-807
▁ብሎ	-808
ሁኑ	-809
▁ተቋማት	-810
▁የማይ	-811
ከተማ	-812
▁አክ	-813
ናቸውን	-814
ሮችን	-815
ቀት	-816
ተኞች	-817
▁በደ	-818
ጋራ	-819
▁ዘመን	-820
▁አባላት	-821
▁በማድረግ	-822
▁ባለስልጣ	-823
ፌዴራል	-824
በትን	-825
ሙሉ	-826
ያዊ	-827
ከፍ	-828
▁ቤቶች	-829
▁ግንባታ	-830
▁ያህል	-831
▁ሀገ	-832
▁ኳስ	-833
▁እው	-834
▁ድን	-835
▁እርምጃ	-836
ቱም	-837
ቻቸው	-838
▁ጥሩ	-839
ን፣	-840
▁ሰራ	-841
ራንስ	-842
▁ግድ	-843
ደርግ	-844
▁ስርአት	-845
▁ተጫዋ	-846
▁ትኩ	-847
ከላከ	-848
▁ዘርፍ	-849
▁በታ	-850
200	-851
ጠበቅ	-852
▁ቤተ	-853
▁200	-854
▁ቃል	-855
▁ጉባኤ	-856
..	-857
ፋት	-858
▁ዋጋ	-859
▁ዝግ	-860
▁ቀደም	-861
ደርጉ	-862
▁የሆኑ	-863
▁በተለይ	-864
ነቱ	-865
▁አይደ	-866
ጥብ	-867
ቀጥ	-868
▁ተብሎ	-869
▁ማለት	-870
ረም	-871
▁እንጂ	-872
ጠቃላይ	-873
▁ተፈ	-874
ህን	-875
ሉን	-876
▁ውይ	-877
▁ዘመ	-878
▁ትምህርት	-879
ላቸውን	-880
▁የሚል	-881
▁ምስ	-882
▁ነፃ	-883
▁መድረ	-884
ዱስትሪ	-885
▁የደ	-886
ላጊ	-887
▁ተጠ	-888
ሯል	-889
▁ዛሬ	-890
ጎች	-891
ቾች	-892
ከሰ	-893
▁ባለሙ	-894
ገነ	-895
▁ሊያ	-896
▁የነበረው	-897
ሳቸው	-898
▁የተሰ	-899
ይሬ	-900
▁ይችላል	-901
▁ኮሚቴ	-902
▁ይታወ	-903
▁አስረድተዋል	-904
▁ፕሬዚዳንት	-905
▁ንግድ	-906
ቻል	-907
▁ስብ	-908
▁ሚኒስትሩ	-909
ልማት	-910
▁ግንኙነት	-911
ኦሮ	-912
ፍራ	-913
▁19	-914
ቆጣ	-915
ታይ	-916
ደግ	-917
▁ጨምሮ	-918
ዛት	-919
▁–	-920
ጨዋ	-921
ገቢ	-922
መዋል	-923
ነጋ	-924
▁መጠን	-925
▁የሚገኙ	-926
▁ገንዘብ	-927
ኖሩ	-928
▁ሱ	-929
▁ይሁን	-930
▁በተለያዩ	-931
ላሽ	-932
▁ማሳ	-933
ኑን	-934
▁ጥቅም	-935
▁ሀሳብ	-936
ነሱ	-937
ዳጅ	-938
ዴት	-939
▁ቡና	-940
ዘር	-941
ላጎ	-942
መሳሳይ	-943
▁ሶስት	-944
▁ሳምንት	-945
▁ሲሉ	-946
▁ክለ	-947
ረን	-948
▁በማስ	-949
▁የንግድ	-950
▁ዳይሬ	-951
▁በቅር	-952
ክለ	-953
▁ለእ	-954
▁ማህ	-955
ልፅ	-956
▁የፖለቲካ	-957
ጀል	-958
▁ተስፋ	-959
▁እድል	-960
▁እንኳ	-961
▁ሳይሆን	-962
▁ከሆነ	-963
▁በአዲስ	-964
ቨር	-965
▁በአንድ	-966
ሪፖርተር	-967
▁ልጆች	-968
▁አካላት	-969
▁ጥረት	-970
የው	-971
ስር	-972
ሳሌ	-973
▁ገቢ	-974
▁አፈ	-975
▁ክፍል	-976
ፃሚ	-977
▁ዴ	-978
▁ዘንድ	-979
ካባቢ	-980
▁ሰብ	-981
ያዝ	-982
▁ይገኛ	-983
ትር	-984
▁አንዳ	-985
ለውን	-986
▁እንደነበር	-987
▁እጅ	-988
▁እንዴት	-989
ውም	-990
▁9	-991
▁መቀ	-992
ሞክራ	-993
▁ቆይ	-994
▁ይህም	-995
▁ፍላጎ	-996
▁የኤ	-997
በዋል	-998
▁ያሳ	-999
ስና	-1000
▁የፀ	-1001
ገለፁት	-1002
▁ምክትል	-1003
ጋል	-1004
ፅሀ	-1005
▁የመጀመሪያ	-1006
መት	-1007
▁በወ	-1008
▁መሳ	-1009
▁በነ	-1010
ገንዘብ	-1011
ህፈት	-1012
ሄድ	-1013
ገብ	-1014
ከላከያ	-1015
▁ይህንን	-1016
ካሄድ	-1017
ጀመር	-1018
ብረተ	-1019
▁የጥ	-1020
ችንን	-1021
▁በአሁኑ	-1022
ቅረብ	-1023
▁ቀናት	-1024
▁ይሆናል	-1025
ጠራ	-1026
▁ሰጥ	-1027
▁ጉዳት	-1028
ናዊ	-1029
ቦት	-1030
▁ቅዱስ	-1031
▁የምር	-1032
▁ውጤት	-1033
▁ተከት	-1034
▁ከባ	-1035
▁ሄ	-1036
▁ተጨማሪ	-1037
ነር	-1038
ካም	-1039
ሮና	-1040
ሎጂ	-1041
ንጫ	-1042
▁ለመስ	-1043
▁ወራት	-1044
ገለፀ	-1045
▁ፈቃ	-1046
ውል	-1047
ግራይ	-1048
ንቀሳ	-1049
ከለ	-1050
▁ስምምነት	-1051
▁በሙሉ	-1052
ቹን	-1053
ለጠ	-1054
ስተኛ	-1055
ንተ	-1056
ገደ	-1057
ቡን	-1058
ላዊ	-1059
▁የአለም	-1060
▁ቀር	-1061
ችው	-1062
ዲያ	-1063
▁አፍሪካ	-1064
▁ሲል	-1065
ሲቲ	-1066
▁መሆን	-1067
ቅና	-1068
▁ጌ	-1069
ከላከል	-1070
▁አስፈላጊ	-1071
ቧል	-1072
▁ህገ	-1073
▁አት	-1074
▁የፋ	-1075
ዳር	-1076
አዊ	-1077
▁ቋ	-1078
▁ፖሊስ	-1079
▁በፍ	-1080
▁አድ	-1081
▁ያላቸው	-1082
▁በመስ	-1083
▁እስካ	-1084
▁አሸ	-1085
ልና	-1086
▁አይደለም	-1087
ሌክት	-1088
▁ምላሽ	-1089
ሻለ	-1090
▁የቆ	-1091
ደረሰ	-1092
መንት	-1093
▁እኔ	-1094
▁10	-1095
ስተዳ	-1096
ቀረቡ	-1097
ላላ	-1098
ማሽ	-1099
▁ተደር	-1100
ኛውም	-1101
▁ገለ	-1102
▁አህ	-1103
▁እንዳል	-1104
▁ይገባ	-1105
ነዚህ	-1106
ሰቦች	-1107
ማራ	-1108
▁ዩኒ	-1109
ጥጥር	-1110
መዘ	-1111
▁መብት	-1112
▁ከዚያ	-1113
▁ትር	-1114
ሶች	-1115
▁ተከትሎ	-1116
ጭት	-1117
ብሪካ	-1118
▁ሸ	-1119
ሽኑ	-1120
ገት	-1121
ቨርሲቲ	-1122
▁ጫ	-1123
▁የህዝብ	-1124
▁ውይይት	-1125
▁ተጠቃ	-1126
ርስቲ	-1127
ሬሽን	-1128
▁በኢ	-1129
▁ደን	-1130
▁የአዲስ	-1131
▁ተገል	-1132
▁እንደማይ	-1133
ረር	-1134
ሞክራሲ	-1135
ቆጠ	-1136
▁አጥ	-1137
ቀረበ	-1138
ቂያ	-1139
▁በድ	-1140
በቃ	-1141
▁ልጅ	-1142
▁ጦር	-1143
▁መሪ	-1144
▁የሁ	-1145
▁መሆናቸውን	-1146
▁ዞ	-1147
▁ለውጥ	-1148
▁ሁሉም	-1149
▁ለማግኘት	-1150
ጋሚ	-1151
▁ለህ	-1152
▁አካል	-1153
▁ዮ	-1154
▁ለም	-1155
ነትን	-1156
ሙት	-1157
▁ስራዎች	-1158
▁ትልቅ	-1159
▁አሰራ	-1160
▁ትኩረት	-1161
▁15	-1162
▁ሆነው	-1163
▁የኢን	-1164
▁ወጣ	-1165
▁ባለፈው	-1166
ቨስት	-1167
በታል	-1168
ጠል	-1169
▁ፅህፈት	-1170
▁የአፍሪካ	-1171
▁ዶክተር	-1172
▁አቅም	-1173
▁የካ	-1174
ፃፀ	-1175
▁ድም	-1176
▁በተጨማሪም	-1177
▁አደጋ	-1178
▁መንገ	-1179
ዝር	-1180
ናገሩት	-1181
ጥሮ	-1182
▁መሳሪያ	-1183
▁ሰአት	-1184
▁በሚል	-1185
▁12	-1186
▁እንድ	-1187
ጓል	-1188
▁በተመለከተ	-1189
ጅት	-1190
ሰር	-1191
▁አስታውቋል	-1192
▁ቻ	-1193
▁ምርት	-1194
ምት	-1195
ደርስ	-1196
ወስ	-1197
▁አምላክ	-1198
▁20	-1199
ክሮ	-1200
▁ወይ	-1201
▁ስልጣ	-1202
▁ወጪ	-1203
▁ቢሮ	-1204
▁ነጥብ	-1205
▁ግለ	-1206
▁በዚህም	-1207
ፍጠር	-1208
ታወቀ	-1209
እራ	-1210
▁አዋጅ	-1211
▁ማስተ	-1212
ሎችን	-1213
▁በባ	-1214
ተት	-1215
በራዊ	-1216
ስታ	-1217
▁ነዋ	-1218
▁ውጪ	-1219
ከታ	-1220
ፎች	-1221
▁ማድረ	-1222
ጣይ	-1223
ቃቤ	-1224
ክምና	-1225
▁ብለው	-1226
▁የህግ	-1227
ንካ	-1228
▁አሰልጣ	-1229
▁ፕሮጀክ	-1230
ዘው	-1231
▁መሀ	-1232
ኦሮሚያ	-1233
▁ይችላሉ	-1234
ላው	-1235
ጣሪ	-1236
ካዮች	-1237
▁በበኩ	-1238
ሱም	-1239
ተን	-1240
▁የሚሰ	-1241
ታደ	-1242
ፅሀፍ	-1243
▁ወንድ	-1244
▁ንጉ	-1245
ራን	-1246
ጮች	-1247
ታማ	-1248
▁አደ	-1249
▁መደ	-1250
▁የዋ	-1251
ዳማ	-1252
▁ከወ	-1253
▁ቫይ	-1254
▁መብ	-1255
▁አንዳንድ	-1256
መለስ	-1257
▁በአለም	-1258
ሁንም	-1259
▁ተቃ	-1260
ሱስ	-1261
ብርና	-1262
ደረጉት	-1263
ማር	-1264
▁በመሆኑም	-1265
▁ሂደት	-1266
ነገ	-1267
20	-1268
▁አስፈፃሚ	-1269
▁ያልተ	-1270
▁ጠቁመዋል	-1271
▁ትእ	-1272
ዘጋጀ	-1273
▁ችግሮች	-1274
▁ከሰ	-1275
▁አያ	-1276
▁ገበያ	-1277
▁ህይወት	-1278
▁ስል	-1279
ድስት	-1280
▁11	-1281
ጣሚ	-1282
ክኖ	-1283
ከፍተኛ	-1284
▁ተመል	-1285
▁አስታውቀዋል	-1286
▁በቅርቡ	-1287
▁የገ	-1288
▁ገብ	-1289
ርፖ	-1290
የሱስ	-1291
▁ስብሰባ	-1292
▁ውሀ	-1293
▁ቅር	-1294
ወጥ	-1295
▁ይፋ	-1296
ው፣	-1297
▁እቅድ	-1298
▁ባለመ	-1299
▁ኩባንያዎች	-1300
ሟል	-1301
▁ድርጅቶች	-1302
▁አካባቢዎች	-1303
▁በተለይም	-1304
▁አሉ	-1305
▁ይታወሳል	-1306
▁የግብ	-1307
▁ስርአ	-1308
ንባ	-1309
ቀስ	-1310
▁የብ	-1311
ፈር	-1312
ካል	-1313
▁በዘ	-1314
የም	-1315
▁መለ	-1316
▁ባለው	-1317
▁ዙሪያ	-1318
ያዙ	-1319
▁አባል	-1320
ካሄደው	-1321
▁ና	-1322
ዳሚ	-1323
▁ተገልጿል	-1324
▁የፌዴራል	-1325
▁እስካሁን	-1326
ጠየ	-1327
▁እንደሚገባ	-1328
▁ፊ	-1329
▁አንፃ	-1330
ንፃ	-1331
▁ቢሆንም	-1332
▁ፋብሪካ	-1333
▁መሰረ	-1334
▁ያህዌ	-1335
▁በብ	-1336
ማቸው	-1337
▁ተፅ	-1338
ነግ	-1339
▁በዋ	-1340
▁በሆነ	-1341
▁ጊ	-1342
ላን	-1343
▁ነው፤	-1344
ሌሎች	-1345
▁የራ	-1346
▁አስተያ	-1347
ኤፍ	-1348
▁አላማ	-1349
▁መው	-1350
▁ታው	-1351
ሶስት	-1352
ጠይ	-1353
ባቸውን	-1354
▁ጋዜ	-1355
ሰጣ	-1356
ሰዋል	-1357
▁ተጠቃሚ	-1358
ብኝ	-1359
እክት	-1360
በሩት	-1361
ያያዘ	-1362
▁አማካ	-1363
▁አሁንም	-1364
▁ጥናት	-1365
▁ፍላጎት	-1366
▁ዜጎች	-1367
ይናንስ	-1368
ልም	-1369
▁ርእ	-1370
ሌክትሪክ	-1371
ዎችና	-1372
ርክ	-1373
▁አድርጎ	-1374
ሸነ	-1375
▁ሁለቱ	-1376
▁የቻ	-1377
ክኖሎጂ	-1378
▁ቶ	-1379
▁ተማሪ	-1380
ፈፀም	-1381
ሀት	-1382
ፍትሄ	-1383
ላቀ	-1384
▁የምት	-1385
መለከ	-1386
▁ስለዚህ	-1387
ክቶ	-1388
▁በረ	-1389
▁ዳር	-1390
▁በራ	-1391
ሳቢ	-1392
ሜን	-1393
▁ኢንዱስትሪ	-1394
ራሉ	-1395
▁አንቀ	-1396
ቢት	-1397
▁ስለሚ	-1398
▁ምርመራ	-1399
ዲህ	-1400
ሰን	-1401
እኖ	-1402
▁ስት	-1403
▁በሌላ	-1404
▁የሆነው	-1405
ታችን	-1406
▁ቡድኑ	-1407
▁ሜትር	-1408
ሱት	-1409
▁ሁለተኛ	-1410
ማን	-1411
▁አምስት	-1412
▁ውጭ	-1413
ሷል	-1414
▁ሰላም	-1415
ጀመረ	-1416
ቀርብ	-1417
▁አህመድ	-1418
▁ወጥ	-1419
▁መጥ	-1420
▁የዘ	-1421
▁ባል	-1422
ብን	-1423
▁አንፃር	-1424
ይል	-1425
▁መም	-1426
ኞቹ	-1427
▁ከሁ	-1428
▁ታሪክ	-1429
ቂት	-1430
▁14	-1431
▁አማራ	-1432
▁ዩኒቨርሲቲ	-1433
▁ኮሚሽን	-1434
▁ሰነ	-1435
▁አቃቤ	-1436
ስን	-1437
▁ጠይ	-1438
▁በኮ	-1439
▁ሀገራት	-1440
▁2012	-1441
▁ተጠር	-1442
▁አቋ	-1443
▁የክልሉ	-1444
ናው	-1445
ብሄር	-1446
ሰረተ	-1447
ነበረው	-1448
ረጋግ	-1449
▁አግ	-1450
▁መዝ	-1451
ምድ	-1452
ዎን	-1453
▁ተፅእኖ	-1454
▁መልኩ	-1455
ክተ	-1456
ወጡ	-1457
▁መታ	-1458
▁የባን	-1459
ጠብ	-1460
ቶቹ	-1461
▁አመልክ	-1462
▁ቃ	-1463
▁ለዚህ	-1464
▁ካል	-1465
▁ዳይሬክተር	-1466
▁በጉ	-1467
▁ሊግ	-1468
ውሮ	-1469
ከብ	-1470
ደን	-1471
▁እለት	-1472
▁ወረዳ	-1473
ኗል	-1474
መዝ	-1475
▁አራት	-1476
ዱን	-1477
ብሄራዊ	-1478
ሀብ	-1479
ጠቅላይ	-1480
▁ንግ	-1481
▁አሰራር	-1482
▁ጥቃት	-1483
▁የአሜሪካ	-1484
▁ትን	-1485
▁የተቀ	-1486
ጥነት	-1487
ንቲ	-1488
▁ነገሮች	-1489
ዲሱ	-1490
▁ይዞ	-1491
ከበር	-1492
▁የተወሰ	-1493
▁ይገኛል	-1494
▁አላ	-1495
ረብ	-1496
▁ወንጀል	-1497
▁ተብሏል	-1498
ረጥ	-1499
ሜዳ	-1500
ሎት	-1501
▁በጀት	-1502
ሊዝ	-1503
ቨስትመንት	-1504
ከርካ	-1505
▁ጥሪ	-1506
በኛ	-1507
▁ቢሆንም፣	-1508
ደገ	-1509
ምፒ	-1510
▁ኢኮኖሚ	-1511
▁ሰራዊ	-1512
▁ተግባር	-1513
ፎር	-1514
▁ኮን	-1515
ፈልግ	-1516
▁ከነ	-1517
በብ	-1518
ራር	-1519
▁በመሆን	-1520
ዛዝ	-1521
▁ኬ	-1522
▁13	-1523
▁መኖ	-1524
ንሲ	-1525
ዋሳ	-1526
▁ሜዳ	-1527
ማኖ	-1528
ረጋገጥ	-1529
ደሩ	-1530
▁በሚያ	-1531
▁የፍ	-1532
▁እጅግ	-1533
የን	-1534
ጋቸው	-1535
ምሩ	-1536
ዮር	-1537
▁የከተማ	-1538
▁ባይ	-1539
▁የተመ	-1540
ፈረ	-1541
ግል	-1542
▁አየር	-1543
ኪያ	-1544
ገራ	-1545
▁ሀብት	-1546
▁ሙከራ	-1547
ሊያ	-1548
ቦችን	-1549
ሳስ	-1550
▁ድርጊ	-1551
ግና	-1552
▁የገንዘብ	-1553
ካባቢው	-1554
ባሳ	-1555
▁ከው	-1556
አዴ	-1557
▁በቁ	-1558
▁መሬት	-1559
ነትና	-1560
ስማ	-1561
▁የቡ	-1562
ካት	-1563
▁ስታ	-1564
▁እንኳን	-1565
ደኛ	-1566
ኖረው	-1567
▁የሌ	-1568
ግዚ	-1569
▁ለማሳ	-1570
ቀርቡ	-1571
ያንዳን	-1572
ዚሁ	-1573
▁የምን	-1574
▁እድገት	-1575
ቁት	-1576
▁መንግስታት	-1577
▁ስነ	-1578
▁ደር	-1579
▁ክስ	-1580
ይን	-1581
▁ተገቢ	-1582
▁የገለፁት	-1583
▁በመግለ	-1584
▁ባለሙያዎች	-1585
▁ተግባራዊ	-1586
▁መስመር	-1587
▁ጅ	-1588
▁መዋ	-1589
ሳቸውን	-1590
▁ይገባል	-1591
ባባ	-1592
▁የግል	-1593
▁የሞ	-1594
ፒታል	-1595
▁አስተዋ	-1596
▁ስፍራ	-1597
ርትራ	-1598
ወር	-1599
ሪፖርት	-1600
▁ሰራተኞች	-1601
▁ባለፉት	-1602
ሽከርካ	-1603
ሙን	-1604
▁ካለ	-1605
ስትና	-1606
▁ታውቋል	-1607
ቤተ	-1608
ልፍ	-1609
▁ጨዋታዎች	-1610
ስቲ	-1611
ዳት	-1612
ሰበ	-1613
ለፍ	-1614
▁ዝር	-1615
ነቱን	-1616
▁የጎ	-1617
▁በአገሪቱ	-1618
ግባት	-1619
▁ባንኮች	-1620
▁አመራሮች	-1621
▁18	-1622
▁በር	-1623
▁አለበት	-1624
ካሄደ	-1625
▁እንደሚችል	-1626
ጥረት	-1627
▁ወል	-1628
▁የፕ	-1629
ሰብአዊ	-1630
▁በሽ	-1631
▁ሀሳ	-1632
▁ሪፖርት	-1633
▁ገልጿል	-1634
▁ሀገር	-1635
ስብ	-1636
ዛሪ	-1637
▁ፈቃድ	-1638
▁16	-1639
ያይ	-1640
▁የተሻለ	-1641
▁ፓ	-1642
ገባው	-1643
መለክ	-1644
ረርሽ	-1645
▁ሊቀ	-1646
▁በበኩላቸው	-1647
ንቋ	-1648
ዳሴ	-1649
ፍታት	-1650
▁ሆኖም	-1651
በረሰብ	-1652
▁መተ	-1653
ቆጣጠር	-1654
▁ፕሮግራ	-1655
▁የተለ	-1656
▁እቃ	-1657
▁ድምፅ	-1658
ገናኛ	-1659
ረሱ	-1660
▁በተያያዘ	-1661
▁የቀድሞ	-1662
ብረተሰቡ	-1663
ዋን	-1664
▁አጋጣሚ	-1665
ቻቸውን	-1666
ዷል	-1667
ስቱ	-1668
▁የጤና	-1669
▁ሚና	-1670
ከፈ	-1671
▁አሜሪካ	-1672
▁ከሀ	-1673
ዱት	-1674
▁ስላ	-1675
ገዋል	-1676
▁ነበሩ	-1677
ዳታ	-1678
▁የቴ	-1679
▁ክፍያ	-1680
ፊያ	-1681
▁የውሀ	-1682
▁ይልቅ	-1683
ራቸውን	-1684
ራንስፖርት	-1685
▁ድርሻ	-1686
ከፋ	-1687
▁ኮርፖ	-1688
ለማ	-1689
ምላክ	-1690
ቆም	-1691
▁ጎል	-1692
▁ዞን	-1693
▁ሱዳን	-1694
ፈልጉ	-1695
ዎች፣	-1696
▁ሪ	-1697
ሻገር	-1698
ወጣው	-1699
ጀመርያ	-1700
▁አንቀፅ	-1701
▁ሀላፊነት	-1702
▁ትክ	-1703
▁አስታወቀ	-1704
▁ሰር	-1705
▁ስልጣን	-1706
ኛል	-1707
ዮርጊ	-1708
ሰጡ	-1709
ስራቅ	-1710
▁ያደር	-1711
▁በጋራ	-1712
ንካራ	-1713
ኛውን	-1714
▁አለው	-1715
▁ተወካዮች	-1716
▁መፍትሄ	-1717
ጅም	-1718
▁ለሪፖርተር	-1719
▁በወቅ	-1720
▁አፈፃፀ	-1721
▁ፕሮጀክት	-1722
▁17	-1723
▁ባህር	-1724
ቀም	-1725
ድሩ	-1726
▁መመር	-1727
▁30	-1728
▁ስጋት	-1729
▁እንዲሆን	-1730
ያህ	-1731
ረዳት	-1732
ቋቋም	-1733
ጀንሲ	-1734
50	-1735
▁የሙ	-1736
▁በመቀ	-1737
▁መልካም	-1738
▁ቫይረስ	-1739
an	-1740
▁ሊሆን	-1741
▁2013	-1742
▁የልማት	-1743
▁እኛ	-1744
ደጋጋሚ	-1745
▁የሚለው	-1746
▁ውድድር	-1747
▁ቱ	-1748
▁የመስ	-1749
▁ለሁ	-1750
▁ክልሎች	-1751
ቲት	-1752
ህአዴ	-1753
▁አብዛ	-1754
ናፊ	-1755
መቱ	-1756
ኞችን	-1757
▁መመ	-1758
ወሀት	-1759
ፅኦ	-1760
ደረጃ	-1761
ተና	-1762
▁የሚገኘው	-1763
▁እንደሚያስ	-1764
ጋዊ	-1765
▁አጋማሽ	-1766
ክሲ	-1767
▁የፀጥታ	-1768
▁የኢኮኖሚ	-1769
▁የድ	-1770
▁ከህ	-1771
▁ሀይሎች	-1772
ባሉ	-1773
▁ዝግጅት	-1774
▁ሆቴ	-1775
▁አብይ	-1776
▁እንግ	-1777
▁ተመሳሳይ	-1778
▁ወታደ	-1779
ማል	-1780
▁ኢየሱስ	-1781
▁የተነሳ	-1782
ባለ	-1783
ጫወ	-1784
▁ከኢትዮጵያ	-1785
▁ማእከል	-1786
▁በአጠቃላይ	-1787
▁ትእዛዝ	-1788
▁የሚያስችል	-1789
ቻችን	-1790
▁ብድር	-1791
▁ክፍለ	-1792
▁ፊት	-1793
▁የሰው	-1794
ህር	-1795
▁ብሏል	-1796
▁ስለመ	-1797
▁እግር	-1798
▁ማሻሻ	-1799
▁መስሪያ	-1800
▁ተጫዋቾች	-1801
ገንባት	-1802
▁ከተሞች	-1803
ዳሪ	-1804
ሁፍ	-1805
▁በመንግስት	-1806
▁መስራት	-1807
ጠን	-1808
ያቸው	-1809
ረታ	-1810
ዊት	-1811
▁ምንዛሪ	-1812
▁ስቴ	-1813
ባቂ	-1814
▁ስን	-1815
ፈጠረ	-1816
▁አገራት	-1817
▁አጠቃላይ	-1818
ህአዴግ	-1819
▁ክርስቲ	-1820
▁ንብረት	-1821
▁ያላ	-1822
ጫወት	-1823
▁የለ	-1824
▁ማግኘት	-1825
▁የአገሪቱ	-1826
▁ግብር	-1827
▁በይ	-1828
▁ተሳት	-1829
ጠናቀቅ	-1830
▁አስተዋፅኦ	-1831
▁ፖለቲካ	-1832
ውጣት	-1833
▁መፅሀፍ	-1834
▁ኢትዮጵያን	-1835
ወዳ	-1836
▁በእር	-1837
ጣን	-1838
ሰት	-1839
▁የበለጠ	-1840
ልን	-1841
ፈቀ	-1842
ሰጠው	-1843
▁እንደሌ	-1844
▁እንዳለበት	-1845
▁ህይወ	-1846
▁የምርጫ	-1847
▁ቀጥ	-1848
▁የጋራ	-1849
ደብ	-1850
ም፤	-1851
▁ከግ	-1852
ርማ	-1853
▁ቅድ	-1854
ሸን	-1855
▁የሚመ	-1856
▁መቆ	-1857
ፈራ	-1858
▁ከዚያም	-1859
ቱት	-1860
▁ህዝቦች	-1861
▁የሚሆኑ	-1862
ስቶ	-1863
▁ተሳ	-1864
▁የነበሩት	-1865
ውና	-1866
ሰድ	-1867
▁ጤና	-1868
▁ሮ	-1869
▁መጋ	-1870
▁በተመሳሳይ	-1871
▁ከቀ	-1872
▁ፓርቲዎች	-1873
ዘን	-1874
ሰል	-1875
ላማዊ	-1876
ያል	-1877
ጋሪ	-1878
▁አልተ	-1879
▁ለመቀ	-1880
▁ተጠና	-1881
ዳቤ	-1882
▁ከባድ	-1883
ስትራ	-1884
ያህዌ	-1885
▁ገፅ	-1886
ዩት	-1887
▁አገሪ	-1888
ምረት	-1889
▁ቦርድ	-1890
▁የነበረውን	-1891
▁ከስ	-1892
▁ጣቢያ	-1893
er	-1894
ግዚአ	-1895
▁መነ	-1896
ቤቱ	-1897
▁ጊዮርጊ	-1898
▁ደብ	-1899
ቶችና	-1900
ባብ	-1901
ግዚአብሄር	-1902
▁ይጠበ	-1903
▁ጠንካራ	-1904
▁ድንጋ	-1905
▁መሆኑንም	-1906
▁ነበረ	-1907
▁አሰልጣኝ	-1908
ራይ	-1909
ጉን	-1910
▁ጉዳዩ	-1911
ኳይ	-1912
ዘጋጅ	-1913
ጠረ	-1914
▁ምድር	-1915
▁ሀብ	-1916
▁ሰፊ	-1917
ርያም	-1918
ጣጫ	-1919
▁አመቱ	-1920
▁ወረርሽ	-1921
ጭር	-1922
▁ስሜ	-1923
ፈን	-1924
▁ኡ	-1925
▁ባለስልጣን	-1926
ፁም	-1927
000	-1928
ነኛ	-1929
▁በከፍተኛ	-1930
▁በጎ	-1931
▁የክ	-1932
ከናወን	-1933
▁የወጣ	-1934
ገነባ	-1935
ቸኳይ	-1936
▁ጎን	-1937
ዳቸው	-1938
▁ይጠበቃል	-1939
▁ምእራ	-1940
ራም	-1941
▁ረገድ	-1942
▁ነዋሪዎች	-1943
▁ዴሞክራሲ	-1944
▁በክ	-1945
▁ስለሆነ	-1946
▁የአገር	-1947
ቻሉ	-1948
ውሞ	-1949
ሀል	-1950
ሊየን	-1951
▁ቴክኖሎጂ	-1952
▁የለም	-1953
▁እምነት	-1954
▁ከታ	-1955
መለከት	-1956
ቂቅ	-1957
ታፊ	-1958
▁አምባሳ	-1959
ጠቁ	-1960
▁አመራር	-1961
በልጥ	-1962
▁ሰላ	-1963
ከታተ	-1964
▁ለሰ	-1965
▁ዩ	-1966
▁ላለ	-1967
▁ተከላ	-1968
▁በታች	-1969
በረታ	-1970
▁የማስ	-1971
▁ቋንቋ	-1972
▁ግጭት	-1973
በራት	-1974
▁ፍት	-1975
▁መጨረሻ	-1976
▁ጦርነት	-1977
▁መከላከያ	-1978
▁በቂ	-1979
▁ይናገ	-1980
▁24	-1981
ብብር	-1982
ቀረበው	-1983
▁ተጠቅ	-1984
ሪም	-1985
▁በወቅቱ	-1986
▁ያላቸውን	-1987
ናገር	-1988
▁ስልጠና	-1989
▁ነጋ	-1990
▁የል	-1991
ሱዳን	-1992
ላንድ	-1993
▁አውሮ	-1994
ሆናቸው	-1995
ኒያ	-1996
▁ባለሀብ	-1997
▁ቴሌ	-1998
ከረም	-1999
▁መድረክ	-2000
▁በሌሎች	-2001
ነቶች	-2002
ግባር	-2003
ደርገው	-2004
▁ቢያ	-2005
▁የቦ	-2006
▁ልብ	-2007
▁ኖ	-2008
▁አግኝ	-2009
▁ባሻገር	-2010
▁ጄ	-2011
▁አቅጣጫ	-2012
▁ኢትዮጵያውያን	-2013
ገኙት	-2014
ግባብ	-2015
▁የሚችል	-2016
ድድር	-2017
...	-2018
ታር	-2019
ጀመረው	-2020
▁አድርጓል	-2021
ስተዋ	-2022
▁አስተያየት	-2023
▁ክፍሎች	-2024
ል፣	-2025
▁ኪሎ	-2026
▁አሸናፊ	-2027
▁ተቋም	-2028
▁በል	-2029
▁የኮሮና	-2030
▁ድል	-2031
▁ዝቅ	-2032
▁ከበ	-2033
▁አማካይ	-2034
▁25	-2035
ገልፃ	-2036
ስራኤል	-2037
ላቅ	-2038
▁ጥር	-2039
ውሮፓ	-2040
ሳተፉ	-2041
▁ገብረ	-2042
▁በሰጡት	-2043
▁የትምህርት	-2044
on	-2045
▁የሽ	-2046
▁በአፍሪካ	-2047
▁ፌዴ	-2048
ሬሽኑ	-2049
▁ፎ	-2050
ጫው	-2051
▁የጠ	-2052
▁ጫና	-2053
▁ሻ	-2054
▁ወጣቶች	-2055
ንቀሳቀ	-2056
▁መንግስቱ	-2057
▁ንጉስ	-2058
▁በቀጣይ	-2059
▁መንፈ	-2060
▁በክልሉ	-2061
▁የቅ	-2062
▁ሴቶች	-2063
ናይት	-2064
ቻለ	-2065
ርቶ	-2066
▁አለማ	-2067
▁ፀሀ	-2068
▁ግድብ	-2069
in	-2070
▁መድ	-2071
▁ተገኝ	-2072
▁ወስ	-2073
ባዊ	-2074
▁የጦር	-2075
ገዛ	-2076
▁መልእክት	-2077
▁ኤጀንሲ	-2078
▁ከአንድ	-2079
ፉን	-2080
▁ጉዞ	-2081
▁የሚታ	-2082
ነስተኛ	-2083
ሬታ	-2084
▁መርሀ	-2085
▁መንገዶች	-2086
▁ጭምር	-2087
▁ቡድኖች	-2088
ሶማ	-2089
▁እርዳታ	-2090
ንቃ	-2091
ጠናከር	-2092
▁ዋንጫ	-2093
▁ምት	-2094
▁የኦ	-2095
▁የጉ	-2096
▁አሳስ	-2097
▁ማብራ	-2098
▁የሚታወ	-2099
ሬዳ	-2100
ጣል	-2101
▁የሰብአዊ	-2102
▁ለመስጠት	-2103
▁ተች	-2104
▁የድር	-2105
▁ተከሳ	-2106
▁ደጋ	-2107
▁ቦታዎች	-2108
ጧል	-2109
ክልል	-2110
▁በአል	-2111
▁ፕሬዝ	-2112
ሳዊ	-2113
ምስት	-2114
ጀመሩ	-2115
ፌደ	-2116
ስ፣	-2117
▁የሚፈ	-2118
▁በቅ	-2119
▁ሰራዊት	-2120
▁የፋይናንስ	-2121
ጠቀሙ	-2122
▁ስቴት	-2123
ላለፍ	-2124
ድሮ	-2125
ዝም	-2126
▁ስድስት	-2127
ይወት	-2128
▁ግልፅ	-2129
11	-2130
ከባ	-2131
▁የሲ	-2132
▁መክ	-2133
▁ይመስ	-2134
▁ተዋ	-2135
▁አራ	-2136
▁ሀይለ	-2137
▁ግለሰቦች	-2138
ፏል	-2139
▁እንዳለው	-2140
▁ጥያቄዎች	-2141
▁ማለ	-2142
ነህ	-2143
▁መስጠት	-2144
ጠሩ	-2145
ስተካ	-2146
▁በመተ	-2147
▁በሁለቱ	-2148
ጠበቀ	-2149
ገም	-2150
▁ያመለክ	-2151
▁አዳዲስ	-2152
▁ሩ	-2153
▁በፍጥነት	-2154
▁ህጋዊ	-2155
▁ያደረገ	-2156
▁ለመከላከል	-2157
▁ምክንያቱም	-2158
ባበ	-2159
ስተር	-2160
▁ወገ	-2161
30	-2162
ደሰ	-2163
▁ይገልፃ	-2164
መሰ	-2165
ርባ	-2166
ናሽ	-2167
ንጉ	-2168
ችለው	-2169
▁ፖሊሲ	-2170
▁እንዳስ	-2171
▁ደቡብ	-2172
▁የዳ	-2173
▁ሀላፊዎች	-2174
ጠኛ	-2175
▁ትክክለ	-2176
ልስ	-2177
▁ዙር	-2178
▁ሌላው	-2179
▁እጥረት	-2180
ውው	-2181
▁ጆ	-2182
▁ካሳ	-2183
ቀበ	-2184
▁አስመል	-2185
ለህ	-2186
▁እየሰራ	-2187
ቀረቡት	-2188
▁ተደርጎ	-2189
▁ጥበቃ	-2190
ብዛ	-2191
ንታ	-2192
ሬዳዋ	-2193
ልቁ	-2194
ሳኝ	-2195
▁ዝርዝር	-2196
▁የሆኑት	-2197
ዎቹን	-2198
▁የሰላም	-2199
ጠኝ	-2200
▁የሚችሉ	-2201
ሸነፍ	-2202
▁ተከታ	-2203
ለቀ	-2204
▁ይኼ	-2205
▁ኮሚሽ	-2206
▁መቶ	-2207
▁ተማሪዎች	-2208
▁የመጨረሻ	-2209
▁ለማወቅ	-2210
at	-2211
▁የተባለው	-2212
▁እንደሚገኝ	-2213
ቀጥል	-2214
▁ተሳትፎ	-2215
▁ጃ	-2216
▁የፍት	-2217
▁ማብራሪያ	-2218
▁የአየር	-2219
ሞን	-2220
ካሂ	-2221
▁ያው	-2222
ናይትድ	-2223
ካተ	-2224
▁ደብዳቤ	-2225
▁ሂደ	-2226
▁ከሌሎች	-2227
▁ከም	-2228
▁ፕሮጀክቶች	-2229
ምህር	-2230
10	-2231
ውስ	-2232
ፋር	-2233
▁2010	-2234
▁በተደጋጋሚ	-2235
▁ይላል	-2236
▁ምል	-2237
▁በቁጥጥር	-2238
ሀንስ	-2239
▁ለኢትዮጵያ	-2240
ያት	-2241
▁፤	-2242
▁አዲሱ	-2243
2012	-2244
▁አበባ፣	-2245
ያንዳንዱ	-2246
▁በኤ	-2247
▁ማሀበር	-2248
▁የመን	-2249
▁ተሰ	-2250
▁በደቡብ	-2251
ዳል	-2252
▁ሀም	-2253
ላችሁ	-2254
ማኖት	-2255
▁ለመፍታት	-2256
ከረ	-2257
▁ኢንተር	-2258
▁የወደ	-2259
ዛሬው	-2260
▁የአማራ	-2261
ንቲባ	-2262
ኪና	-2263
ምጣት	-2264
▁አስር	-2265
▁የመጣ	-2266
▁ምግብ	-2267
▁በአገር	-2268
ፈፀመ	-2269
▁2011	-2270
▁መሀመድ	-2271
ፍን	-2272
▁ዜና	-2273
or	-2274
ፓርቲ	-2275
ነታቸው	-2276
▁ህንፃ	-2277
▁ገለፃ	-2278
▁ተጋ	-2279
▁ያገኘ	-2280
▁ባለሙያ	-2281
▁በመግለፅ	-2282
▁ጠባቂ	-2283
▁ወዲህ	-2284
▁አድርገው	-2285
ድብ	-2286
▁አትሌ	-2287
▁ህፃ	-2288
▁መግባ	-2289
15	-2290
▁አመልክተዋል	-2291
ሻሻል	-2292
ታን	-2293
▁ባለስልጣናት	-2294
ወያ	-2295
ላቁ	-2296
ምባ	-2297
▁ቁጥጥር	-2298
ባለው	-2299
ንቶ	-2300
ይቶ	-2301
▁እዚህ	-2302
▁መሪዎች	-2303
▁ተችሏል	-2304
▁አስኪያ	-2305
ጨዋታው	-2306
▁በከተማ	-2307
ፖር	-2308
ሩም	-2309
ላቂ	-2310
▁ጥና	-2311
ኬሽን	-2312
▁አልፎ	-2313
▁ሊቀመን	-2314
▁ከውጭ	-2315
ዲት	-2316
▁መደረጉ	-2317
▁አፈፃፀም	-2318
ግጥ	-2319
▁ተሳታፊ	-2320
▁እንድት	-2321
▁ከሚያ	-2322
▁የበላይ	-2323
▁ምንጮች	-2324
▁ለምን	-2325
ያቂ	-2326
▁ትና	-2327
▁ሆኗል	-2328
▁በስተ	-2329
▁ንግግር	-2330
▁22	-2331
ሾች	-2332
ንደ	-2333
▁እሱ	-2334
ገልግሎ	-2335
18	-2336
መጡ	-2337
▁በመጀመሪያ	-2338
ሀኒ	-2339
ዝና	-2340
ላኩ	-2341
▁ኔ	-2342
▁ጊዮርጊስ	-2343
▁ጓ	-2344
ኖራቸው	-2345
ራች	-2346
ርዱ	-2347
▁የለው	-2348
የሁ	-2349
ቆጠር	-2350
ማማ	-2351
ፈልጋ	-2352
▁ጋዜጣ	-2353
ስተዋል	-2354
▁ዘግ	-2355
ባቸዋል	-2356
▁ተሽከርካ	-2357
ቃወ	-2358
▁ባንኩ	-2359
ጨት	-2360
▁አጠና	-2361
▁ፈተና	-2362
ታወቁ	-2363
▁አረ	-2364
▁ባለቤት	-2365
▁ረቂቅ	-2366
ገረ	-2367
ርቅ	-2368
▁ግብፅ	-2369
▁በመጠቀም	-2370
▁ገበ	-2371
ሴቶች	-2372
ፈረን	-2373
ሳተፍ	-2374
ንጀል	-2375
▁እርስ	-2376
▁የምግብ	-2377
▁ማንኛውም	-2378
▁ችሏል	-2379
▁ወረርሽኝ	-2380
ህና	-2381
▁21	-2382
▁በዚሁ	-2383
▁ሴት	-2384
ችላለ	-2385
ክሽን	-2386
▁የአንድ	-2387
▁እንደሚሆን	-2388
▁ግጭ	-2389
▁ይሁንና	-2390
▁ይላሉ	-2391
▁ወለ	-2392
ኒክ	-2393
▁ለመስራት	-2394
▁ምርቶች	-2395
ቡር	-2396
▁መልክ	-2397
ግባቡ	-2398
▁ከጥ	-2399
▁በስራ	-2400
▁እነዚህን	-2401
▁ቋሚ	-2402
▁አብራር	-2403
ራቢ	-2404
▁መረጃዎች	-2405
ገውን	-2406
▁በህገ	-2407
▁ጥቂት	-2408
ብረተሰብ	-2409
▁መመሪያ	-2410
መለሱ	-2411
▁ውጤታማ	-2412
ናቀ	-2413
በራቸው	-2414
ገለፀው	-2415
▁ሪፖርተር	-2416
ድረስ	-2417
ሪምየር	-2418
ኳስ	-2419
▁አዋጁ	-2420
ሀሴ	-2421
▁ሰባት	-2422
▁ሰኔ	-2423
ኮኖሚያ	-2424
ቡቲ	-2425
ሀንነት	-2426
▁መመርያ	-2427
▁ሰዎችን	-2428
▁ከእነዚህ	-2429
▁አቋም	-2430
▁መሰረታዊ	-2431
በራ	-2432
▁ይዘ	-2433
ካታ	-2434
▁ኢትዮጵያዊ	-2435
▁ክለቦች	-2436
▁ተራ	-2437
▁የቀረበ	-2438
▁የደቡብ	-2439
▁የዩ	-2440
▁ቀላል	-2441
መደ	-2442
▁ብዙሀን	-2443
▁ቆይታ	-2444
▁ርእሰ	-2445
▁ሰለ	-2446
ኬት	-2447
▁ብል	-2448
▁ጨዋታው	-2449
መሩ	-2450
▁ልማ	-2451
ለኝ	-2452
▁ልክ	-2453
መነ	-2454
ጉም	-2455
በኞች	-2456
▁ጥቃ	-2457
ፈፀሙ	-2458
▁ሲሆኑ	-2459
▁ፕሮግራም	-2460
▁ውል	-2461
▁ቅጣት	-2462
ሮቹ	-2463
ታሉ	-2464
▁ልጆ	-2465
▁ይበልጥ	-2466
▁ተሰጥ	-2467
ንቃቄ	-2468
ሹራንስ	-2469
▁ህዝቡ	-2470
▁ባሉ	-2471
▁ጠቅላላ	-2472
ገሪቱን	-2473
▁ማስረጃ	-2474
ቪድ	-2475
ዲዮ	-2476
▁23	-2477
▁አገሪቱ	-2478
ቆጠሩ	-2479
▁የሚገኝ	-2480
.5	-2481
▁ተቃውሞ	-2482
▁በኦሮሚያ	-2483
▁ልምድ	-2484
ተኛው	-2485
▁ማክ	-2486
ገበ	-2487
▁ሰነድ	-2488
▁መነሻ	-2489
▁ቅሬታ	-2490
▁ችሎ	-2491
▁አምባሳደር	-2492
ድኑ	-2493
▁በማሳ	-2494
ፕሎ	-2495
ገናኘ	-2496
▁የተፈ	-2497
▁መልስ	-2498
▁ምሳሌ	-2499
▁የትግራይ	-2500
▁ሰብሳቢ	-2501
▁በዋና	-2502
▁እንዲፈ	-2503
▁ይገኛሉ	-2504
ጠዋል	-2505
▁አቅርቦት	-2506
▁ዋስትና	-2507
▁ባለፈ	-2508
▁ከንቲባ	-2509
ጥን	-2510
ጠፋ	-2511
ሞት	-2512
▁በምር	-2513
ሄዱ	-2514
▁በሁለት	-2515
▁በየአ	-2516
ፌደራል	-2517
ቆጥ	-2518
▁ተግባራት	-2519
ህንነት	-2520
ገባት	-2521
ፈጠረው	-2522
ታዎች	-2523
▁ሁሉንም	-2524
▁ህክምና	-2525
▁ብሄር	-2526
▁እድሜ	-2527
በትና	-2528
▁በቀጥታ	-2529
ዥን	-2530
ዘርፉ	-2531
ናገሩ	-2532
▁ሹ	-2533
▁ገና	-2534
▁ክት	-2535
ሳሰ	-2536
▁በመጨረሻ	-2537
▁ማር	-2538
መልከት	-2539
ኮኖሚያዊ	-2540
▁አስቀ	-2541
ርፍ	-2542
▁አቅርበዋል	-2543
▁የተናገሩት	-2544
▁ስምም	-2545
በሌ	-2546
ረዱ	-2547
▁'	-2548
▁በሁለተኛ	-2549
ጥቃት	-2550
▁አድርገዋል	-2551
▁ለሀ	-2552
▁አነስተኛ	-2553
▁በአግባቡ	-2554
ሰጣቸው	-2555
ጦች	-2556
ማቸውን	-2557
▁ማሻሻያ	-2558
ይቱ	-2559
ጣቸው	-2560
▁ያስረዳ	-2561
▁እውነ	-2562
▁የውድድር	-2563
▁መኮ	-2564
ወደ	-2565
▁አማራጭ	-2566
▁ይታ	-2567
ስቸኳይ	-2568
▁ማረ	-2569
▁ሊሆኑ	-2570
▁በህግ	-2571
ጊዜው	-2572
▁ዮሀንስ	-2573
▁የዚህ	-2574
ጠውን	-2575
▁አስመልክቶ	-2576
▁አጥቂ	-2577
▁አንተ	-2578
▁የሚለውን	-2579
om	-2580
▁መወሰ	-2581
▁መግ	-2582
▁ዛ	-2583
▁መንግስታዊ	-2584
▁የኦሮሚያ	-2585
▁ለህዝብ	-2586
▁እንደገለፁት	-2587
▁ተለ	-2588
▁የዋጋ	-2589
▁በዚያ	-2590
▁በመሆኑ፣	-2591
ንግሊዝ	-2592
ኒው	-2593
▁ብርሀ	-2594
ሆኑም	-2595
ስተዳደር	-2596
ገሩ	-2597
ጅቱ	-2598
▁ይታወቃል	-2599
▁ጠይቀዋል	-2600
▁የደረ	-2601
▁እየተደረገ	-2602
▁በማን	-2603
▁መስከረም	-2604
▁ጳ	-2605
▁ደጋፊ	-2606
▁እስራ	-2607
▁ዘገባ	-2608
▁ጥቅምት	-2609
▁ወረ	-2610
▁ጌታ	-2611
▁28	-2612
▁ከሁለት	-2613
▁አግባብ	-2614
▁ወይዘ	-2615
▁ድርጊት	-2616
▁ወሳኝ	-2617
▁ይናገራሉ	-2618
▁ደመ	-2619
ዛቤ	-2620
ርስቶ	-2621
ነጋገር	-2622
en	-2623
▁ሀብረት	-2624
▁ካር	-2625
ቷን	-2626
▁እም	-2627
▁ተያይ	-2628
▁ትናንት	-2629
▁መረጃዎችን	-2630
▁ደረ	-2631
ለያየ	-2632
▁ሚሊየን	-2633
ሪት	-2634
▁ክለብ	-2635
ሪው	-2636
ያጭ	-2637
▁ስራዎችን	-2638
▁ይደ	-2639
▁አላቸው	-2640
▁ጂ	-2641
ገመ	-2642
▁ባለሀብቶች	-2643
▁ወገኖች	-2644
▁27	-2645
▁የህክምና	-2646
▁ፕሬዚዳን	-2647
▁ፍሬ	-2648
ግም	-2649
▁ተደራ	-2650
▁አጀ	-2651
▁ተቀባይ	-2652
ጡን	-2653
▁ሊቀመንበር	-2654
ፍና	-2655
ww	-2656
ቻላል	-2657
▁ይኖ	-2658
▁ኢንቨስትመንት	-2659
▁በነበረው	-2660
ንብ	-2661
ዋሚ	-2662
▁ዘመቻ	-2663
▁ልዩነት	-2664
ሮው	-2665
ፕሎማ	-2666
▁ለምሳሌ	-2667
▁ወደፊት	-2668
▁አማካኝነት	-2669
ዮችን	-2670
▁ስጋ	-2671
▁የሚያደርጉ	-2672
ከሉ	-2673
▁በውጭ	-2674
ሊስ	-2675
▁አኳ	-2676
▁መሸ	-2677
▁አስደ	-2678
ጣጥ	-2679
▁ሶስተኛ	-2680
▁ፍቅር	-2681
▁ተስፋዬ	-2682
ኳር	-2683
ንባታ	-2684
▁ቀጠ	-2685
ሀዊ	-2686
▁ለፍ	-2687
▁ያመለክታል	-2688
ኢን	-2689
▁ይቻላል	-2690
ላከ	-2691
▁ስህ	-2692
ገራችን	-2693
▁የሆነውን	-2694
▁ለብ	-2695
▁በሁሉም	-2696
▁ወቅታዊ	-2697
ሳካ	-2698
▁በዛሬው	-2699
▁ለመፍጠር	-2700
ከናወኑ	-2701
▁ያስተ	-2702
tt	-2703
▁አቢ	-2704
ቃቸው	-2705
▁ይሄ	-2706
ስትራክሽን	-2707
▁በትግራይ	-2708
ዶችን	-2709
▁ትንሽ	-2710
ነታቸውን	-2711
ደል	-2712
ጠናቀቁ	-2713
▁ማጣ	-2714
ላይታ	-2715
▁ይኖር	-2716
የአ	-2717
ላትን	-2718
▁ትውል	-2719
▁የግብርና	-2720
▁ኤሌክትሪክ	-2721
ለበት	-2722
▁የመከላከያ	-2723
ጋና	-2724
▁እንደተናገሩት	-2725
ኒስት	-2726
▁እንደገለፁ	-2727
▁መደበኛ	-2728
▁ዘመናዊ	-2729
ባበር	-2730
▁ያደረገው	-2731
▁ጥቅ	-2732
ጀር	-2733
▁አወ	-2734
▁በቀላሉ	-2735
ዳና	-2736
ስፋት	-2737
▁አፍ	-2738
▁ተመ	-2739
▁ህብረት	-2740
ልጋ	-2741
▁ይዘው	-2742
▁የቤት	-2743
▁የደረሰ	-2744
ሴት	-2745
ዳዩ	-2746
▁እንደገና	-2747
▁ወገን	-2748
▁ስሜት	-2749
▁ጉብኝ	-2750
▁ተጠርጣሪ	-2751
▁የኤሌክትሪክ	-2752
ዳረ	-2753
▁እየተሰራ	-2754
▁ማስታወ	-2755
▁ከአዲስ	-2756
▁የባለ	-2757
▁26	-2758
▁በግልፅ	-2759
▁አርብ	-2760
ኖችን	-2761
ሆነው	-2762
▁ቶን	-2763
▁አውሮፕ	-2764
▁ኢኮኖሚያዊ	-2765
ሰስ	-2766
ኩት	-2767
▁የምታ	-2768
▁ግንቦት	-2769
▁የመጀመሪያው	-2770
ንድን	-2771
▁ግም	-2772
▁ድርድር	-2773
▁ዴሞክራሲያዊ	-2774
199	-2775
▁የይ	-2776
▁የሚተ	-2777
▁ሀዋሳ	-2778
▁h	-2779
ካሄዱ	-2780
ፈጠሩ	-2781
ገልግሎት	-2782
ጣቱ	-2783
▁እንደማ	-2784
▁እያደረገ	-2785
ቀፍ	-2786
▁ሬ	-2787
ቀመጥ	-2788
▁የባንኩ	-2789
al	-2790
▁ያስፈል	-2791
ራዘ	-2792
ክተሩ	-2793
ጠኞች	-2794
▁ባደረጉት	-2795
ዝቡ	-2796
ፋሉ	-2797
▁መዘ	-2798
▁የተደረገ	-2799
ንፈ	-2800
▁ደስታ	-2801
ቫይረሱ	-2802
▁አማካይነት	-2803
-1	-2804
▁ወይዘሮ	-2805
▁በፖ	-2806
▁ነጋዴ	-2807
ገበያ	-2808
▁ፈፅ	-2809
▁መጀመሪያ	-2810
በርካታ	-2811
▁ኩባንያው	-2812
ቻለው	-2813
ጨዋታ	-2814
ፋን	-2815
ደርሱ	-2816
▁ያሉትን	-2817
▁የተሰማ	-2818
ቴጂ	-2819
▁አብራርተዋል	-2820
ጋጠ	-2821
ችልም	-2822
ያዘው	-2823
▁ትብብር	-2824
▁ቅርንጫ	-2825
ar	-2826
▁ተቋማ	-2827
▁በፕ	-2828
ቀል	-2829
▁የባንክ	-2830
▁ከዚህም	-2831
▁ነጥ	-2832
▁በአካባቢው	-2833
▁አለባቸው	-2834
▁የተመሰረተ	-2835
ቀሳ	-2836
▁እንደገለፁት፣	-2837
ለካ	-2838
▁ወጣት	-2839
▁አርሶ	-2840
▁የተገኘ	-2841
ቅርብ	-2842
ብርሀ	-2843
▁አሳስበዋል	-2844
ሁድ	-2845
▁ስፖርት	-2846
▁የሰራ	-2847
▁ዘርፎች	-2848
ከናው	-2849
▁ሲሆን፤	-2850
ነሰ	-2851
▁በፅ	-2852
▁የተባበሩት	-2853
ሎስ	-2854
▁ሆቴል	-2855
▁ጭማሪ	-2856
▁የብሄራዊ	-2857
▁የዲ	-2858
ዳሜ	-2859
ከላዊ	-2860
ሎቹ	-2861
▁በቦ	-2862
▁!	-2863
▁በቀጣ	-2864
▁ነው፣	-2865
▁አብዱ	-2866
▁የመጀመርያ	-2867
▁ስደ	-2868
▁ራሱን	-2869
▁ወታደራዊ	-2870
▁በሀላ	-2871
ሮጀ	-2872
▁አቤቱ	-2873
▁ነፃነት	-2874
ራሽ	-2875
▁ያመ	-2876
▁በአማራ	-2877
ህል	-2878
▁ቀድሞ	-2879
▁ልም	-2880
▁ክር	-2881
ስቡ	-2882
▁አስኪያጅ	-2883
ሳሉ	-2884
ልፅግና	-2885
ገልፁ	-2886
ለል	-2887
▁ለአንድ	-2888
▁መስተዳ	-2889
▁ሆስ	-2890
▁የቱ	-2891
▁የሚገባ	-2892
ሪዝም	-2893
▁እውቅና	-2894
▁ያስታወ	-2895
▁ኑ	-2896
ሂሳብ	-2897
▁ችሎት	-2898
ስተው	-2899
ውሰድ	-2900
▁የአምላክ	-2901
መለከተው	-2902
▁አንዳን	-2903
ክታር	-2904
▁አንድነት	-2905
ረጋጋት	-2906
ዋቂ	-2907
▁የዜ	-2908
ጎችን	-2909
ተኝነት	-2910
▁በመስጠት	-2911
ጋዜ	-2912
▁እንደሆኑ	-2913
▁ፕሬዝዳንት	-2914
ሰጠ	-2915
▁የተለየ	-2916
12	-2917
በትም	-2918
▁ያደረጉት	-2919
▁በቀለ	-2920
ክሩ	-2921
▁ምንጭ	-2922
▁የፅ	-2923
▁ተያይዞ	-2924
▁50	-2925
▁አረጋግ	-2926
▁ፀሀፊ	-2927
ንቀሳቀሱ	-2928
▁የእር	-2929
▁ድንጋጌ	-2930
▁አለመሆኑ	-2931
-0	-2932
ካን	-2933
▁ቀዳሚ	-2934
▁የተከሰ	-2935
▁ምሁ	-2936
▁ጠቅሰዋል	-2937
▁ይቀ	-2938
▁አክሲ	-2939
▁ጥላ	-2940
▁አክለዋል	-2941
አብ	-2942
▁የተወሰነ	-2943
▁ሰጥተዋል	-2944
▁የምርመራ	-2945
ሲል	-2946
▁2009	-2947
ጋጥ	-2948
▁በድጋሚ	-2949
እና	-2950
▁ሳቢያ	-2951
▁ተጠያቂ	-2952
▁ግዛት	-2953
▁/	-2954
▁የሚያሳ	-2955
▁S	-2956
ርስቶስ	-2957
ቢሲ	-2958
ድርሻ	-2959
▁ቪ	-2960
▁ፍፁም	-2961
ጀመርያው	-2962
▁ሰላማዊ	-2963
▁የማእ	-2964
▁ስትራ	-2965
ሜሽን	-2966
ወሰን	-2967
▁ተጫዋች	-2968
st	-2969
ናልባት	-2970
▁ይፈ	-2971
▁በኢን	-2972
በላ	-2973
በአ	-2974
▁መቆየ	-2975
▁ጥራት	-2976
▁እንዳለባቸው	-2977
▁እንዳልሆነ	-2978
▁መሆናቸው	-2979
ይታ	-2980
▁0	-2981
ሯቸው	-2982
▁ግዴ	-2983
ሳን	-2984
▁ፅሁፍ	-2985
▁ተብለው	-2986
ሊን	-2987
ገለግ	-2988
▁ኤል	-2989
▁ዝግጁ	-2990
▁የሁለቱ	-2991
▁ካለው	-2992
ችሁን	-2993
▁ይሰጣ	-2994
▁ከሌ	-2995
▁ሳያ	-2996
▁ስራው	-2997
ቐለ	-2998
▁ፕሮፌ	-2999
▁ኮርፖሬሽን	-3000
▁ስለተ	-3001
▁ብሄረ	-3002
▁መጋቢት	-3003
ቸጋሪ	-3004
ሰኞ	-3005
ፈዋል	-3006
▁እንዳሉት	-3007
ፈለጉ	-3008
ትም	-3009
▁ስራውን	-3010
▁አኳያ	-3011
ቾችን	-3012
▁የቢ	-3013
▁ላይም	-3014
ናይ	-3015
▁ለስ	-3016
▁ሰጪ	-3017
ላችን	-3018
ጣሪዎች	-3019
▁ስቴትስ	-3020
▁መጠቀም	-3021
▁ሰጥቷል	-3022
▁የሚሰራ	-3023
▁በመሆናቸው	-3024
//	-3025
▁ተመስ	-3026
▁ትራንስፖርት	-3027
▁ዝቅተኛ	-3028
17	-3029
▁የሚመራ	-3030
ሰልጣ	-3031
ፈልገው	-3032
ኔት	-3033
▁ቻይና	-3034
ክለቡ	-3035
▁ጅማ	-3036
ttp	-3037
▁እስኪ	-3038
▁ሳምን	-3039
▁ተቀባይነት	-3040
▁ዳዊት	-3041
ዘዋ	-3042
ጀምር	-3043
60	-3044
▁ተል	-3045
ኮም	-3046
▁ካሉ	-3047
▁ድረ	-3048
://	-3049
ዘጋጀት	-3050
ሴን	-3051
▁ተወዳ	-3052
▁ቁር	-3053
▁በካ	-3054
ቪዥን	-3055
▁ብቃት	-3056
ጥረው	-3057
መና	-3058
▁ከሳ	-3059
ላቸዋል	-3060
▁ይኸ	-3061
▁አጀንዳ	-3062
▁የነዳጅ	-3063
▁ሰን	-3064
ይማኖት	-3065
▁ኢንጂ	-3066
▁29	-3067
ጣኝ	-3068
▁የኢንዱስትሪ	-3069
ንቀሳቀስ	-3070
▁እንደምት	-3071
▁የሚሉት	-3072
ያንስ	-3073
▁ኮሚቴው	-3074
▁40	-3075
▁ሪፖር	-3076
▁ከት	-3077
▁ርቀት	-3078
▁ቀጠሮ	-3079
▁በፀ	-3080
▁ተመራ	-3081
▁የብድር	-3082
▁አዳማ	-3083
ንክ	-3084
▁መፈ	-3085
▁ሰብአዊ	-3086
ምረ	-3087
ኩባንያ	-3088
▁ቅድመ	-3089
ሬዚ	-3090
▁ነዋሪ	-3091
▁እናንተ	-3092
▁ታስ	-3093
ተኮ	-3094
ከተል	-3095
▁2008	-3096
ቲክ	-3097
▁ጉል	-3098
ቻይና	-3099
▁እቅ	-3100
▁የቻይና	-3101
ቱ፣	-3102
▁ግርማ	-3103
ጓዝ	-3104
▁እንደሚገኙ	-3105
ሶችን	-3106
▁ኤር	-3107
ምረው	-3108
▁ፖለቲካዊ	-3109
▁ከመስ	-3110
▁በግብ	-3111
▁ዱ	-3112
ካኤል	-3113
▁በአሜሪካ	-3114
▁ችግሮችን	-3115
▁መገኘ	-3116
▁ጉድ	-3117
▁የእድ	-3118
▁ክርስቲያ	-3119
ችኋ	-3120
▁ተቀብ	-3121
▁ማሀበራት	-3122
ሙስ	-3123
ቆይ	-3124
▁መስጠ	-3125
▁ታደሰ	-3126
ኔራል	-3127
▁ማርያም	-3128
መም	-3129
▁ምናልባት	-3130
▁ፕሪምየር	-3131
▁አሻ	-3132
▁በሀገሪቱ	-3133
ጠኝነት	-3134
▁http	-3135
ፎርሜሽን	-3136
▁ማለትም	-3137
le	-3138
ኦሮሞ	-3139
▁ሀምሌ	-3140
▁ከተለያዩ	-3141
ረፍት	-3142
ከናወነ	-3143
ባር	-3144
▁ብዬ	-3145
▁ገደ	-3146
▁የስነ	-3147
ላእክት	-3148
▁የሚሉ	-3149
▁የሊ	-3150
▁ሁኔታዎች	-3151
40	-3152
▁መፍጠር	-3153
▁ዳን	-3154
▁የገቢ	-3155
ጠቀሱት	-3156
ገራቸው	-3157
▁ባወጣው	-3158
▁በውይ	-3159
ተናል	-3160
▁ታላቅ	-3161
▁መርማሪ	-3162
▁ለዘ	-3163
▁በሚገኘው	-3164
ኤስ	-3165
▁የወንጀል	-3166
▁ነሀሴ	-3167
▁ተደርጓል	-3168
▁ከደ	-3169
▁በመም	-3170
▁ከፋ	-3171
▁፲	-3172
ግግር	-3173
▁መፍ	-3174
▁ገፃ	-3175
▁ደንብ	-3176
ገናኝ	-3177
ዶቹ	-3178
ነገር	-3179
▁C	-3180
▁ማቅረብ	-3181
▁ጠቁመው	-3182
ፓርላማ	-3183
▁ድርጅቱ	-3184
▁ምክንያቶች	-3185
▁የጠቆ	-3186
▁አብሮ	-3187
▁ጊዜያት	-3188
ራው	-3189
▁ደም	-3190
ፆች	-3191
▁አቅራቢ	-3192
▁ለወ	-3193
▁የን	-3194
ዴሞክራሲ	-3195
ወሰነ	-3196
ወስድ	-3197
▁በመጥ	-3198
▁እግዚአብሄር	-3199
ጊያ	-3200
▁በሁለተኛው	-3201
▁አንስቶ	-3202
▁በህዝብ	-3203
▁የተቀመ	-3204
▁ጉዳዩን	-3205
▁ውድድ	-3206
▁አገራዊ	-3207
ጥሩ	-3208
▁የወሰ	-3209
▁ሉ	-3210
▁መጣ	-3211
▁ሄክታር	-3212
ጁን	-3213
▁ለፍርድ	-3214
አይ	-3215
▁የግድ	-3216
▁ግዥ	-3217
▁ሲባል	-3218
ቆች	-3219
▁A	-3220
▁ነዳጅ	-3221
▁ስትራቴጂ	-3222
ልቃ	-3223
▁መጨ	-3224
▁ለማሳደግ	-3225
▁በሳ	-3226
▁የምና	-3227
በሪያ	-3228
▁የሚኖሩ	-3229
ቪል	-3230
▁ተስማ	-3231
▁የተባሉ	-3232
ረከ	-3233
▁እንዳሉ	-3234
▁የቁ	-3235
▁ታማ	-3236
▁አመለካ	-3237
▁ተገ	-3238
▁የፋና	-3239
▁እንደመ	-3240
▁ነኝ	-3241
▁የመል	-3242
የሩ	-3243
▁ይሆዋ	-3244
▁የሚባል	-3245
▁ገዥ	-3246
▁አስቸጋሪ	-3247
▁ለዚህም	-3248
ዎችም	-3249
▁የካቲት	-3250
▁የሀይል	-3251
▁ለመገንባት	-3252
▁ምርጥ	-3253
ሞላ	-3254
▁ካፒታል	-3255
▁የገበያ	-3256
▁የሚሆን	-3257
ሊክ	-3258
ሌት	-3259
▁የባህር	-3260
▁አስተዳደሩ	-3261
ኬንያ	-3262
▁ህፃናት	-3263
▁ቀይ	-3264
▁ተነ	-3265
መለከታቸው	-3266
▁እንደሚችሉ	-3267
ሲያ	-3268
▁ዋነኛ	-3269
▁የያህዌ	-3270
▁ያደርጋል	-3271
ሪስ	-3272
▁ዘዴ	-3273
▁መድሀኒ	-3274
▁አስተያየ	-3275
ሏቸው	-3276
ወገድ	-3277
▁ተሸ	-3278
▁አቅርቦ	-3279
ድቅ	-3280
▁ፍቃ	-3281
▁ክርስቲያን	-3282
▁የፓርቲ	-3283
ቶች፣	-3284
ዘጋጁ	-3285
▁ደስ	-3286
2013	-3287
▁እየታ	-3288
▁ቲ	-3289
▁ሆይ	-3290
ሊሞች	-3291
▁ቀጣይ	-3292
ናቂ	-3293
▁ጌታቸው	-3294
▁ስምንት	-3295
▁መቅ	-3296
▁በድር	-3297
ቋረጥ	-3298
ዝግ	-3299
▁መንፈስ	-3300
▁ሰአ	-3301
▁የሚጠ	-3302
▁ወርቅ	-3303
መቻ	-3304
14	-3305
▁የተከ	-3306
ቤል	-3307
▁ይመስላል	-3308
▁ለመግ	-3309
▁አልነበረ	-3310
▁የሚደረግ	-3311
▁ደቂቃዎች	-3312
ሮድ	-3313
▁ቆይቷል	-3314
▁ድቻ	-3315
▁ድንበር	-3316
▁ህገወጥ	-3317
▁እንደሆነም	-3318
▁ዝግጅ	-3319
▁ገልፀው	-3320
ደርጋ	-3321
▁ባስ	-3322
▁በይፋ	-3323
▁ትክክለኛ	-3324
▁ቀውስ	-3325
ችግ	-3326
▁ወዳ	-3327
▁ሁለተኛው	-3328
▁በእርግጥ	-3329
ሪንግ	-3330
▁በአጭር	-3331
▁ክትትል	-3332
▁ፒ	-3333
▁በሙ	-3334
▁የመሬት	-3335
▁በየአመቱ	-3336
ማሉ	-3337
ግዳ	-3338
እክ	-3339
ባባሪ	-3340
▁በነፃ	-3341
ዩኒኬሽን	-3342
▁ለማቅረብ	-3343
▁መኖሪያ	-3344
▁ሲሉም	-3345
▁አሳል	-3346
ጪው	-3347
ገነቡ	-3348
▁ለመሆን	-3349
▁የምክር	-3350
▁የተደረገው	-3351
▁ማረጋገ	-3352
ልጣን	-3353
▁አስቀድሞ	-3354
▁እንስ	-3355
▁ላለፉት	-3356
▁መገናኛ	-3357
▁ለማረጋገጥ	-3358
2011	-3359
▁መሰረተ	-3360
▁ምህ	-3361
▁ያለበት	-3362
ፓን	-3363
▁ጨረታ	-3364
▁ፈጣን	-3365
▁ለግ	-3366
▁ክስተ	-3367
በተ	-3368
▁መብቶች	-3369
25	-3370
▁ከመንግስት	-3371
ሟላ	-3372
ቃሚ	-3373
▁ታሪካ	-3374
▁ደሳ	-3375
ዘጋጀው	-3376
▁አድራ	-3377
▁ምእራፍ	-3378
ላጆች	-3379
▁በራሱ	-3380
▁ምስራቅ	-3381
▁ቀጣ	-3382
▁ኬንያ	-3383
▁የሳ	-3384
▁ኮንት	-3385
ዋእ	-3386
▁ለጥ	-3387
▁መኮንን	-3388
▁ምቹ	-3389
▁አደረጃ	-3390
▁የሀገሪቱ	-3391
▁ሊያስ	-3392
▁ደሀንነት	-3393
ሰቦ	-3394
▁በኋላ፣	-3395
ገቡት	-3396
ገማ	-3397
ይጣ	-3398
▁ስርአቱ	-3399
ማግ	-3400
▁እንዳላቸው	-3401
▁ንብረ	-3402
▁የአውሮፓ	-3403
▁ግዙ	-3404
ሽት	-3405
ንዳንድ	-3406
ፍሬ	-3407
▁መልሶ	-3408
ዎት	-3409
ገባቸው	-3410
▁ነበር፤	-3411
▁ሎ	-3412
ጨመረ	-3413
▁መሀል	-3414
▁የሚሰጥ	-3415
▁ወንጀ	-3416
▁አማካሪ	-3417
ክክር	-3418
ክኒክ	-3419
▁የተገኘው	-3420
▁የኢትዮጵያን	-3421
▁በሶ	-3422
ሳቁ	-3423
▁አቻ	-3424
▁ጠቃሚ	-3425
▁ትርጉም	-3426
▁ዘንድሮ	-3427
▁የተመረ	-3428
▁ኮሚሽነር	-3429
ቁር	-3430
ወጣት	-3431
ዚቃ	-3432
▁በዳ	-3433
▁ደህንነት	-3434
ዲያው	-3435
ቋረ	-3436
▁ማህበረሰብ	-3437
ረጅም	-3438
▁እንድን	-3439
▁ማክሰኞ	-3440
▁በቡ	-3441
▁በትክ	-3442
▁ደሳለኝ	-3443
▁በአንፃ	-3444
▁እንዲሆኑ	-3445
ሁዳ	-3446
▁የሶ	-3447
▁ማህበራዊ	-3448
ጎብ	-3449
▁የተወ	-3450
▁በአብዛ	-3451
ሳሰብ	-3452
▁ተከታታይ	-3453
ራምፕ	-3454
ፌዴሪ	-3455
▁የቆየ	-3456
▁1.	-3457
▁ያደረጉ	-3458
ሸጥ	-3459
ያቸውን	-3460
▁ታክስ	-3461
?"	-3462
ዋት	-3463
▁መጠየ	-3464
▁ለሚያ	-3465
ጠነ	-3466
▁ትስ	-3467
com	-3468
▁የክልል	-3469
▁ትርፍ	-3470
እራብ	-3471
▁በመጠ	-3472
▁ኢትዮ	-3473
▁ቀበሌ	-3474
▁ምድብ	-3475
13	-3476
▁ይቅር	-3477
▁የቤተ	-3478
ፈፅ	-3479
▁ባደረገው	-3480
ከሩ	-3481
▁ዳይሬክተሩ	-3482
▁ከብ	-3483
▁ብዛት	-3484
▁ይገልፃሉ	-3485
በታ	-3486
▁መፃ	-3487
ይህ	-3488
ሚንቶ	-3489
ነት፣	-3490
▁ብርሀኑ	-3491
ሰና	-3492
▁መከላከል	-3493
▁በቴ	-3494
ላለች	-3495
▁ኢንስ	-3496
▁ፌ	-3497
▁በገ	-3498
▁የህዳሴ	-3499
ሀሳስ	-3500
ረክ	-3501
ሉ፣	-3502
ከቱ	-3503
▁በማቅረብ	-3504
ሚዎች	-3505
▁የቴሌ	-3506
▁ጠብ	-3507
▁ጀም	-3508
ተኞችን	-3509
ነበር	-3510
ማግሌ	-3511
▁ናት	-3512
▁100	-3513
▁አጠቃ	-3514
▁ትልቁ	-3515
ሶማሌ	-3516
▁ቅዳሜ	-3517
▁ሰኞ	-3518
▁የተሻ	-3519
▁አመታዊ	-3520
ልማ	-3521
▁ዘላቂ	-3522
▁የኢንቨስትመንት	-3523
ገበው	-3524
▁ቢያንስ	-3525
▁ሰለሞን	-3526
▁ዘግቧል	-3527
▁የጠቅላይ	-3528
▁አቤቱታ	-3529
▁በተካሄደው	-3530
▁መጀመ	-3531
ዳጊ	-3532
ዮቹ	-3533
ሰቢያ	-3534
▁ተናግሯል	-3535
ክቷል	-3536
▁የግንባታ	-3537
▁ሰሞ	-3538
▁የተቋቋ	-3539
▁ሰማ	-3540
▁በፌዴራል	-3541
ውጣ	-3542
▁በስተቀር	-3543
ገኘውን	-3544
▁በእጅ	-3545
▁በዋናነት	-3546
ጌታ	-3547
▁መሰል	-3548
ጃሉ	-3549
▁ማቆ	-3550
▁ተር	-3551
▁ስርጭት	-3552
▁ክብር	-3553
▁ያስፈልጋል	-3554
▁የእስራኤል	-3555
ለቱን	-3556
▁የሚቆጠሩ	-3557
ራፊ	-3558
▁ጥንቃቄ	-3559
ላቱ	-3560
▁ማሀበረሰብ	-3561
▁ቀሪ	-3562
▁የአገሪቱን	-3563
▁የተቃ	-3564
▁የመንገድ	-3565
ቁሟል	-3566
▁በሊ	-3567
ናሽናል	-3568
▁ያሸን	-3569
▁ስህተት	-3570
▁የትራንስፖርት	-3571
▁እኩል	-3572
▁ግንዛቤ	-3573
ገልፅ	-3574
መለከቱ	-3575
ጋቸውን	-3576
▁ከበደ	-3577
▁ምግባር	-3578
▁ሳምንታት	-3579
▁የወደቁ	-3580
▁እንደም	-3581
▁በሽታ	-3582
ደገፍ	-3583
▁ተገለፀ	-3584
▁ሚዲያ	-3585
▁ግምት	-3586
ዝገባ	-3587
▁እያለ	-3588
▁ጉብኝት	-3589
ቃሉ	-3590
ጣኔ	-3591
ዲን	-3592
ምባሲ	-3593
▁አልቻ	-3594
▁ሰላምና	-3595
▁አብርሀ	-3596
ሟላት	-3597
▁እየተካሄደ	-3598
▁ኮሚሽኑ	-3599
ዳቸውን	-3600
▁ባለቤ	-3601
▁አቢይ	-3602
▁ገልፀው፣	-3603
▁ይደረ	-3604
▁የቡና	-3605
መዝገብ	-3606
▁ተቀም	-3607
▁የህወሀት	-3608
ኖስ	-3609
▁በሚመለከት	-3610
ሬን	-3611
▁የጣ	-3612
▁የሀገር	-3613
▁ምስክ	-3614
▁ሲነ	-3615
▁ተልእ	-3616
▁ችግሩን	-3617
ህሳስ	-3618
ጠይቅ	-3619
▁ማመን	-3620
▁በተደረገው	-3621
▁እህ	-3622
ውውር	-3623
▁እራ	-3624
ረጋጋ	-3625
▁እጩ	-3626
es	-3627
▁ሰራተኛ	-3628
▁ለቀ	-3629
▁ህዳሴ	-3630
▁ስታዲ	-3631
▁በብዙ	-3632
▁ወንዶች	-3633
በት፣	-3634
▁ያለመ	-3635
▁ካልተ	-3636
▁የአካባቢ	-3637
16	-3638
▁የተባለ	-3639
ሰበው	-3640
ናገድ	-3641
መስረት	-3642
▁ታይ	-3643
እምሮ	-3644
▁ዳኛ	-3645
▁በእነዚህ	-3646
▁ቤተሰብ	-3647
ችውን	-3648
▁ያድር	-3649
▁መስክ	-3650
▁በን	-3651
በረሰቡ	-3652
▁የሚገኙት	-3653
▁የመላእክት	-3654
ገንዝ	-3655
▁ልኡ	-3656
ሆኑት	-3657
ፋቸው	-3658
ፍራሉ	-3659
ቆዩ	-3660
▁ታዋቂ	-3661
▁የተጣ	-3662
▁የግብፅ	-3663
▁የሚገ	-3664
ion	-3665
▁አሳይ	-3666
▁የሚወ	-3667
▁ግዴታ	-3668
ሙዩኒኬሽን	-3669
▁እቃዎች	-3670
▁የፊ	-3671
▁የሚሰሩ	-3672
▁የምርት	-3673
ይጣንም	-3674
▁«	-3675
ዥም	-3676
▁የፍትወት	-3677
ጀም	-3678
▁ራሳቸውን	-3679
▁የያዘ	-3680
▁ተይ	-3681
▁በዚ	-3682
▁ገደብ	-3683
▁ያሸንፋሉ	-3684
ካካ	-3685
▁ማየት	-3686
▁ዘርፉ	-3687
▁የሚያደርግ	-3688
▁ሀይሉ	-3689
▁ስኬ	-3690
▁በመል	-3691
ለትን	-3692
▁ተወስ	-3693
▁የእግር	-3694
▁ያውጃሉ	-3695
▁ብልጫ	-3696
▁ወንዝ	-3697
▁እነሱ	-3698
▁እንዳያ	-3699
ጠናቀቀ	-3700
▁በምን	-3701
ጎል	-3702
ድሮስ	-3703
▁የቀድሞው	-3704
▁ተሰማ	-3705
▁ተነግ	-3706
▁ይደፍራሉ	-3707
▁በሚገኙ	-3708
ጣቂ	-3709
▁መሆኑን፣	-3710
▁ኔፊ	-3711
▁እንዲቀ	-3712
▁ያሳያል	-3713
▁ለመጀመሪያ	-3714
▁ቅድሚያ	-3715
▁ኔፊሊሞች	-3716
▁አሸን	-3717
▁ለሰይጣንም	-3718
ሙና	-3719
ታወቅ	-3720
▁እያንዳንዱ	-3721
▁ሲያስ	-3722
▁እንዲያስ	-3723
▁ኦሮ	-3724
▁መቀመ	-3725
▁ትግል	-3726
ዳው	-3727
ሰለ	-3728
▁ክፍተት	-3729
ለመ	-3730
▁ክለቡ	-3731
▁በኋላም	-3732
▁ሁለቱም	-3733
▁አገልጋ	-3734
▁የህዝ	-3735
▁ነገሮችን	-3736
▁አክሲዮን	-3737
▁የጊዜ	-3738
▁ማዳ	-3739
▁ችግሩ	-3740
ልድ	-3741
▁ፀጋ	-3742
▁ምልክት	-3743
ሳው	-3744
ርነት	-3745
ic	-3746
▁በስፋት	-3747
ውሎስ	-3748
ኑት	-3749
▁ተሞ	-3750
▁ሀሳቦች	-3751
▁ብቸ	-3752
ፈፀመው	-3753
▁ሽማግሌ	-3754
▁እሁድ	-3755
▁መቻ	-3756
▁የመሳሰ	-3757
▁አፅ	-3758
▁ብርሀን	-3759
▁ለመመለስ	-3760
is	-3761
▁2007	-3762
▁የፌደራል	-3763
▁ሌሎችም	-3764
ሾቹ	-3765
▁70	-3766
▁አልባ	-3767
▁ሰሞኑን	-3768
▁ዴኤ	-3769
▁ህጉ	-3770
▁ማንም	-3771
▁በምት	-3772
▁በሶስት	-3773
ላካ	-3774
ኖሪያ	-3775
▁መስዋእ	-3776
▁ፈር	-3777
ቴን	-3778
▁ግንባር	-3779
ጠቅላላ	-3780
▁ሰጥቶ	-3781
ጋንዳ	-3782
,000	-3783
▁ታሪ	-3784
▁መኪና	-3785
▁አዘጋጅ	-3786
▁የተፈጥሮ	-3787
▁ይሰራ	-3788
▁መሳሪያዎች	-3789
▁ከላይ	-3790
▁ለአዲስ	-3791
▁ጉባኤው	-3792
ጎን	-3793
▁ሽልማት	-3794
▁ፕሮፌሰር	-3795
ከን	-3796
▁ለሁለት	-3797
▁ከሶስት	-3798
▁ክርክር	-3799
ንጀ	-3800
▁ጄኔራል	-3801
▁የሂሳብ	-3802
▁አንደ	-3803
▁የተሳ	-3804
ረግ	-3805
▁ዳግም	-3806
ጠንቀ	-3807
▁ሲዳማ	-3808
▁ትምህር	-3809
▁መደረጉን	-3810
▁ቀርቦ	-3811
▁ተልእኮ	-3812
ገዝ	-3813
ፕሎማሲ	-3814
▁አውጥ	-3815
▁ብለን	-3816
▁ታሪካዊ	-3817
▁ማሽ	-3818
▁የእርስ	-3819
ከፊ	-3820
▁P	-3821
ዮኖች	-3822
ስተካከል	-3823
▁ጠቅሰው	-3824
▁ትስስር	-3825
▁የሰጡት	-3826
ኤም	-3827
ዝነስ	-3828
ናቃ	-3829
ፃሜ	-3830
ቅናቄ	-3831
▁ሊጉ	-3832
it	-3833
▁ባለድርሻ	-3834
▁ለመቆጣጠር	-3835
▁ዘጠኝ	-3836
ፈቀደ	-3837
▁መኖር	-3838
▁እያስ	-3839
▁ተሽከርካሪዎች	-3840
▁ይሆን	-3841
ሞችን	-3842
ገለፅ	-3843
▁ማጥ	-3844
▁አምራ	-3845
▁ባህል	-3846
▁ምርምር	-3847
ህበራዊ	-3848
ቱና	-3849
ዋለሁ	-3850
▁ተመር	-3851
ናሉ	-3852
ኘው	-3853
ሮድካ	-3854
ፈለግ	-3855
▁አመልክቷል	-3856
▁ሆስፒታል	-3857
ካከ	-3858
▁መልእክ	-3859
▁ይጠቁ	-3860
80	-3861
▁ፉ	-3862
▁ዳንኤል	-3863
▁ንፁ	-3864
▁እዳ	-3865
▁የተሰጠው	-3866
▁ውይይ	-3867
▁ግለሰብ	-3868
▁ሀሙስ	-3869
▁የኦሮሞ	-3870
ቅረፍ	-3871
ያኑ	-3872
▁ኢህአዴግ	-3873
ምራት	-3874
▁ማህበር	-3875
ጋለ	-3876
▁M	-3877
▁የፌዴ	-3878
ፈረንሳይ	-3879
▁ተጨዋ	-3880
ሊት	-3881
▁የተመዘ	-3882
ደስ	-3883
ምቤ	-3884
▁በእው	-3885
▁አሰፋ	-3886
▁በድን	-3887
ከተለው	-3888
▁በአብዛኛው	-3889
▁ፓርክ	-3890
▁ፌዴሬሽን	-3891
▁የሆ	-3892
ቃሽ	-3893
▁ጥበብ	-3894
▁በሚያስ	-3895
▁ከኢ	-3896
ልኝ	-3897
ሏላዊ	-3898
▁ትኩስ	-3899
▁፡	-3900
ከም	-3901
▁አቀፉ	-3902
▁አገልግሎቶች	-3903
▁መባ	-3904
▁በማይ	-3905
▁ከኮ	-3906
▁ያገኘነው	-3907
▁ተነስ	-3908
ወዝ	-3909
▁በጥሩ	-3910
▁ግዛ	-3911
▁ህብረተሰቡ	-3912
ድና	-3913
▁ፋብሪካዎች	-3914
▁አዛ	-3915
ላለፉ	-3916
ዘቡ	-3917
▁ፅሁ	-3918
ፃፀር	-3919
▁ግራ	-3920
▁የአን	-3921
ሆንም	-3922
▁ትራምፕ	-3923
▁ድሬዳዋ	-3924
ስቡክ	-3925
▁የወጪ	-3926
▁ምስክር	-3927
ብሮ	-3928
▁ቦርዱ	-3929
▁ቁጥ	-3930
▁ሽያጭ	-3931
ቀቅ	-3932
ምሩክ	-3933
▁ሁል	-3934
▁አለመሆኑን	-3935
▁ኤርትራ	-3936
▁የሱዳን	-3937
ደቢት	-3938
▁እርሻ	-3939
▁ታዲያ	-3940
▁የሸ	-3941
▁ለት	-3942
▁ፍትሀዊ	-3943
▁እንዲያው	-3944
▁እንደሌለ	-3945
ጭነት	-3946
▁በሞ	-3947
▁በኮሮና	-3948
▁የተሰራ	-3949
ብብ	-3950
▁ያድርጉ	-3951
ባክ	-3952
▁በኦ	-3953
.2	-3954
ፎችን	-3955
▁https	-3956
ኡዲ	-3957
ብቅ	-3958
ንታል	-3959
▁ቁሳቁ	-3960
ከለኛ	-3961
▁ብዙም	-3962
መጥ	-3963
ንነት	-3964
▁ህል	-3965
▁እያሳ	-3966
▁ተጠርጣሪዎች	-3967
▁ጁ	-3968
ባባይ	-3969
ፈጠር	-3970
ዮሽ	-3971
▁እሱም	-3972
▁ከአለም	-3973
ናንተ	-3974
▁ጥፋት	-3975
▁ትውልድ	-3976
▁መስተዳድር	-3977
▁199	-3978
ጥረ	-3979
▁ተጠቁሟል	-3980
▁ሞት	-3981
▁[	-3982
▁ህዝባዊ	-3983
▁በተቃ	-3984
▁በመጥቀስ	-3985
▁መከራ	-3986
▁በቤ	-3987
2010	-3988
▁መረ	-3989
▁አጠ	-3990
ዟል	-3991
ርሶ	-3992
▁መምጣ	-3993
▁በመን	-3994
▁የኤርትራ	-3995
ችበት	-3996
▁በሜዳ	-3997
▁አክል	-3998
▁እንዲሰጥ	-3999
▁በአመት	-4000
ሸጋ	-4001
▁ኢንሹራንስ	-4002
ረፍ	-4003
▁ተቃዋሚ	-4004
ናብ	-4005
ሬድ	-4006
▁ወጥቶ	-4007
▁ካርድ	-4008
ማካይ	-4009
▁ዋናው	-4010
▁የሁለት	-4011
▁በባለ	-4012
▁ያስች	-4013
▁ግዙፍ	-4014
ትነት	-4015
▁የሚታወስ	-4016
ማስ	-4017
▁በእን	-4018
ላውያን	-4019
▁ግብረ	-4020
ራቱ	-4021
፱፻	-4022
▁በትክክል	-4023
▁አክልበ	-4024
ፈታ	-4025
ፐብ	-4026
▁ለሙሉ	-4027
▁የሚሆነው	-4028
ግበር	-4029
▁ርእስ	-4030
ነበረበት	-4031
ጠየቁ	-4032
ርሱ	-4033
ጠብቁ	-4034
ገናኙ	-4035
ረጋገጠ	-4036
▁ሰብስ	-4037
ጥፍ	-4038
▁የተጀመረው	-4039
ዎቻቸው	-4040
▁ከል	-4041
ያሜ	-4042
ውንም	-4043
▁ፍትህ	-4044
ለድ	-4045
ሉትን	-4046
▁እየጨመረ	-4047
ሴፍ	-4048
ቋሚ	-4049
▁በሰጠው	-4050
70	-4051
ገስ	-4052
▁ግምገማ	-4053
▁በተደረገ	-4054
ሙኤል	-4055
ሊያን	-4056
▁ማቅረ	-4057
ዞች	-4058
▁መዛ	-4059
▁ትራንስ	-4060
.3	-4061
ኛውንም	-4062
▁የሚች	-4063
▁ብት	-4064
.6	-4065
▁ሽን	-4066
▁ክፉ	-4067
/200	-4068
▁ሰይ	-4069
▁ጳውሎስ	-4070
መዝግ	-4071
▁አቡ	-4072
▁የአካል	-4073
th	-4074
ደበ	-4075
ገልገል	-4076
▁የሚቀ	-4077
▁አደሮች	-4078
▁እንዳልተ	-4079
▁የኢፌዴሪ	-4080
▁ይገልፃል	-4081
▁ጨዋታውን	-4082
▁የማያ	-4083
▁የሚሰጠው	-4084
▁አለቃ	-4085
▁አካሄድ	-4086
ጣው	-4087
ዩኒቨርሲቲ	-4088
▁ማሀበራዊ	-4089
ምፒክ	-4090
▁የድን	-4091
ቅድመ	-4092
▁ገለፁ	-4093
▁ደካ	-4094
▁የአስቸኳይ	-4095
የተ	-4096
▁ተካ	-4097
▁የማሀ	-4098
▁ማስከበር	-4099
▁ፈጠራ	-4100
▁አዲ	-4101
ሰባሰብ	-4102
▁በሰሜን	-4103
▁የጨዋታ	-4104
▁ሙስና	-4105
▁ውድቅ	-4106
ርና	-4107
ደራጀ	-4108
▁እንቅ	-4109
▁የሚያሳይ	-4110
ፋና	-4111
▁በቆ	-4112
ታችንን	-4113
▁ልማትና	-4114
▁ከነበረው	-4115
▁ያልሆነ	-4116
▁ኢንተርናሽናል	-4117
ነሱት	-4118
▁እንዲያደርጉ	-4119
▁የኢህአዴግ	-4120
ኩስ	-4121
ንዴ	-4122
▁ከግብ	-4123
▁የመስመር	-4124
ይይት	-4125
▁በአስ	-4126
▁በአንፃሩ	-4127
▁እንችላለ	-4128
ሳሽ	-4129
ጠየቅ	-4130
ፈለገው	-4131
▁ኖሮ	-4132
▁ሂሳብ	-4133
▁ብረት	-4134
በስ	-4135
▁በሚቀጥ	-4136
ክተሮች	-4137
የሩሳሌ	-4138
▁የቤ	-4139
▁በመስራት	-4140
▁አበበ	-4141
▁እስራኤል	-4142
▁የሀይማኖት	-4143
ያዛ	-4144
▁የስፖርት	-4145
▁60	-4146
▁ማረጋገጫ	-4147
▁አመለካከት	-4148
▁በመጀመሪያው	-4149
▁በሲ	-4150
▁ሶማ	-4151
▁ብሎም	-4152
▁እውነት	-4153
▁ባሉት	-4154
ሙር	-4155
▁በሰላም	-4156
▁ለሌሎች	-4157
▁ደንበኞች	-4158
▁የፈ	-4159
▁አክለው	-4160
ምም	-4161
ራቶ	-4162
▁በተሻለ	-4163
▁ኢንቨስት	-4164
▁ከዋ	-4165
▁ሽፋን	-4166
ነዋል	-4167
▁ምዝገባ	-4168
▁ፋይ	-4169
▁ሀላፊው	-4170
.7	-4171
ሎን	-4172
▁አስፈላጊውን	-4173
ጋቢ	-4174
▁መቼ	-4175
▁አቅርቧል	-4176
▁ካስ	-4177
ዩም	-4178
ገዳ	-4179
▁ኮንስትራክሽን	-4180
▁T	-4181
▁ይጠቀ	-4182
▁የጠቆሙት	-4183
▁ቀጥሎ	-4184
▁እንዲሁ	-4185
▁ስላል	-4186
▁ክፍት	-4187
▁ይሰማ	-4188
▁ከተማን	-4189
ጠቀሰው	-4190
▁ተደራሽ	-4191
ደቀ	-4192
▁ካም	-4193
▁እነሱም	-4194
▁ጣልቃ	-4195
▁ግብይት	-4196
▁ጉዳዮችን	-4197
▁የበጀት	-4198
ደረሰው	-4199
▁በቅርብ	-4200
▁በባህር	-4201
ዘረ	-4202
▁ይደረጋል	-4203
ቁን	-4204
▁ፋይናንስ	-4205
ፅና	-4206
▁በጠቅላይ	-4207
▁ኒ	-4208
▁አዝ	-4209
▁አንስተዋል	-4210
▁እንደሚደረግ	-4211
ቶቹን	-4212
▁እንችላለን	-4213
ቸዉ	-4214
ንቅ	-4215
ገዙ	-4216
ገኙበት	-4217
▁ማግኘ	-4218
▁የሌለው	-4219
▁በርስ	-4220
▁እድገ	-4221
▁ቤቱን	-4222
▁መቅረ	-4223
▁ብሩ	-4224
▁ግቦች	-4225
▁የምስ	-4226
▁የኮን	-4227
▁ከሜዳ	-4228
▁ስለሚያ	-4229
▁አስታውሰዋል	-4230
ዬን	-4231
▁እንዲደረግ	-4232
መልስ	-4233
ጨምር	-4234
▁ግብርና	-4235
▁ተወዳዳሪ	-4236
▁ስታዲየም	-4237
ፐር	-4238
▁በዘርፉ	-4239
▁የቀረበው	-4240
ሪን	-4241
▁ፀረ	-4242
▁ስለመሆኑ	-4243
▁ባለስልጣኑ	-4244
▁እንደሚሰራ	-4245
▁ለውጭ	-4246
▁ብሮድካ	-4247
▁አስረድቷል	-4248
▁ስፖር	-4249
▁የብር	-4250
ሆዋ	-4251
▁ቻናል	-4252
▁በንግድ	-4253
▁እርምጃዎች	-4254
fan	-4255
▁እግ	-4256
▁አሀ	-4257
▁ንቅናቄ	-4258
▁ልደ	-4259
▁ነጥቦች	-4260
▁የሚገኘውን	-4261
ሟሉ	-4262
▁ሀብታ	-4263
ያዝያ	-4264
▁ሰል	-4265
ላቸውም	-4266
ድም	-4267
ጉት	-4268
100	-4269
▁ይረዳ	-4270
ንዱ	-4271
▁የቦርድ	-4272
▁ባሳ	-4273
▁ለመቀነስ	-4274
ለየት	-4275
▁እንደሚቻል	-4276
ደሪያ	-4277
▁ክልላዊ	-4278
▁እርግ	-4279
▁ሲነፃፀር	-4280
ነበ	-4281
ላለም	-4282
▁አንደኛ	-4283
▁ይሰጣል	-4284
ሻው	-4285
▁የመረጃ	-4286
ሻንጉ	-4287
▁ለማስተ	-4288
ጠራው	-4289
▁ጠይቋል	-4290
ou	-4291
▁ከባለ	-4292
▁ተነግሯል	-4293
.4	-4294
ህነት	-4295
▁ደርሷል	-4296
ጅማ	-4297
▁ለሌ	-4298
▁የማድረግ	-4299
▁ራስ	-4300
▁በተለየ	-4301
▁ተጫዋቾችን	-4302
.8	-4303
ጋይ	-4304
▁የላ	-4305
▁በሚገባ	-4306
▁ያን	-4307
▁ዘይት	-4308
▁ኤምባሲ	-4309
▁አብዛኞቹ	-4310
ኖቹ	-4311
ራጮች	-4312
▁ያቀ	-4313
▁ተጨ	-4314
▁መሆኑንና	-4315
ዝርዝር	-4316
ባጭ	-4317
ቁም	-4318
ቫይረስ	-4319
ትናንት	-4320
▁ግድያ	-4321
ሊሲ	-4322
▁ግር	-4323
ኩባንያው	-4324
▁አስተሳሰብ	-4325
▁መግባት	-4326
▁በፋ	-4327
ደንት	-4328
▁የአገልግሎት	-4329
ማጭ	-4330
ባበሩት	-4331
ክሲዮን	-4332
ሮጀክ	-4333
ናገረው	-4334
▁ማሳያ	-4335
▁ስያሜ	-4336
▁ብሄረሰቦች	-4337
▁መሰብ	-4338
▁እንዲያገኙ	-4339
▁ቫይረሱ	-4340
▁ብልፅግና	-4341
▁ያስረዳል	-4342
▁መንገዱ	-4343
ጎዳ	-4344
▁በሂ	-4345
▁በህይወት	-4346
ቢኔ	-4347
ፌስቡክ	-4348
▁የሚደረገው	-4349
ህዴ	-4350
▁በእለቱ	-4351
▁ቡድኑን	-4352
▁ችለዋል	-4353
ዋር	-4354
▁የሚሸ	-4355
▁የለውም	-4356
▁ማረጋገጥ	-4357
ክብ	-4358
ስኮ	-4359
▁መሆኗ	-4360
▁ሳይንስ	-4361
ዎስ	-4362
ማሪዎች	-4363
ባን	-4364
ጄሪያ	-4365
2009	-4366
ከታተል	-4367
ከሰቱ	-4368
ወሰደ	-4369
▁2014	-4370
▁በጉዳዩ	-4371
ደቅ	-4372
▁በማስተ	-4373
▁አስተዳደ	-4374
ራቅ	-4375
ለጋ	-4376
▁ማወቅ	-4377
ቸውም	-4378
▁መቀመጫ	-4379
ዊው	-4380
ኒስቴ	-4381
▁ማእከላዊ	-4382
▁የሚፈልጉ	-4383
24	-4384
ባረ	-4385
▁ለነ	-4386
▁የገባ	-4387
ራጭ	-4388
ኡስ	-4389
ምቤላ	-4390
ቀጠል	-4391
▁ታጣቂ	-4392
▁በጨዋታው	-4393
▁ተመልክቷል	-4394
▁ቁልፍ	-4395
▁የቆየው	-4396
ግራም	-4397
ግስት	-4398
▁ያለፈ	-4399
▁B	-4400
▁መለስ	-4401
ኤላውያን	-4402
▁ፋሲል	-4403
▁ተጠናቋል	-4404
▁የሴ	-4405
▁አልነበረም	-4406
▁ሀዳር	-4407
▁ለማካሄድ	-4408
ስቲክስ	-4409
▁ታሀሳስ	-4410
▁እንቅስቃሴዎች	-4411
ከሰት	-4412
▁ዘው	-4413
▁ተቆጣ	-4414
▁500	-4415
ረኛ	-4416
▁የሚከተ	-4417
▁ጋዜጣዊ	-4418
▁በየጊዜው	-4419
▁እያንዳን	-4420
ያሉ	-4421
▁ሳሙኤል	-4422
ሮን	-4423
ተገ	-4424
ጫወቱ	-4425
ሶማሊያ	-4426
▁መጥፎ	-4427
/2012	-4428
▁አስተላል	-4429
▁እውነተኛ	-4430
ገሉ	-4431
▁ማድረጉን	-4432
▁ጠቀ	-4433
ለቅ	-4434
ጠበቁ	-4435
ገነባው	-4436
መንግስት	-4437
▁በመያዝ	-4438
ናቱ	-4439
▁መስፈር	-4440
▁ፓርላማ	-4441
▁አስተባባሪ	-4442
ሳች	-4443
▁የሚሆኑት	-4444
መታት	-4445
▁እንደሚያስፈልግ	-4446
▁ወላይታ	-4447
▁ስለነበር	-4448
▁እንደሚያደርግ	-4449
▁ለራ	-4450
▁ኤክስ	-4451
ነገረ	-4452
▁ከኤ	-4453
▁ሳይሆን፣	-4454
▁ኢንስቲት	-4455
▁ምስክሮች	-4456
▁በአንዳንድ	-4457
▁35	-4458
ገጥ	-4459
▁ወሰ	-4460
ረዳው	-4461
▁ሏላዊ	-4462
▁በቀን	-4463
▁አምራች	-4464
▁የሚያስችሉ	-4465
▁በብዛት	-4466
▁የአካባቢው	-4467
ቃቂ	-4468
▁ምሽት	-4469
▁ወልደ	-4470
ነቅ	-4471
▁የሚጠበቅ	-4472
ጦታ	-4473
▁አርባ	-4474
▁አዳነ	-4475
▁እውቀት	-4476
▁የመሰረተ	-4477
▁አለመግባ	-4478
▁ወረዳዎች	-4479
21	-4480
▁ተነሳ	-4481
ቻለሁ	-4482
ገለግሉ	-4483
▁በሰው	-4484
ችሉም	-4485
-19	-4486
▁ለማጠናከር	-4487
ረበ	-4488
ጠለ	-4489
▁የሩ	-4490
▁በአዲሱ	-4491
▁ደጋፊዎች	-4492
▁የኮሚ	-4493
▁ደካማ	-4494
▁ከአገር	-4495
▁አሰጣጥ	-4496
▁ወታደሮች	-4497
ፕራይ	-4498
▁አውቶ	-4499
ፍቶ	-4500
ያስፖ	-4501
▁በመግባት	-4502
▁የመገናኛ	-4503
▁በፈ	-4504
▁የሚያደር	-4505
ወሰድ	-4506
ላንት	-4507
▁ወደብ	-4508
ይሮ	-4509
ing	-4510
ሸት	-4511
▁ጣቢያዎች	-4512
▁ለመንግስት	-4513
▁የህገ	-4514
▁የተፈጠረ	-4515
▁አውሮፕላን	-4516
▁ነን	-4517
ሻንጉል	-4518
▁ታማኝ	-4519
ate	-4520
ብነት	-4521
▁የሚሰጡ	-4522
▁እግርኳስ	-4523
▁አስራ	-4524
▁ከጊዜ	-4525
▁ባልተ	-4526
▁ይበ	-4527
ረፈ	-4528
▁ፔ	-4529
▁አብረው	-4530
▁የኢትዮ	-4531
www	-4532
ፈቀድ	-4533
▁ለታ	-4534
▁ማይ	-4535
ስተናግ	-4536
▁እየሰሩ	-4537
▁ስደተኞች	-4538
▁ማቀ	-4539
▁ውጤቶች	-4540
2008	-4541
▁የሚችለው	-4542
▁መና	-4543
▁ሙያ	-4544
▁ቴሌቪዥን	-4545
▁ተሰጥቶ	-4546
▁አቀባይ	-4547
ቲን	-4548
▁ሆና	-4549
▁በመቀጠል	-4550
ተኩ	-4551
▁ህወሀት	-4552
▁ወደሚ	-4553
▁ሀይማኖ	-4554
▁የሽብር	-4555
ናትን	-4556
▁የቴክኒክ	-4557
▁መሬ	-4558
ሬዚዳንት	-4559
ጆቹ	-4560
▁በግል	-4561
ሀይ	-4562
▁ማኔ	-4563
ሰብሰብ	-4564
▁መላኩ	-4565
ኒስትሮች	-4566
22	-4567
▁የጀመረው	-4568
ቡእ	-4569
ሳራ	-4570
ጓዴ	-4571
ፍያ	-4572
▁ኮሪያ	-4573
ሰልጣኝ	-4574
▁ሲሆን፥	-4575
▁ይኸውም	-4576
▁R	-4577
ንስት	-4578
▁ተሻ	-4579
▁የጋ	-4580
▁ግድቡ	-4581
▁ጥረ	-4582
▁ያቀረቡት	-4583
▁ተሽከርካሪ	-4584
▁ታህሳስ	-4585
ክርስቲ	-4586
▁በሀገር	-4587
▁ክፍተ	-4588
ሺህ	-4589
▁የሚገቡ	-4590
▁እንደነበረ	-4591
▁መጠበቅ	-4592
▁የተወሰኑ	-4593
▁ማቴ	-4594
▁በፊ	-4595
▁ፕሬዚዳንቱ	-4596
ዘግ	-4597
▁ለማምጣት	-4598
▁ጠቀሜ	-4599
▁በግንባ	-4600
▁ሰልፍ	-4601
▁ሰሜን	-4602
ራችን	-4603
▁መገደ	-4604
▁አስደናቂ	-4605
▁ማድረጉ	-4606
ሪሚ	-4607
ቆሙ	-4608
ችት	-4609
ከው	-4610
▁ተደ	-4611
▁ተሞክሮ	-4612
ጥቅ	-4613
ባይል	-4614
▁መሰረት፣	-4615
ወሰኑ	-4616
▁በዩ	-4617
▁ለማየት	-4618
ታወቀው	-4619
▁አስቆጥ	-4620
▁ሆኑ	-4621
ረንጓዴ	-4622
▁በማሰብ	-4623
▁መቐለ	-4624
▁በመተባበር	-4625
▁የበላይነት	-4626
▁F	-4627
▁በትምህርት	-4628
ነሳት	-4629
▁ሚኒስቴሩ	-4630
▁በራሳቸው	-4631
▁ያስረዳሉ	-4632
ሁት	-4633
ሆና	-4634
ንጋ	-4635
ዘነጋ	-4636
▁ኋላ	-4637
▁አምና	-4638
ፈለገ	-4639
▁ዲግ	-4640
▁ጥፋ	-4641
▁ህጎች	-4642
▁በጊዜ	-4643
▁ያልሆኑ	-4644
ማው	-4645
በሳ	-4646
▁እናም	-4647
ሪነት	-4648
▁ሚስተር	-4649
ይዝ	-4650
▁ክብ	-4651
ከፈል	-4652
ምምነት	-4653
▁ምእራብ	-4654
▁በሆነው	-4655
▁ተፈጥሮ	-4656
▁ውስጥም	-4657
ሪታ	-4658
ገጠ	-4659
ንድሮው	-4660
▁በመግ	-4661
ንቀሳቃሽ	-4662
▁ትግራይ	-4663
▁በከተማዋ	-4664
ወሰዱ	-4665
▁መዳረ	-4666
▁ጊዜያዊ	-4667
▁በመፍጠር	-4668
▁አንድም	-4669
ጠንቀቂያ	-4670
▁ትግ	-4671
▁ማእቀ	-4672
ገዱ	-4673
ስተናገ	-4674
▁በስልክ	-4675
ዋሎ	-4676
ጠባ	-4677
ንግተን	-4678
▁በብሄራዊ	-4679
▁ኩንታል	-4680
▁ተከላካይ	-4681
▁ሀያ	-4682
▁ሀጢ	-4683
▁መውሰድ	-4684
▁ካለፈው	-4685
ዲና	-4686
ፋስ	-4687
▁አታ	-4688
▁በቫይረሱ	-4689
.9	-4690
▁ለመቅረፍ	-4691
አን	-4692
▁ለሁሉም	-4693
▁አብርሀም	-4694
▁የመፅሀፍ	-4695
የትኛውም	-4696
ኳን	-4697
ውሉ	-4698
▁ተጠቅሷል	-4699
▁በመላው	-4700
▁እንዲሰጡ	-4701
▁ፍጥነት	-4702
ስፋፋ	-4703
ስቲንግ	-4704
ጠናቀቀው	-4705
ብረቱ	-4706
▁ልት	-4707
▁ጓደ	-4708
▁ህዳር	-4709
▁ተቋሙ	-4710
▁ለመጠቀም	-4711
▁ነጋዴዎች	-4712
▁እል	-4713
▁ይመ	-4714
▁ስኳር	-4715
▁እውን	-4716
ህም	-4717
▁ቤቶችን	-4718
▁ሳለ	-4719
▁የበኩ	-4720
ማዊ	-4721
▁ቃለ	-4722
ገኘት	-4723
▁ተካሂ	-4724
▁መግባባት	-4725
ቆጣጠ	-4726
▁የውሳኔ	-4727
አል	-4728
▁አና	-4729
▁ጠበ	-4730
▁የሴቶች	-4731
▁መስፈ	-4732
▁ቢኖር	-4733
ላስ	-4734
▁ማው	-4735
▁ይገኙ	-4736
ናዳ	-4737
ፈተ	-4738
ድድሩ	-4739
▁የቡድኑ	-4740
ወርቅ	-4741
ር፣	-4742
ኑኤል	-4743
ጠበቀው	-4744
▁ለመግባት	-4745
▁የረ	-4746
▁ከስራ	-4747
ባኤው	-4748
▁ተወያይ	-4749
ፎካካ	-4750
▁ለማን	-4751
▁ግብአ	-4752
▁ቸ	-4753
▁የኪ	-4754
▁ክርስቶስ	-4755
▁ከጎ	-4756
▁የተሰማሩ	-4757
ምረቻ	-4758
ንታዊ	-4759
▁ቱሪዝም	-4760
መኑ	-4761
▁የስልጣን	-4762
ልተኛ	-4763
▁ተሾ	-4764
▁አሊ	-4765
▁ምስጋና	-4766
ፍል	-4767
▁ራሱ	-4768
▁ለአገር	-4769
▁ዲዛ	-4770
▁ፀጥታ	-4771
▁ስብስብ	-4772
ወሩ	-4773
▁ፈቃደኛ	-4774
▁የማእድን	-4775
ጨረታ	-4776
▁ማረፊያ	-4777
ከበረ	-4778
▁ከነማ	-4779
▁ለአለም	-4780
ደርጉት	-4781
▁ምልክ	-4782
▁አደራ	-4783
▁መድረሱን	-4784
ዳሪዎች	-4785
▁መኖሩን	-4786
▁በረከት	-4787
▁ባለበት	-4788
▁ለሶ	-4789
ክፈል	-4790
▁መፃህ	-4791
▁ቴዎ	-4792
▁እንዲሰሩ	-4793
ያያ	-4794
▁ደርሶ	-4795
▁ፎቶ	-4796
▁መዝገብ	-4797
▁በዝርዝር	-4798
▁የሚያስች	-4799
ኩረት	-4800
▁አባት	-4801
▁ኢንጂነር	-4802
ራፊክ	-4803
ደረሱ	-4804
▁የሳይ	-4805
▁ምድ	-4806
ድየም	-4807
▁እኔም	-4808
▁የአል	-4809
▁በተቀ	-4810
▁ሽብር	-4811
▁ግንባታው	-4812
▁መዋቅር	-4813
▁አምራቾች	-4814
▁አስገንዝ	-4815
ኮት	-4816
▁ጠቁሟል	-4817
▁ማንኛውንም	-4818
