[UNK]	0
[PAD]	0
[SOS]	0
[EOS]	0
▁የ	-0
▁አ	-1
▁በ	-2
▁እ	-3
▁መ	-4
▁ከ	-5
▁እን	-6
▁ነ	-7
▁ለ	-8
▁ተ	-9
▁ይ	-10
ቸው	-11
▁ወ	-12
▁ያ	-13
▁ስ	-14
▁የሚ	-15
▁ም	-16
▁ማ	-17
▁ነው	-18
▁ብ	-19
ላይ	-20
▁ሰ	-21
ዎች	-22
ነት	-23
▁የተ	-24
▁እንደ	-25
▁ግ	-26
▁ው	-27
▁ላይ	-28
▁ባ	-29
▁ሀ	-30
▁ደ	-31
▁ሲ	-32
ችን	-33
ለው	-34
ስት	-35
▁ት	-36
▁ህ	-37
▁እና	-38
ንድ	-39
▁በመ	-40
▁ጥ	-41
▁አስ	-42
በት	-43
▁የአ	-44
▁በአ	-45
ዋል	-46
▁እንዲ	-47
ኢት	-48
ገር	-49
▁ል	-50
ውን	-51
ንግ	-52
ኢትዮ	-53
▁ድ	-54
በር	-55
▁ክ	-56
▁ቀ	-57
▁ገ	-58
▁ሁ	-59
ሆን	-60
▁አይ	-61
ጵያ	-62
ኢትዮጵያ	-63
ሆነ	-64
ዚህ	-65
▁የመ	-66
▁በተ	-67
▁ቤ	-68
▁ዘ	-69
ቶች	-70
ደረ	-71
ሆኑ	-72
ደር	-73
ለም	-74
▁ለመ	-75
▁ወደ	-76
▁ጋ	-77
ለት	-78
ስጥ	-79
▁ታ	-80
▁ለማ	-81
▁አመ	-82
▁አን	-83
▁ሚ	-84
▁ግን	-85
▁ቢ	-86
ቸውን	-87
▁እየ	-88
▁ሊ	-89
▁ጉ	-90
▁ሳ	-91
ንም	-92
▁ውስጥ	-93
ሪያ	-94
▁በማ	-95
ጊዜ	-96
▁ጠ	-97
▁የሚያ	-98
ተኛ	-99
▁ይህ	-100
▁ስለ	-101
▁ካ	-102
ትን	-103
▁ጋር	-104
በረ	-105
▁አለ	-106
▁የም	-107
▁ፍ	-108
▁ነበር	-109
ራት	-110
▁ጊዜ	-111
ድር	-112
ረት	-113
▁ከተ	-114
▁ባለ	-115
▁ኢ	-116
ንግስት	-117
▁እንዳ	-118
▁እንደሚ	-119
▁የማ	-120
ርት	-121
▁እስ	-122
ያን	-123
▁ቅ	-124
ሁን	-125
ገባ	-126
ስተ	-127
▁አል	-128
▁ምክ	-129
▁አንድ	-130
ድረ	-131
▁በሚ	-132
ንት	-133
ላል	-134
ዲስ	-135
▁ህዝ	-136
ንያ	-137
ሮች	-138
▁ኢትዮጵያ	-139
▁ስራ	-140
▁ምን	-141
ቱን	-142
ናል	-143
▁መን	-144
ሰብ	-145
▁ቤት	-146
▁ና	-147
▁አገ	-148
▁ፈ	-149
▁ነገር	-150
▁ሌ	-151
▁ጉዳ	-152
ራዊ	-153
ሎች	-154
▁ሆ	-155
▁መስ	-156
ሪካ	-157
ጀመ	-158
ረጃ	-159
▁ሰው	-160
▁ኮ	-161
▁ሁሉ	-162
▁ወይ	-163
▁እያ	-164
▁የነ	-165
ርስ	-166
ላቸው	-167
▁ን	-168
ችሁ	-169
▁ሰዎች	-170
▁ዋ	-171
▁የእ	-172
▁ች	-173
መለ	-174
▁መንግስት	-175
▁አም	-176
▁ያለ	-177
▁አብ	-178
▁አስተ	-179
▁ፕ	-180
▁በእ	-181
▁የሰ	-182
▁ድር	-183
▁ደግ	-184
▁ብቻ	-185
▁መል	-186
ገድ	-187
ትና	-188
ታል	-189
▁አባ	-190
ረው	-191
▁አካ	-192
▁ሙ	-193
▁ከአ	-194
▁አበ	-195
ለን	-196
ቅር	-197
ግባ	-198
▁ደግሞ	-199
ታት	-200
ፈል	-201
ከል	-202
▁ሳይ	-203
መን	-204
ማሪ	-205
▁ሀይ	-206
▁የህ	-207
▁ኤ	-208
ግር	-209
▁አቶ	-210
▁ያለው	-211
▁ቁ	-212
▁ር	-213
ኛው	-214
ታወ	-215
▁እየተ	-216
ሉት	-217
ብር	-218
ላት	-219
▁ከመ	-220
▁የኢትዮጵያ	-221
▁መሆኑ	-222
ለሁ	-223
ባቸው	-224
ሰራ	-225
▁ምክንያ	-226
ልጣ	-227
▁ዝ	-228
ከተ	-229
ኋላ	-230
ማራ	-231
▁ዶ	-232
ምን	-233
▁ህዝብ	-234
▁ቀን	-235
ዛሬ	-236
ስራ	-237
ፊት	-238
ግራ	-239
ኞች	-240
ታው	-241
ታቸው	-242
▁አመት	-243
ናት	-244
በሩ	-245
▁የወ	-246
ዳን	-247
ዎችን	-248
▁ስር	-249
▁መሰ	-250
▁እር	-251
ምህ	-252
ረስ	-253
ደረገ	-254
▁እነ	-255
▁ብዙ	-256
ሚያ	-257
ድረግ	-258
▁በዚህ	-259
▁ጀ	-260
▁አበባ	-261
▁በላይ	-262
አት	-263
▁ከፍ	-264
ተር	-265
ገኘ	-266
ተው	-267
ማት	-268
▁ጨ	-269
▁ቦ	-270
ቀር	-271
ለያ	-272
ልል	-273
ጠና	-274
▁ወይም	-275
▁የት	-276
▁በኋላ	-277
▁ሚኒ	-278
▁አይደ	-279
ባቢ	-280
ጥር	-281
ንስ	-282
ቅም	-283
▁ክፍ	-284
ራል	-285
▁ብር	-286
ለቲ	-287
ድን	-288
ቦች	-289
የት	-290
▁ፓ	-291
▁ፖ	-292
▁ሆነ	-293
ገኙ	-294
▁ምር	-295
▁ናቸው	-296
▁አዲስ	-297
▁ይህን	-298
▁ዳ	-299
ኔታ	-300
▁ከተማ	-301
ከት	-302
ረዳ	-303
ነው	-304
▁ዜ	-305
▁ኦ	-306
▁ያስ	-307
መስ	-308
ልም	-309
▁ለአ	-310
ታዊ	-311
▁ሁኔታ	-312
ጠቀ	-313
▁ራ	-314
▁ፅ	-315
ኖር	-316
ገን	-317
▁ቡ	-318
ገለ	-319
▁ማስ	-320
▁እስከ	-321
ብረ	-322
ይወ	-323
ምሮ	-324
▁ሲሆን	-325
▁እኔ	-326
ባት	-327
ያስ	-328
ያው	-329
ለቲካ	-330
▁አድር	-331
ጠር	-332
ዮን	-333
መል	-334
▁አሁን	-335
ቃል	-336
ሽን	-337
ገራ	-338
ጣት	-339
ላለ	-340
▁ጎ	-341
ገል	-342
ዎቹ	-343
ርቲ	-344
▁ቆ	-345
▁የሆነ	-346
ሄር	-347
▁የሀ	-348
ረጋ	-349
ላም	-350
▁መሆኑን	-351
ነሳ	-352
▁በሰ	-353
▁ምክንያት	-354
▁እንዴ	-355
▁ማን	-356
ጣም	-357
ርድ	-358
▁ዛሬ	-359
ቀረ	-360
▁መንገድ	-361
ቷል	-362
▁ድርጅ	-363
ህል	-364
▁አው	-365
▁ጉዳይ	-366
▁አላ	-367
▁የግ	-368
▁መካ	-369
▁ብሎ	-370
▁ሆኖ	-371
ከላ	-372
▁ሞ	-373
ብት	-374
▁ሺ	-375
ላክ	-376
▁እድ	-377
ያቄ	-378
▁አደ	-379
▁ክልል	-380
ይት	-381
ምር	-382
▁ሽ	-383
ባል	-384
▁ማለት	-385
መራ	-386
ሎት	-387
▁አይደለም	-388
▁እው	-389
▁ቤተ	-390
▁ሌላ	-391
▁በቀ	-392
▁እንጂ	-393
ቢያ	-394
▁ከፍተኛ	-395
ጠበ	-396
ክት	-397
▁ስም	-398
▁እንዲሁ	-399
ክል	-400
▁ጥያቄ	-401
▁ያል	-402
ሪክ	-403
ሳይ	-404
▁ሴ	-405
▁አገል	-406
ምህርት	-407
▁የው	-408
ለች	-409
ዘጋ	-410
▁ሶ	-411
▁በህ	-412
▁ይሆ	-413
▁ወቅ	-414
ሩት	-415
ሰማ	-416
▁ከዚህ	-417
ልቅ	-418
ካሄ	-419
ለያዩ	-420
▁የነበረ	-421
ዚያ	-422
▁በር	-423
ግለ	-424
ገኝ	-425
▁የስ	-426
መድ	-427
ተዋል	-428
ቀው	-429
ሪዎች	-430
▁ይች	-431
▁ነገ	-432
▁ከእ	-433
ኖች	-434
ኛል	-435
ጦር	-436
▁በጣም	-437
ላፊ	-438
▁ሚኒስት	-439
ውያን	-440
ሰው	-441
ዮች	-442
▁ፀ	-443
▁ተጠ	-444
▁ደረጃ	-445
ፈው	-446
▁እንደሆነ	-447
መር	-448
ወጣ	-449
ሳት	-450
ደው	-451
▁ጠቅ	-452
▁አለም	-453
▁የኢ	-454
ታችን	-455
ችል	-456
ፍሪካ	-457
▁በፊት	-458
ስፋ	-459
▁እንዲህ	-460
▁ተወ	-461
▁እንኳ	-462
▁ፕሮ	-463
በል	-464
▁እንዲሁም	-465
ኝነት	-466
▁ተና	-467
▁መካከል	-468
▁ገል	-469
ለዋል	-470
▁በሀ	-471
ጠው	-472
ማር	-473
ገና	-474
ሊዮን	-475
ዘብ	-476
ንግስ	-477
▁ጭ	-478
▁ላ	-479
መው	-480
ገው	-481
▁አሳ	-482
▁አቀ	-483
ሱን	-484
ጀመሪያ	-485
▁አካባቢ	-486
▁በም	-487
▁አገልግ	-488
ቶችን	-489
ወሰ	-490
ፍት	-491
ሜሪካ	-492
▁ምንም	-493
▁መረጃ	-494
▁የበ	-495
▁በኢትዮጵያ	-496
ፈፀ	-497
▁ቦታ	-498
ሩን	-499
መጣ	-500
▁የሚያስ	-501
▁በየ	-502
▁ተብ	-503
▁ወን	-504
ፅሀ	-505
▁አይነት	-506
ግራይ	-507
▁ችግር	-508
ብሄር	-509
ታቸውን	-510
ርስቲ	-511
▁የታ	-512
ህን	-513
ምና	-514
▁በግ	-515
▁ሀላፊ	-516
ሀት	-517
ንተ	-518
ቱም	-519
▁መጠ	-520
ላሉ	-521
ጨማሪ	-522
▁አር	-523
ሏል	-524
ሉም	-525
ጆች	-526
▁በስ	-527
በው	-528
▁ተቋ	-529
▁ፓርቲ	-530
▁ቢሆን	-531
ገሪ	-532
ንና	-533
ኩል	-534
ሞክ	-535
▁ህይወ	-536
▁አመታት	-537
▁ሀሳ	-538
ኦሮ	-539
▁ይሄ	-540
ሰባ	-541
▁ወቅት	-542
ቸዋል	-543
▁ሁለት	-544
▁ዲ	-545
ንን	-546
ደም	-547
ጨረ	-548
▁ፕሬ	-549
▁ከሚ	-550
ዝብ	-551
▁ተቀ	-552
ለይ	-553
▁እንዴት	-554
▁በወ	-555
▁ሀገር	-556
ባለ	-557
▁የማይ	-558
▁የሚል	-559
ደረጉ	-560
▁ድረስ	-561
▁ዋና	-562
▁በት	-563
▁ልጅ	-564
▁ሳይሆን	-565
▁ረ	-566
የር	-567
▁ሲያ	-568
ነበረ	-569
▁አት	-570
ልጣን	-571
ረዋል	-572
ናገ	-573
▁ሜ	-574
▁ኩ	-575
▁ልዩ	-576
▁ተከ	-577
▁እኛ	-578
▁መሰረት	-579
▁ወር	-580
▁ኢን	-581
ግዚ	-582
ቤት	-583
▁በደ	-584
▁አገር	-585
ምነት	-586
▁ዘር	-587
ከር	-588
ዶች	-589
▁ሌሎች	-590
▁የቀ	-591
ፖለቲካ	-592
ርያ	-593
ልን	-594
ዱስ	-595
ባይ	-596
▁መንግስ	-597
▁ኮሚ	-598
ቀት	-599
▁አማራ	-600
▁ያሉ	-601
▁እጅ	-602
ግና	-603
▁ቁጥር	-604
ፋት	-605
▁ዩ	-606
ጤና	-607
▁ቴ	-608
ክር	-609
▁ባን	-610
▁ፋ	-611
ግብ	-612
ዳደር	-613
▁ብሄ	-614
ሆና	-615
ሞች	-616
▁እንዲያ	-617
ረን	-618
▁ከማ	-619
ግዚአ	-620
ቃት	-621
▁መር	-622
▁ምስ	-623
ፅሀፍ	-624
ልክ	-625
▁ማህ	-626
▁ድን	-627
ግዚአብሄር	-628
▁ያህል	-629
ረብ	-630
ዲያ	-631
▁ነፃ	-632
▁ሂ	-633
ክስ	-634
ራቸው	-635
ኤል	-636
ልፅ	-637
ፈለ	-638
ግኘ	-639
▁ሀይል	-640
ራሲ	-641
▁በመሆኑ	-642
ቻችን	-643
ነቱ	-644
▁እነዚህ	-645
▁መግለ	-646
▁ሺህ	-647
▁የባ	-648
ጡት	-649
ፈጠ	-650
ብረት	-651
ደት	-652
▁የምት	-653
▁ተናግ	-654
▁አድ	-655
▁ተግባ	-656
ሬት	-657
▁ጠቅላይ	-658
▁ውጤ	-659
▁ይችላል	-660
ገኘው	-661
▁ሚኒስትር	-662
▁በተለይ	-663
▁አንዱ	-664
መሰ	-665
▁ለው	-666
▁ሱ	-667
▁ችግ	-668
▁ጣ	-669
▁ንግ	-670
▁ትምህርት	-671
▁ይሁን	-672
▁እንዳይ	-673
▁ዘመን	-674
▁ለእ	-675
መረ	-676
▁በሌ	-677
▁እንደተ	-678
ካታ	-679
▁ምክር	-680
ንዳ	-681
ቸዉ	-682
ገደ	-683
▁ለሚ	-684
▁ስብ	-685
ያዊ	-686
▁ብለዋል	-687
▁አያ	-688
▁በጥ	-689
▁እንኳን	-690
▁አሰ	-691
ነስ	-692
▁ኪ	-693
▁አሉ	-694
▁ምርጫ	-695
ቋል	-696
▁ከሆነ	-697
▁ቅዱስ	-698
ገሪቱ	-699
ዳር	-700
▁ህግ	-701
▁የተባ	-702
▁የዘ	-703
▁የተሰ	-704
▁ገልፀ	-705
▁ሀገ	-706
▁ጥሩ	-707
ፖርት	-708
▁ዜና	-709
▁ሁለ	-710
▁ገን	-711
ውል	-712
▁ባህ	-713
▁ሙሉ	-714
ፉት	-715
▁አገልግሎት	-716
▁የለም	-717
▁ጦር	-718
ታይ	-719
ጨረሻ	-720
ገቡ	-721
▁ሪ	-722
▁ሊያ	-723
ገነ	-724
ካም	-725
▁መቀ	-726
ሰቡ	-727
ጋል	-728
▁ለተ	-729
▁የደ	-730
ብን	-731
▁ድርጅት	-732
ያኔ	-733
ንቀ	-734
▁ኛ	-735
▁ለም	-736
ሉን	-737
ጋት	-738
▁ክፍል	-739
ወሀት	-740
▁ማድረግ	-741
▁በማለት	-742
▁ፖሊ	-743
▁ሚሊዮን	-744
ተን	-745
ላችሁ	-746
▁ግድ	-747
▁ቃል	-748
ክተር	-749
ያዘ	-750
▁ማእ	-751
ሰቦች	-752
ውም	-753
▁ዘመ	-754
ጠቃ	-755
ቫይ	-756
▁አስፈ	-757
በትን	-758
▁የስራ	-759
▁ዙ	-760
▁ጀምሮ	-761
▁ተስፋ	-762
ላማ	-763
▁ሰአት	-764
▁በሙ	-765
ዳንት	-766
ባኤ	-767
ድሞ	-768
ደራ	-769
ቡብ	-770
ሀን	-771
▁የፖለቲካ	-772
ተኞች	-773
▁ይሆናል	-774
▁የኮ	-775
▁ስርአት	-776
ቻቸው	-777
▁መሆን	-778
▁ሸ	-779
▁እንቅ	-780
ዛት	-781
ኮኖ	-782
▁መግለጫ	-783
ሰጥ	-784
ፈር	-785
▁በነ	-786
ማይ	-787
▁አዋ	-788
▁ግብ	-789
▁አህ	-790
ችው	-791
▁ተቃ	-792
ከራ	-793
ደረግ	-794
ረም	-795
አዴ	-796
ሳቸው	-797
▁በአንድ	-798
▁ወጣ	-799
▁ይገባ	-800
▁ወንድ	-801
▁ስት	-802
▁ጋዜ	-803
▁ድም	-804
▁ዘንድ	-805
ሳሌ	-806
▁የሆኑ	-807
▁አማ	-808
ሳኔ	-809
ምጃ	-810
የው	-811
▁ግንባ	-812
▁ውድ	-813
▁አዳ	-814
▁የሚለው	-815
ይና	-816
▁ነዉ	-817
ሻሻ	-818
ኖሩ	-819
ጀት	-820
ጠት	-821
▁አቅ	-822
▁ተፈ	-823
ስታ	-824
▁ታሪክ	-825
ርትራ	-826
ላው	-827
ወቅ	-828
▁በኩል	-829
ኑን	-830
ግኘት	-831
ነጋ	-832
ደረገው	-833
ደርግ	-834
▁አጋ	-835
ጥታ	-836
▁ብለው	-837
▁ሲል	-838
ሮና	-839
▁መሳ	-840
▁ድጋ	-841
▁ቡድን	-842
ሄድ	-843
ሱስ	-844
▁የነበሩ	-845
▁ጌ	-846
▁አንዳ	-847
ችንን	-848
ልፍ	-849
ቀጥ	-850
ለህ	-851
▁ተማሪ	-852
▁ለማስ	-853
▁ያሳ	-854
▁ትን	-855
▁እንድ	-856
▁አብይ	-857
▁የምን	-858
▁አለመ	-859
ታደ	-860
▁ሀሳብ	-861
▁ጨዋ	-862
ሰሩ	-863
ኛውም	-864
ሯል	-865
ሞክራሲ	-866
▁ፊ	-867
▁ህይወት	-868
▁በው	-869
ግል	-870
ፌዴ	-871
ያዝ	-872
ሰር	-873
ቂያ	-874
ኒቨ	-875
▁የለ	-876
▁ለምን	-877
▁ሰላም	-878
▁አምላክ	-879
ቅድ	-880
▁ገልፀዋል	-881
ጠራ	-882
▁መለ	-883
ማኖ	-884
▁ይገ	-885
ናው	-886
▁በሚል	-887
▁ያለውን	-888
▁ሁሉም	-889
ነግ	-890
በብ	-891
መለከተ	-892
▁አቀፍ	-893
▁ቤቱ	-894
▁አመራ	-895
▁በታ	-896
ከሰ	-897
▁ዝግ	-898
▁መሪ	-899
▁የጥ	-900
▁የመንግስት	-901
▁የብ	-902
ስቃ	-903
የሱስ	-904
▁ካል	-905
ስና	-906
▁አንተ	-907
▁ቃ	-908
▁የአማራ	-909
▁በርካታ	-910
▁ዞ	-911
▁ተናግረዋል	-912
ደርጉ	-913
▁የል	-914
▁ሄ	-915
▁ቋ	-916
▁በሁ	-917
▁መብት	-918
ስቴ	-919
▁የሌ	-920
▁እርምጃ	-921
▁እንዳለ	-922
▁የኦሮ	-923
ሀል	-924
ጠብ	-925
ቦት	-926
ሁኑ	-927
ጋራ	-928
▁በመቶ	-929
▁ሰራ	-930
▁የተለያዩ	-931
▁ክርስቲ	-932
▁ዴ	-933
▁መብ	-934
ጠበቅ	-935
ሙን	-936
ነትን	-937
ደረሰ	-938
▁ባለስ	-939
▁መፅሀፍ	-940
ራን	-941
ጎች	-942
▁ኢትዮጵያዊ	-943
ረጋገ	-944
በቃ	-945
▁ውሳኔ	-946
ጠቅ	-947
▁በተጨማሪ	-948
▁ተብሎ	-949
▁ጥቅም	-950
▁ሶስት	-951
▁የራ	-952
▁ይመስ	-953
ከፍ	-954
ነገ	-955
▁ገንዘብ	-956
▁ነዋ	-957
ላጊ	-958
ጠቀም	-959
ሙያ	-960
▁በበ	-961
ስቃሴ	-962
▁የአለም	-963
▁የነበረው	-964
ረድ	-965
ኮኖሚ	-966
▁አባላት	-967
ጠይ	-968
▁አስተዳደር	-969
▁አፍ	-970
▁አስተያ	-971
ዲህ	-972
▁አስታው	-973
▁ጉባኤ	-974
▁ባይ	-975
▁የገ	-976
▁ድጋፍ	-977
▁ፍርድ	-978
ሱም	-979
▁ሲሉ	-980
መሳ	-981
▁አክ	-982
ምንት	-983
ዋን	-984
ትር	-985
▁ልጆች	-986
▁ስን	-987
ፈት	-988
▁ብሄራዊ	-989
አዊ	-990
▁ስል	-991
ችሉ	-992
▁ፖለቲካ	-993
መት	-994
▁ይህንን	-995
ሮችን	-996
ህአዴ	-997
ለጠ	-998
ቅና	-999
▁እኮ	-1000
ቆጣ	-1001
▁ቤቶች	-1002
▁እግዚአብሄር	-1003
▁በብ	-1004
ለኝ	-1005
ከላከ	-1006
ስን	-1007
ንቋ	-1008
▁ድርጊ	-1009
▁ጉዳዮች	-1010
▁በሙሉ	-1011
▁መጥ	-1012
▁ህገ	-1013
ቤተ	-1014
▁ትር	-1015
ናዊ	-1016
ላዊ	-1017
▁ያሉት	-1018
ጥሮ	-1019
▁እንቅስቃሴ	-1020
▁ግንኙ	-1021
▁ከዚያ	-1022
ነሱ	-1023
▁የኤ	-1024
▁እጅግ	-1025
▁በዘ	-1026
▁በፍ	-1027
ስር	-1028
▁ስለዚህ	-1029
ገት	-1030
▁እንግ	-1031
▁አደጋ	-1032
ነበር	-1033
ደን	-1034
ርቶ	-1035
ህአዴግ	-1036
▁ለህ	-1037
ቹን	-1038
▁ለማድረግ	-1039
▁መድረ	-1040
▁ማሳ	-1041
▁ባል	-1042
▁ፕሬዚ	-1043
▁ትኩ	-1044
ጭት	-1045
▁ሰብ	-1046
▁ቆይ	-1047
▁ጨዋታ	-1048
▁እንደሚያ	-1049
ገብ	-1050
▁ትልቅ	-1051
ሳል	-1052
ከተማ	-1053
▁በአዲስ	-1054
▁ወንጀ	-1055
ሜን	-1056
▁ግለ	-1057
ናወ	-1058
▁ልብ	-1059
ቋቋ	-1060
በያ	-1061
▁ገብ	-1062
ገራችን	-1063
▁የሚገኙ	-1064
▁መልካም	-1065
ሁንም	-1066
▁አጥ	-1067
▁መቶ	-1068
▁ውይ	-1069
▁የህዝብ	-1070
▁በቅር	-1071
ብራ	-1072
ርሲ	-1073
▁የውጭ	-1074
ደኛ	-1075
ቻል	-1076
▁አለበት	-1077
ላን	-1078
ላቸውን	-1079
▁ልማት	-1080
ቡን	-1081
▁ሮ	-1082
▁የመጀመሪያ	-1083
▁ዋጋ	-1084
ሳተ	-1085
ትል	-1086
ደርስ	-1087
▁ከወ	-1088
▁መሆና	-1089
▁አንዳንድ	-1090
▁ቢሆንም	-1091
▁ይዘ	-1092
እራ	-1093
ካባቢ	-1094
ጠል	-1095
▁ጫ	-1096
▁ከባ	-1097
▁ሚኒስቴ	-1098
ላር	-1099
▁ኦሮ	-1100
ተኛው	-1101
ከለ	-1102
ጠፋ	-1103
▁ውሀ	-1104
▁አሁንም	-1105
▁በሽ	-1106
ብኝ	-1107
ዳጅ	-1108
ቀመ	-1109
በታል	-1110
ባንያ	-1111
ብረተ	-1112
▁አላማ	-1113
▁የሰው	-1114
▁አፍሪካ	-1115
▁በማድረግ	-1116
ፈስ	-1117
▁እስካ	-1118
▁ተገ	-1119
▁በራ	-1120
ናገር	-1121
ክምና	-1122
▁ርእ	-1123
▁አህመድ	-1124
ምት	-1125
ከላከያ	-1126
ፖር	-1127
▁ፍላ	-1128
ቃሚ	-1129
▁ለውጥ	-1130
▁ቅር	-1131
▁ነጥ	-1132
▁በኢ	-1133
▁ዩኒቨ	-1134
ወር	-1135
▁ለዚህ	-1136
ከቱ	-1137
ርግ	-1138
ታወቀ	-1139
▁ዉ	-1140
▁ገፅ	-1141
ላሽ	-1142
▁ገለ	-1143
ጅት	-1144
▁ቀደም	-1145
ሞት	-1146
ደግ	-1147
ቫይረስ	-1148
▁የቆ	-1149
▁ወጥ	-1150
▁ስብሰባ	-1151
▁የሚሰ	-1152
ክለ	-1153
ንደር	-1154
▁ወረዳ	-1155
▁ፎ	-1156
▁የፀ	-1157
ከታ	-1158
▁አሜሪካ	-1159
ጠናቀ	-1160
▁ተመል	-1161
ጠኛ	-1162
▁የአዲስ	-1163
ፈራ	-1164
ከናወ	-1165
መለስ	-1166
ተት	-1167
ርሲቲ	-1168
▁ነኝ	-1169
▁ካለ	-1170
▁አሸ	-1171
▁በል	-1172
▁በተለያዩ	-1173
▁ነገሮች	-1174
ዲዮ	-1175
▁ግንኙነት	-1176
▁ወረ	-1177
የን	-1178
ቀረበ	-1179
▁ዶላር	-1180
▁በረ	-1181
▁ጓ	-1182
▁ኢየሱስ	-1183
▁ያልተ	-1184
▁መደ	-1185
▁ሚኒስቴር	-1186
▁ዙሪያ	-1187
▁በድ	-1188
▁ስልጣን	-1189
▁መሳሪያ	-1190
ጠሩ	-1191
▁ስላ	-1192
▁ጨምሮ	-1193
ሙት	-1194
በራዊ	-1195
▁ፅሁ	-1196
▁የትግራይ	-1197
▁ባለሙያ	-1198
▁ፈቃ	-1199
ቀል	-1200
ጣል	-1201
▁ክል	-1202
▁ውጤት	-1203
▁እሱ	-1204
▁ፍቅር	-1205
ቂት	-1206
ከብ	-1207
▁ባንክ	-1208
▁ጥረት	-1209
ለማ	-1210
▁ስሜ	-1211
▁ይሰ	-1212
▁መው	-1213
ክልሉ	-1214
ሶች	-1215
▁ያላቸው	-1216
▁ከሰ	-1217
▁ማሀ	-1218
▁መልእ	-1219
ወስ	-1220
ገለፀ	-1221
ፈሳ	-1222
ፈን	-1223
▁የካ	-1224
▁ዶክተር	-1225
▁አልተ	-1226
▁መታ	-1227
ርክ	-1228
ጣሪ	-1229
መሳሳይ	-1230
ቆም	-1231
ጠቃላይ	-1232
▁ቢሮ	-1233
▁ማስተ	-1234
ፍትሄ	-1235
▁ኩባንያ	-1236
ንግድ	-1237
▁የፍ	-1238
ቅረብ	-1239
▁ድምፅ	-1240
ረተ	-1241
ኩት	-1242
ስብ	-1243
▁ስለሆነ	-1244
▁ይልቅ	-1245
▁ለመስ	-1246
▁አለው	-1247
▁አካል	-1248
▁ሆነው	-1249
ገንዘብ	-1250
▁ታላ	-1251
ሻለ	-1252
▁ከነ	-1253
▁አፈ	-1254
▁ኖ	-1255
ምላክ	-1256
ማን	-1257
ናቸው	-1258
▁ቋንቋ	-1259
ዘጋጀ	-1260
▁አስፈላጊ	-1261
▁አድርጎ	-1262
▁ባለፈው	-1263
▁ሳምንት	-1264
ያዙ	-1265
ባብ	-1266
▁ይገባል	-1267
ለቱ	-1268
▁ነፍ	-1269
ጀመር	-1270
ንብ	-1271
ጠየ	-1272
▁ከሁ	-1273
▁መመ	-1274
▁ይላል	-1275
▁ተጨማሪ	-1276
▁ፖሊስ	-1277
▁ኮሚቴ	-1278
▁መንገ	-1279
▁እንዳል	-1280
ንጫ	-1281
ፍራ	-1282
ጀመረ	-1283
▁በአለም	-1284
▁ዮ	-1285
ለውን	-1286
▁ደስ	-1287
ውሞ	-1288
▁ዳር	-1289
▁አቅር	-1290
ዚሁ	-1291
ሊያ	-1292
▁በአሁኑ	-1293
ፈልግ	-1294
▁ጥቃት	-1295
▁ፍላጎ	-1296
▁ኳ	-1297
▁ግንባታ	-1298
▁የሁ	-1299
ደጋ	-1300
▁መዝ	-1301
ሊዝ	-1302
▁ንጉ	-1303
▁መሬት	-1304
▁ተደር	-1305
▁የሆነው	-1306
ነትና	-1307
ባዊ	-1308
ከላከል	-1309
ረጥ	-1310
ይን	-1311
▁ተቋማት	-1312
▁ስለሚ	-1313
▁በአል	-1314
ማኖት	-1315
▁ይዞ	-1316
▁ዞን	-1317
▁የክ	-1318
▁በመስ	-1319
▁የምር	-1320
▁አቋ	-1321
▁ሊሆን	-1322
▁ከሌ	-1323
▁ህፃ	-1324
▁ወያኔ	-1325
ሳቀ	-1326
ኞቹ	-1327
ችልም	-1328
▁ቻ	-1329
▁መም	-1330
▁መጠን	-1331
▁በኮ	-1332
▁ቱ	-1333
▁እውነ	-1334
▁ውጭ	-1335
▁ደር	-1336
▁ውይይት	-1337
▁እድል	-1338
▁ሰጥ	-1339
▁ሴት	-1340
▁ሀገራት	-1341
▁ብዬ	-1342
▁እውነት	-1343
▁እዚህ	-1344
ሰን	-1345
▁የጎ	-1346
▁ኢትዮጵያውያን	-1347
▁መድ	-1348
ማቸው	-1349
▁ነጋ	-1350
ውሮ	-1351
ገባው	-1352
▁ምክንያቱም	-1353
ገኛ	-1354
▁ትእ	-1355
ጀር	-1356
▁በማስ	-1357
ቁት	-1358
▁ሰራዊ	-1359
▁እለት	-1360
▁በባ	-1361
▁ቀናት	-1362
ቧል	-1363
ገለፁ	-1364
▁አራት	-1365
▁አገሮች	-1366
ጥጥር	-1367
▁መነ	-1368
▁አምስት	-1369
▁ፕሮግራ	-1370
▁ይህም	-1371
ቀበ	-1372
ይሆ	-1373
ቀዋል	-1374
ላማዊ	-1375
ፎች	-1376
▁ፕሮጀ	-1377
ማል	-1378
▁በጎ	-1379
ድስት	-1380
▁እምነት	-1381
ነር	-1382
▁አባል	-1383
▁የለው	-1384
▁አስተያየት	-1385
▁ወጣቶች	-1386
ዛዝ	-1387
▁ትክ	-1388
▁ጦርነት	-1389
▁የሞ	-1390
▁በሆነ	-1391
▁ቀር	-1392
▁አማካ	-1393
▁ባለስልጣ	-1394
▁በቁ	-1395
▁የተለ	-1396
ዳታ	-1397
ጠን	-1398
▁የድ	-1399
▁የአፍሪካ	-1400
ካል	-1401
▁በክ	-1402
መም	-1403
▁ተሰ	-1404
▁ተከት	-1405
▁ነበረ	-1406
ዘር	-1407
▁እስኪ	-1408
ካሄድ	-1409
▁ኤፍ	-1410
ንድን	-1411
▁ቀጥ	-1412
▁ጉዳት	-1413
▁ይሆን	-1414
▁ከሀ	-1415
ዱን	-1416
ሎጂ	-1417
▁በሌላ	-1418
▁ገቢ	-1419
▁ጤና	-1420
ያል	-1421
ኗል	-1422
ፈረ	-1423
ከፋ	-1424
ጋቢ	-1425
▁ቪ	-1426
ጠኝ	-1427
ዎችና	-1428
▁ድርጅቶች	-1429
▁ቡድ	-1430
▁ልክ	-1431
▁መፍትሄ	-1432
▁ወገ	-1433
▁ሻ	-1434
▁ፕሬዚዳንት	-1435
ላችን	-1436
ቾች	-1437
▁ወታደ	-1438
▁በተመለከተ	-1439
▁ጠን	-1440
▁ትኩረት	-1441
▁ይሆዋ	-1442
ሳቸውን	-1443
▁ጃ	-1444
▁ስርአ	-1445
ኮች	-1446
ዝር	-1447
▁ሴቶች	-1448
▁የተነሳ	-1449
ጣቸው	-1450
ትም	-1451
ኖረው	-1452
▁ዘርፍ	-1453
▁ዜጎች	-1454
▁እስካሁን	-1455
▁የምና	-1456
▁አረ	-1457
▁ከስ	-1458
▁የኦሮሞ	-1459
▁ይታወ	-1460
▁ሂደት	-1461
▁መልኩ	-1462
▁አውሮ	-1463
▁ፀሀ	-1464
▁ከህ	-1465
▁በቅርቡ	-1466
▁የጤና	-1467
▁ተማሪዎች	-1468
ጋቸው	-1469
ስማ	-1470
ባሪ	-1471
▁ናት	-1472
ደገ	-1473
▁ምላሽ	-1474
ጫወ	-1475
▁ሀብት	-1476
ጣው	-1477
ነዚህ	-1478
ህር	-1479
▁አዲ	-1480
ገሩ	-1481
▁ብሄር	-1482
▁ኬ	-1483
ዋሚ	-1484
▁ፌ	-1485
ጅም	-1486
▁ፍት	-1487
ክቶ	-1488
▁ያደር	-1489
▁እድሜ	-1490
ሳስ	-1491
▁ደም	-1492
▁እንደነበር	-1493
▁ባህር	-1494
ይል	-1495
▁ገና	-1496
▁ስነ	-1497
▁እንደማይ	-1498
▁ፕሬዝ	-1499
ከበር	-1500
ዳል	-1501
▁ከባድ	-1502
▁ሆኖም	-1503
▁ዝም	-1504
▁እራ	-1505
ችሁን	-1506
ዱት	-1507
ማርኛ	-1508
በሩት	-1509
▁ማለ	-1510
▁ህወሀት	-1511
ውና	-1512
ደብ	-1513
▁የአሜሪካ	-1514
ወጥ	-1515
ባለው	-1516
▁ትራ	-1517
ነቱን	-1518
ደል	-1519
ርስዎ	-1520
▁መሀ	-1521
ቡት	-1522
ባሉ	-1523
ጿል	-1524
▁ወራት	-1525
ፈፀም	-1526
ከፈ	-1527
▁ነጥብ	-1528
ጓል	-1529
▁መልስ	-1530
▁መተ	-1531
▁አቅም	-1532
▁ይችላሉ	-1533
ያቸው	-1534
▁የቀድሞ	-1535
ይሆዋ	-1536
ንቲ	-1537
▁ከም	-1538
ምፒ	-1539
▁አምባ	-1540
ተና	-1541
▁ቶ	-1542
ጥም	-1543
▁እያለ	-1544
ምህር	-1545
ቶቹ	-1546
▁የሙ	-1547
▁በጉ	-1548
ልኝ	-1549
ሰት	-1550
▁ፊት	-1551
▁አግ	-1552
ሰበ	-1553
▁ያው	-1554
ወጡ	-1555
▁ጥር	-1556
▁እናም	-1557
▁ወጣት	-1558
ጋሚ	-1559
▁አልነበረ	-1560
▁ወንጀል	-1561
ታማ	-1562
ዉን	-1563
▁አብዛ	-1564
ፍን	-1565
▁ኑ	-1566
▁ሩ	-1567
ቅረ	-1568
ጣሚ	-1569
ደረጉት	-1570
ዘን	-1571
▁ሰር	-1572
▁ተፅ	-1573
▁ዩኒቨርሲቲ	-1574
ጣን	-1575
ኪና	-1576
▁የንግድ	-1577
▁እቅድ	-1578
▁ተጠቃሚ	-1579
ስትሪ	-1580
ታችንን	-1581
▁ተግባር	-1582
▁ተከትሎ	-1583
▁ተራ	-1584
▁ምድር	-1585
በረሰብ	-1586
ዳት	-1587
▁ይቅር	-1588
ካሄደ	-1589
ገረ	-1590
▁ልጆ	-1591
ሎችን	-1592
ሱት	-1593
ኞችን	-1594
▁ያስፈል	-1595
ጉም	-1596
ስራቅ	-1597
▁መግ	-1598
▁ትና	-1599
▁ቢሊዮን	-1600
ዳደ	-1601
▁ይፋ	-1602
▁አገልግሎ	-1603
ንታ	-1604
▁ባለው	-1605
▁ቫይረስ	-1606
▁ባለመ	-1607
▁ስምምነት	-1608
▁አለማ	-1609
▁ሌላው	-1610
ጠረ	-1611
▁መፍ	-1612
▁መንግስታት	-1613
▁ድል	-1614
ረዳት	-1615
ፃሚ	-1616
▁ንግድ	-1617
▁ኳስ	-1618
ጋይ	-1619
ዋር	-1620
ሀብ	-1621
▁ቤተሰቦች	-1622
▁ኛው	-1623
ይወት	-1624
▁ግልፅ	-1625
▁ይቻ	-1626
ንደ	-1627
▁ጆ	-1628
▁ለሁ	-1629
ሰብአዊ	-1630
▁ጅ	-1631
▁ምክትል	-1632
የሁ	-1633
▁አካላት	-1634
▁ለማግኘት	-1635
ቀም	-1636
▁ህዝቦች	-1637
ዝና	-1638
▁መቼ	-1639
▁ሊቀ	-1640
▁አሰራ	-1641
ቻቸውን	-1642
ራሽ	-1643
▁መኖ	-1644
ክኖ	-1645
▁ዝር	-1646
ሷል	-1647
▁ብሏል	-1648
▁ማስታወ	-1649
ረጋግ	-1650
▁የሚቆ	-1651
በላ	-1652
ጣይ	-1653
▁እም	-1654
ጋሪ	-1655
መዘ	-1656
▁የዋ	-1657
ያም	-1658
ሀኒ	-1659
▁ደጋ	-1660
▁ሜትር	-1661
ግባር	-1662
▁ስታ	-1663
▁ነበሩ	-1664
▁ችግሮች	-1665
▁ጊ	-1666
▁ተጫ	-1667
ሻሻል	-1668
▁ትውል	-1669
ህና	-1670
ገዛ	-1671
▁ይቻላል	-1672
ስትና	-1673
▁በሚያ	-1674
▁የህግ	-1675
▁ተዋ	-1676
ሸነ	-1677
▁የተቀ	-1678
መጡ	-1679
▁መሆናቸውን	-1680
▁በዋ	-1681
ንፃ	-1682
ኳይ	-1683
▁መልእክት	-1684
ካባቢው	-1685
▁ግብር	-1686
▁የኦ	-1687
▁ኮን	-1688
▁ዝግጅት	-1689
ባቸውን	-1690
▁ጥናት	-1691
▁ወል	-1692
ላላ	-1693
ርስቶ	-1694
▁መዋ	-1695
በኛ	-1696
▁ኢትዮጵያን	-1697
▁ዳይ	-1698
ያንዳን	-1699
የም	-1700
ሶስት	-1701
መና	-1702
ከፍተኛ	-1703
ላቀ	-1704
▁ለኢትዮጵያ	-1705
ንባ	-1706
▁ይገኛል	-1707
ገናኛ	-1708
▁ጥሪ	-1709
ድሮ	-1710
መዋል	-1711
ያት	-1712
ቸኳይ	-1713
▁በኦሮ	-1714
ቀርብ	-1715
▁በቅ	-1716
▁ይታ	-1717
▁አስታወቀ	-1718
ንቀሳቀ	-1719
ዎን	-1720
▁ኢህአዴግ	-1721
ፊያ	-1722
ገለፁት	-1723
▁ትግራይ	-1724
ያያዘ	-1725
በዋል	-1726
ሞክራሲያዊ	-1727
ዳሴ	-1728
ሬሽን	-1729
▁ሱዳን	-1730
▁በዚህም	-1731
▁ህዝቡ	-1732
ጮች	-1733
▁ሚኒስትሩ	-1734
▁አየር	-1735
▁ክርስቲያን	-1736
▁ስራዎች	-1737
በሌ	-1738
▁ተቃውሞ	-1739
▁አዋጅ	-1740
ጭር	-1741
በልጥ	-1742
▁ጥን	-1743
ከታተ	-1744
ያይ	-1745
ስቱ	-1746
▁ሀይለ	-1747
ርቅ	-1748
▁የተወሰ	-1749
▁ስሜት	-1750
ዚቃ	-1751
ካሄደው	-1752
ንጀ	-1753
▁ለወ	-1754
ፈልጉ	-1755
▁የጦር	-1756
▁ሚሊ	-1757
▁ዘገባ	-1758
▁ያላ	-1759
▁ኡ	-1760
▁ተገቢ	-1761
ዱስትሪ	-1762
▁ግንቦት	-1763
▁ባለፉት	-1764
▁አንዳን	-1765
▁መሰረ	-1766
ዘጋጅ	-1767
ጥረት	-1768
▁ነዋሪዎች	-1769
▁አቢ	-1770
ሪቃ	-1771
▁ክርስቲያ	-1772
▁ምርመራ	-1773
▁ደብ	-1774
▁ንግግር	-1775
▁ክስ	-1776
▁ታው	-1777
እኖ	-1778
መደ	-1779
ሳቢ	-1780
▁የሚታ	-1781
ልና	-1782
ረሱ	-1783
▁ሀይሎች	-1784
▁ኦሮሞ	-1785
ርማ	-1786
▁በመሆኑም	-1787
▁በሽታ	-1788
ስቶ	-1789
▁እቃ	-1790
ጋዊ	-1791
▁የትምህርት	-1792
▁ሀጢ	-1793
ሳብ	-1794
▁ፍላጎት	-1795
▁ሰራዊት	-1796
▁ለማሳ	-1797
▁ሀብ	-1798
ቲት	-1799
ችላ	-1800
ንኛውም	-1801
▁ነን	-1802
▁በእርግ	-1803
ለቀ	-1804
▁በተጨማሪም	-1805
▁የተሻለ	-1806
ክኖሎጂ	-1807
ልቁ	-1808
▁ደሞ	-1809
▁እናንተ	-1810
▁ትንሽ	-1811
▁ሰላ	-1812
▁ሰነ	-1813
ካቸው	-1814
▁መጨረሻ	-1815
▁የፓ	-1816
▁ለሀ	-1817
ዳዳ	-1818
▁አስተዋ	-1819
▁ወዳ	-1820
ቡር	-1821
ካራ	-1822
▁የአንድ	-1823
▁ሚዲያ	-1824
ቆጣጠር	-1825
▁ብለን	-1826
▁ለዘ	-1827
▁መሪዎች	-1828
▁ይላሉ	-1829
ሰድ	-1830
▁ጳ	-1831
ፌዴራል	-1832
ፈጠረ	-1833
ሟል	-1834
ዊት	-1835
▁ግጭት	-1836
▁እድገት	-1837
ዷል	-1838
ናገሩት	-1839
▁ላለ	-1840
ካት	-1841
▁በወቅ	-1842
▁ቄ	-1843
▁ይኖር	-1844
ችለው	-1845
▁ተፅእኖ	-1846
ናይት	-1847
▁አንፃ	-1848
▁ከአንድ	-1849
ኝም	-1850
▁ኤርትራ	-1851
ዘው	-1852
▁አካባቢዎች	-1853
▁ከታ	-1854
▁ትግል	-1855
ምባ	-1856
ዳቸው	-1857
▁ደን	-1858
መቱ	-1859
▁ማድረ	-1860
▁ክብር	-1861
ዩን	-1862
▁ዳይሬ	-1863
▁ተወካ	-1864
▁የፕ	-1865
▁በቂ	-1866
ስፒ	-1867
▁ሀም	-1868
▁የቻ	-1869
▁ክለ	-1870
በትም	-1871
▁ስፍራ	-1872
ፖሊ	-1873
▁ከኢትዮጵያ	-1874
▁አልነበረም	-1875
▁ንብረት	-1876
▁ለምሳሌ	-1877
ዳሚ	-1878
▁አቃ	-1879
ከረ	-1880
▁ማግኘት	-1881
ፍና	-1882
▁ገበያ	-1883
▁በተለይም	-1884
▁ሰሞ	-1885
▁ማንም	-1886
▁ጥላ	-1887
▁የኮሮና	-1888
▁ህመም	-1889
ቃወ	-1890
▁ሰልፍ	-1891
▁በአማራ	-1892
▁አወ	-1893
▁የቅ	-1894
▁የከተማ	-1895
▁የቴ	-1896
▁መግባ	-1897
▁አራ	-1898
▁ተጠና	-1899
▁ለብ	-1900
▁ሰራተኞች	-1901
▁በበኩ	-1902
▁ስደ	-1903
▁ከው	-1904
▁ከበ	-1905
▁የፈ	-1906
▁የግል	-1907
▁ጀር	-1908
▁እርዳታ	-1909
▁የዚህ	-1910
▁የኢን	-1911
▁ጉዞ	-1912
ፈና	-1913
▁አመራር	-1914
ገዋል	-1915
ነኛ	-1916
ፃፀ	-1917
▁መጣ	-1918
▁የምታ	-1919
▁ስጋት	-1920
▁ስቴ	-1921
▁ነፃነት	-1922
ስተኛ	-1923
ብረተሰቡ	-1924
▁አንድነት	-1925
ከረም	-1926
▁ምግብ	-1927
በራ	-1928
▁ትግ	-1929
▁እንዲሆን	-1930
▁ውጪ	-1931
ነበረው	-1932
▁ተሳ	-1933
ዩት	-1934
▁እንድት	-1935
▁ልማ	-1936
▁ጠቁ	-1937
▁ምእራ	-1938
መንት	-1939
▁ቢያ	-1940
▁የለውም	-1941
ህፈት	-1942
ንጉ	-1943
▁ጌታ	-1944
ማኝ	-1945
ከው	-1946
ሳሰብ	-1947
ፁም	-1948
▁ፈቃድ	-1949
▁ጠይ	-1950
▁መስራት	-1951
▁ተከታ	-1952
▁ትናንት	-1953
▁አመለ	-1954
▁ሀላፊነት	-1955
ዛሬው	-1956
ርስቶስ	-1957
▁የጋራ	-1958
▁መከላከያ	-1959
ርሱ	-1960
ኛውን	-1961
▁ቲ	-1962
▁በስተ	-1963
▁እርግ	-1964
▁አንፃር	-1965
▁ታዲያ	-1966
▁ተገል	-1967
▁የሽ	-1968
ሩም	-1969
▁በይ	-1970
ክሮ	-1971
ደርገው	-1972
▁ቅድ	-1973
ያቂ	-1974
▁ግድብ	-1975
▁መድረክ	-1976
▁የሰላም	-1977
▁ከዚያም	-1978
ዳማ	-1979
ኔት	-1980
▁ልም	-1981
▁ፕሮግራም	-1982
▁ወጪ	-1983
ዲት	-1984
▁ኮሚሽን	-1985
ዳም	-1986
በነ	-1987
ነታቸው	-1988
ኪያ	-1989
▁ሰዎችን	-1990
መለከት	-1991
ሌክት	-1992
▁ግራ	-1993
▁ከተሞች	-1994
ናንተ	-1995
▁ብት	-1996
▁የሚለውን	-1997
መዝ	-1998
ቁር	-1999
ንቅ	-2000
▁ዛ	-2001
ሳን	-2002
ቋቋም	-2003
ቦችን	-2004
▁ምህ	-2005
▁አስረድ	-2006
ቂቃ	-2007
▁ምርት	-2008
ባቸዋል	-2009
ማሽ	-2010
ልማት	-2011
ረር	-2012
ቤቱ	-2013
▁ባህል	-2014
▁አመራሮች	-2015
በረታ	-2016
ብሪካ	-2017
ፈፀመ	-2018
ጣጫ	-2019
ትስ	-2020
▁በመሆን	-2021
▁ሹ	-2022
▁የሚፈ	-2023
▁የሚገኘው	-2024
ራው	-2025
▁ጉድ	-2026
▁ለመቀ	-2027
▁የተባለው	-2028
▁ተግባራዊ	-2029
▁ድርጊቶች	-2030
▁ብቸ	-2031
▁ሆኗል	-2032
▁በመቀ	-2033
▁ፓርቲዎች	-2034
ውሮፓ	-2035
▁በግልፅ	-2036
▁አልፎ	-2037
▁ባለቤት	-2038
ሳሰ	-2039
▁ጥበቃ	-2040
ርሀ	-2041
ጥፋት	-2042
ህንነት	-2043
▁ያስተ	-2044
ራይ	-2045
▁ገበ	-2046
ጠቅላይ	-2047
▁መጀመሪያ	-2048
ሎስ	-2049
ራሉ	-2050
▁አድርገው	-2051
ጀም	-2052
▁ጄ	-2053
ልህ	-2054
ናይትድ	-2055
▁ቡና	-2056
▁የፌ	-2057
▁መንግስቱ	-2058
ሁት	-2059
▁ለመፍ	-2060
▁ተጋ	-2061
ደራል	-2062
▁ተብሏል	-2063
▁በገ	-2064
ስተር	-2065
▁ከቀ	-2066
ጥነት	-2067
▁የገንዘብ	-2068
▁እግር	-2069
ሰጡ	-2070
ናገራ	-2071
▁የጠ	-2072
ፊዎች	-2073
▁የሚሆኑ	-2074
ብዛ	-2075
ቷን	-2076
▁ይኖ	-2077
▁ብርሀ	-2078
▁መስተ	-2079
ረግ	-2080
▁የሚያሳ	-2081
ረጋገጥ	-2082
▁ተመሳሳይ	-2083
▁ደረ	-2084
ሄዱ	-2085
▁ማእከል	-2086
▁የበለጠ	-2087
▁ፅሁፍ	-2088
ስቲ	-2089
▁አጋጣሚ	-2090
▁ሬ	-2091
▁ወሬ	-2092
▁ሰላማዊ	-2093
▁ኢኮኖሚ	-2094
ለፍ	-2095
▁ስልጠና	-2096
▁የህወሀት	-2097
ምፕ	-2098
▁የሚችል	-2099
ወጣው	-2100
▁ሰፊ	-2101
▁የነበሩት	-2102
▁አሰራር	-2103
▁የነበረውን	-2104
ሆንም	-2105
ውጣት	-2106
▁ወዲህ	-2107
▁በጋራ	-2108
መጥ	-2109
▁መስጠት	-2110
ሸት	-2111
▁ህብረት	-2112
▁የበላይ	-2113
ረኛ	-2114
▁ወገን	-2115
▁ይበ	-2116
ወድ	-2117
ባባይ	-2118
ወለ	-2119
ፉን	-2120
ያንስ	-2121
▁ሚና	-2122
▁የሆኑት	-2123
ዝም	-2124
ቴን	-2125
ሄራዊ	-2126
▁ባለሙያዎች	-2127
▁አግኝ	-2128
ካሪ	-2129
ሌት	-2130
ቀርቡ	-2131
▁የሴ	-2132
▁ዘመቻ	-2133
▁ያለበት	-2134
▁ኪሎ	-2135
▁ባለስልጣናት	-2136
▁በመንግስት	-2137
▁የመሰ	-2138
▁ለሌ	-2139
▁አንቀ	-2140
ዎት	-2141
▁መነሻ	-2142
▁ውድድር	-2143
ፈልጋ	-2144
ይማኖት	-2145
ረታ	-2146
ከባ	-2147
▁ተቋም	-2148
ሶማ	-2149
▁ሞት	-2150
▁እያሉ	-2151
ልፅግና	-2152
▁የአምላክ	-2153
▁መልክ	-2154
▁የቤተ	-2155
▁ምሁ	-2156
ሰል	-2157
▁የዩ	-2158
▁መላ	-2159
ሳኝ	-2160
▁መድሀኒ	-2161
▁መኖር	-2162
▁የፋ	-2163
▁የሰብአዊ	-2164
ንስት	-2165
▁ትውልድ	-2166
▁ሰባት	-2167
▁የኔ	-2168
▁ህክምና	-2169
ኒያ	-2170
▁መንፈስ	-2171
ፈልገው	-2172
▁ሰለ	-2173
ሽኑ	-2174
▁ፈተና	-2175
ጨዋ	-2176
▁ስህ	-2177
▁አቢይ	-2178
▁ወስ	-2179
ሽከር	-2180
ችኋ	-2181
ደሰ	-2182
ጀን	-2183
▁ወላ	-2184
ቁም	-2185
▁ትክክለ	-2186
ውስ	-2187
▁ኢትዮ	-2188
▁ጠንካራ	-2189
ተኝነት	-2190
▁መለስ	-2191
▁አስታውቋል	-2192
▁ተሸ	-2193
▁አቅጣጫ	-2194
ክሲ	-2195
▁አዲሱ	-2196
▁ጣቢያ	-2197
▁ታላቅ	-2198
▁ደቂቃ	-2199
▁በደቡብ	-2200
ለኛል	-2201
ዋት	-2202
ሆነው	-2203
▁ምሳሌ	-2204
▁በዚያ	-2205
▁አስፈፃሚ	-2206
▁ጥቅ	-2207
▁ጥቂት	-2208
ዋለሁ	-2209
▁ጭምር	-2210
ጠኞች	-2211
▁ደስታ	-2212
▁አመለካ	-2213
ሰጠው	-2214
▁ስድስት	-2215
▁ከት	-2216
▁የውሀ	-2217
ንክ	-2218
▁ቀላል	-2219
▁እህ	-2220
▁ይቀ	-2221
ስሊ	-2222
▁የሚሉ	-2223
▁የሚባል	-2224
አል	-2225
▁ክፍያ	-2226
▁ዘጠኝ	-2227
▁በቃ	-2228
ፅኦ	-2229
ባበ	-2230
▁ክፍለ	-2231
ሰዋል	-2232
ላለም	-2233
▁ፎቶ	-2234
▁ሆይ	-2235
▁አገራት	-2236
▁ፕሬዝዳንት	-2237
▁ግለሰቦች	-2238
ጀርመን	-2239
ጁን	-2240
▁መስሪያ	-2241
▁መመሪያ	-2242
▁ረገድ	-2243
ዳቤ	-2244
▁ይሄን	-2245
▁የመስ	-2246
▁ተቃዋሚ	-2247
ናይ	-2248
▁ህጋዊ	-2249
ተናል	-2250
▁እንደሚችል	-2251
እምሮ	-2252
▁ስጋ	-2253
መነ	-2254
▁ያደረገ	-2255
ነቶች	-2256
ቱት	-2257
▁ባደረ	-2258
▁ሲባል	-2259
▁መኮ	-2260
▁ይመስላል	-2261
ደጋጋሚ	-2262
▁አውሮፕ	-2263
▁ሊግ	-2264
ጊዜው	-2265
▁እኔም	-2266
▁ተጠር	-2267
ፏል	-2268
▁የጉ	-2269
▁ከጥ	-2270
▁በኤ	-2271
▁ሁለተኛ	-2272
▁በሌሎች	-2273
▁የመጨረሻ	-2274
ልስ	-2275
▁ማም	-2276
▁የክልሉ	-2277
▁አደረ	-2278
▁ሆስፒ	-2279
▁ጐ	-2280
▁የኤርትራ	-2281
መልከት	-2282
▁ማስረጃ	-2283
▁ደቡብ	-2284
▁ስልጣ	-2285
▁ሰማ	-2286
▁ይኸ	-2287
▁ሪፖርት	-2288
▁ያን	-2289
ታን	-2290
▁በወቅቱ	-2291
ራር	-2292
▁ንጉስ	-2293
▁በሰላም	-2294
ቨስት	-2295
ሊክ	-2296
ላለች	-2297
▁ምናል	-2298
ርሽ	-2299
▁የደረ	-2300
▁ሰይ	-2301
▁እነዚህን	-2302
ለቅ	-2303
▁በተያያዘ	-2304
ነጋገር	-2305
▁ቀበሌ	-2306
ዳና	-2307
ነህ	-2308
▁የልማት	-2309
▁እንደሌ	-2310
▁ነፍስ	-2311
▁ጠብ	-2312
▁ምል	-2313
▁ይበልጥ	-2314
ገነባ	-2315
ሀሴ	-2316
▁ምናልባት	-2317
▁እናት	-2318
▁በመን	-2319
ጧል	-2320
▁ከሚያ	-2321
▁አቋም	-2322
▁ተጫዋ	-2323
ዥን	-2324
▁ካሳ	-2325
ነበ	-2326
ፈሳዊ	-2327
▁የማስ	-2328
▁የቀረ	-2329
ድብ	-2330
ሻል	-2331
▁መቆ	-2332
▁ይፈ	-2333
▁ፅህፈት	-2334
ድና	-2335
ገኙት	-2336
ለቲከ	-2337
▁ጋዜጣ	-2338
▁ትእዛዝ	-2339
▁ቴሌ	-2340
ጠቀሙ	-2341
▁በአጠቃላይ	-2342
ሻገር	-2343
▁ኖሮ	-2344
▁ራሱን	-2345
▁ይባ	-2346
▁የተደረገ	-2347
ሊት	-2348
▁በስራ	-2349
▁ችሎ	-2350
▁አንደ	-2351
▁የምርጫ	-2352
▁ዘግ	-2353
▁አብሮ	-2354
ጠበቀ	-2355
▁መክ	-2356
▁መፃ	-2357
▁ፋብሪካ	-2358
▁የሚጠ	-2359
▁የተቃ	-2360
መሰረተ	-2361
▁ምንጭ	-2362
ለል	-2363
▁ከግ	-2364
▁መሰረታዊ	-2365
ጨት	-2366
ቃይ	-2367
ሬን	-2368
▁በጀት	-2369
▁ብሄረ	-2370
▁ለስ	-2371
ሮው	-2372
ቃቸው	-2373
▁ቤተሰቦችዎ	-2374
▁መሀመድ	-2375
ዳሜ	-2376
▁በታች	-2377
▁እነሱ	-2378
▁ግዜ	-2379
▁ብል	-2380
▁ቆይታ	-2381
▁ስለተ	-2382
ዮር	-2383
▁ዋንጫ	-2384
▁አስተዋፅኦ	-2385
▁አስመል	-2386
ጀመሩ	-2387
▁ዱ	-2388
▁የሚያስችል	-2389
▁አታ	-2390
ገራቸው	-2391
▁የኢኮኖሚ	-2392
ሀንስ	-2393
▁ወደፊት	-2394
▁ነዋሪ	-2395
▁አለባቸው	-2396
ሱዳን	-2397
▁ጥና	-2398
ለያየ	-2399
ለበት	-2400
▁ፕሮፌ	-2401
▁በዚሁ	-2402
▁ሆቴ	-2403
▁የመን	-2404
ስቡ	-2405
ሁድ	-2406
▁በትግራይ	-2407
▁ጀም	-2408
▁ደሙን	-2409
ብረተሰብ	-2410
ገበ	-2411
▁ተቀባይ	-2412
▁ማየት	-2413
▁የድር	-2414
▁ከል	-2415
ርላማ	-2416
▁እንደዚህ	-2417
▁አያስ	-2418
▁ጥያቄዎች	-2419
▁የሚገባ	-2420
▁ክፉ	-2421
ንነት	-2422
▁የወጣ	-2423
▁ምርጥ	-2424
▁ፈፅ	-2425
ስቸኳይ	-2426
ናፊ	-2427
ሳው	-2428
▁ጀግና	-2429
▁በቁጥጥር	-2430
▁ወገኖች	-2431
ጋቢት	-2432
▁ተገኝ	-2433
ዎቹን	-2434
▁ሼ	-2435
▁ማር	-2436
▁እንድን	-2437
ሽት	-2438
▁አላቸው	-2439
▁አስረድተዋል	-2440
ቀስ	-2441
▁የተፈ	-2442
▁ምና	-2443
▁ሰሞኑን	-2444
▁ተል	-2445
▁ወይስ	-2446
▁ያስፈልጋል	-2447
▁ሪፖር	-2448
▁አባት	-2449
▁ተሳት	-2450
▁ክት	-2451
▁አለኝ	-2452
▁ትርጉም	-2453
▁ራሱ	-2454
ድሩ	-2455
▁መስከረም	-2456
ፈሳሉ	-2457
▁አይችልም	-2458
▁በከፍተኛ	-2459
▁ህዝባዊ	-2460
▁ህፃናት	-2461
▁ቢያንስ	-2462
ቀድ	-2463
▁የፀጥታ	-2464
▁ድርሻ	-2465
▁ያፈሳሉ	-2466
▁እስር	-2467
ክርስቲ	-2468
▁ኢንተር	-2469
▁ግብፅ	-2470
▁እንግዲህ	-2471
▁የዜ	-2472
ርም	-2473
ቃቄ	-2474
ጡን	-2475
▁እንደማ	-2476
ዝቡ	-2477
▁ዝቅ	-2478
▁ነህ	-2479
ልድ	-2480
▁እስራ	-2481
▁ሀያ	-2482
ለጋ	-2483
▁የጋ	-2484
▁ከብ	-2485
▁ተጠቅ	-2486
ግለፅ	-2487
ጀመረው	-2488
▁የግብ	-2489
ልማ	-2490
▁ካር	-2491
▁ባለስልጣን	-2492
▁ክር	-2493
▁መኪና	-2494
▁አድማ	-2495
▁ማህበር	-2496
▁አምባሳ	-2497
▁ሁሉንም	-2498
▁ታስ	-2499
▁ለመከላከል	-2500
▁የሀገር	-2501
▁መሸ	-2502
ፈለገ	-2503
ብርና	-2504
▁አይቀር	-2505
▁አመልክ	-2506
ቫይረሱ	-2507
ግባብ	-2508
ለጥ	-2509
መለሱ	-2510
ጉን	-2511
ቁን	-2512
▁ቦታዎች	-2513
▁ራስ	-2514
▁በምን	-2515
▁እኩል	-2516
መለክ	-2517
ኘው	-2518
ቶቻችን	-2519
ረዱ	-2520
▁አስተሳሰብ	-2521
▁እንዳለው	-2522
▁ጥቅምት	-2523
▁ሁለቱ	-2524
ቀጥል	-2525
▁አይመስ	-2526
ሆናቸው	-2527
▁መከራ	-2528
▁ገብረ	-2529
▁በኦሮሚያ	-2530
▁ያላቸውን	-2531
▁ፍሬ	-2532
▁አርሶ	-2533
ፋር	-2534
▁የኦሮሚያ	-2535
ሾች	-2536
ራንስ	-2537
▁ሰኔ	-2538
ፃነት	-2539
▁ቴክኖሎጂ	-2540
ላንድ	-2541
▁የሚችሉ	-2542
▁ልት	-2543
▁ማንኛውም	-2544
▁ለህዝብ	-2545
▁ባደረካቸው	-2546
ሞላ	-2547
▁ጋዜጠኛ	-2548
ርፍ	-2549
ጉት	-2550
▁ደብዳቤ	-2551
▁አማራጭ	-2552
▁የደረሰ	-2553
ጀንሲ	-2554
ሴን	-2555
ርያም	-2556
▁የመጣ	-2557
ጊያ	-2558
▁በዛሬው	-2559
▁በየአ	-2560
▁ዉስጥ	-2561
▁ጥበብ	-2562
▁እያንዳን	-2563
▁ፕሮጀክ	-2564
▁ፖሊሲ	-2565
ፈጠረው	-2566
በኞች	-2567
▁ክልሎች	-2568
▁ምስክ	-2569
ሌክትሪክ	-2570
ዋእ	-2571
ራሪ	-2572
▁የደቡብ	-2573
▁አስደ	-2574
▁ሀጢአ	-2575
▁የሚኖሩ	-2576
ንግሊዝ	-2577
▁ማስታወቂያ	-2578
▁አመቱ	-2579
▁ግንባር	-2580
▁ሰአ	-2581
▁ፍትህ	-2582
▁ተነ	-2583
መሩ	-2584
▁ክፍሎች	-2585
▁አስራ	-2586
▁አሰልጣ	-2587
▁ሜዳ	-2588
▁እየሰራ	-2589
ዝቃ	-2590
ቀደ	-2591
▁የስነ	-2592
ከላዊ	-2593
ኬት	-2594
ምርጫ	-2595
▁እባ	-2596
▁እንደገና	-2597
▁ትች	-2598
ገንባት	-2599
▁ህንፃ	-2600
▁እንዲያው	-2601
▁ጥፋ	-2602
▁የኢትዮጵያን	-2603
ፋን	-2604
ህሳስ	-2605
ሉበት	-2606
▁ንፁ	-2607
▁ሉ	-2608
▁አና	-2609
▁አጀ	-2610
ድረስ	-2611
▁መንገዶች	-2612
▁የቀረበ	-2613
▁ርእሰ	-2614
▁ድርጊት	-2615
ታር	-2616
ሳዊ	-2617
▁የሚወ	-2618
▁እንደሚያስ	-2619
▁የቦ	-2620
ቀን	-2621
▁የቡ	-2622
▁ታውቋል	-2623
▁እንጅ	-2624
ቶችና	-2625
ኛሉ	-2626
▁ተወካዮች	-2627
ባባ	-2628
ቻለ	-2629
▁የወያኔ	-2630
▁ለት	-2631
▁ቦርድ	-2632
▁ልዩነት	-2633
▁አስር	-2634
ጠለ	-2635
▁ዘዴ	-2636
ንድነው	-2637
ክተ	-2638
▁የሆነውን	-2639
▁ፕሮጀክት	-2640
ሎቹ	-2641
▁ማረ	-2642
ሞን	-2643
ዮርጊ	-2644
▁ከሌሎች	-2645
ካሂ	-2646
▁ታሪካ	-2647
▁በተመሳሳይ	-2648
▁ጎንደር	-2649
▁አዳዲስ	-2650
ዋቂ	-2651
▁በመጀመሪያ	-2652
▁በመተ	-2653
▁የሚሉት	-2654
▁በማሰብ	-2655
▁መፅ	-2656
ህዌ	-2657
ራቸውን	-2658
▁ዛሬም	-2659
▁ተወላ	-2660
ልቃ	-2661
▁እርሱ	-2662
▁ለመስጠት	-2663
ሳሽ	-2664
▁የሚታወ	-2665
▁ለማለት	-2666
▁የዘር	-2667
▁ፖለቲከ	-2668
▁ተመራ	-2669
▁መስመር	-2670
▁የተባለ	-2671
ግም	-2672
▁ዳይሬክተር	-2673
▁ተጠያቂ	-2674
ዬን	-2675
ቪድ	-2676
▁ወረርሽ	-2677
▁እረ	-2678
▁ጓደ	-2679
ውው	-2680
▁ዝርዝር	-2681
ልበት	-2682
▁ሰብአዊ	-2683
▁ነሀሴ	-2684
ገም	-2685
▁አንቀፅ	-2686
▁ተደርጎ	-2687
ገልፃ	-2688
▁በፈ	-2689
▁ወሳኝ	-2690
ሆኑም	-2691
▁ሳያ	-2692
ሰስ	-2693
▁ሚንስት	-2694
▁ሙከራ	-2695
▁በአፍሪካ	-2696
▁የይሆዋ	-2697
▁ያቀረ	-2698
ውሎስ	-2699
ስራኤል	-2700
ማግ	-2701
▁ይናገራ	-2702
▁የህክምና	-2703
ካን	-2704
▁ለሰ	-2705
▁አስታውቀዋል	-2706
ምሩ	-2707
▁ኮር	-2708
▁ጎን	-2709
▁ማህበረሰብ	-2710
ጋና	-2711
▁ተዘ	-2712
▁ለማወቅ	-2713
▁ይናገራሉ	-2714
ወያ	-2715
▁የተለየ	-2716
▁ዴሞክራሲያዊ	-2717
▁ምንድን	-2718
ደድ	-2719
ቸዉን	-2720
▁የምግብ	-2721
በሳ	-2722
▁ሚሊየን	-2723
ጠነ	-2724
▁ይገኛሉ	-2725
▁እርስ	-2726
ደበ	-2727
▁ፀሀፊ	-2728
▁ማለትም	-2729
▁የካቲት	-2730
ጦች	-2731
▁ከላይ	-2732
▁እንደሚገባ	-2733
▁አቃቤ	-2734
▁እውነተኛ	-2735
▁የሲ	-2736
ቢሲ	-2737
▁አገሪ	-2738
ጠቁ	-2739
▁የዳ	-2740
▁ገደ	-2741
ዛቤ	-2742
▁በዚ	-2743
▁ይመል	-2744
▁ብለህ	-2745
▁የሚተ	-2746
▁ለፍ	-2747
▁ተቆ	-2748
▁ተገለፀ	-2749
▁ይታወሳል	-2750
ሰራው	-2751
▁በህግ	-2752
▁አስከ	-2753
▁ሰም	-2754
ናገሩ	-2755
▁ስለመ	-2756
▁አስተያየ	-2757
▁ማወቅ	-2758
▁አይቀርም	-2759
ይታ	-2760
ሰረ	-2761
ቃሉ	-2762
▁ልን	-2763
▁ግለሰብ	-2764
▁ይዘው	-2765
ጠዋል	-2766
▁በአሜሪካ	-2767
▁ኢንዱስትሪ	-2768
▁በራሱ	-2769
▁የአየር	-2770
▁ግዛት	-2771
▁ሀምሌ	-2772
ራችን	-2773
▁ፈጣሪ	-2774
ነስተኛ	-2775
▁አመለካከት	-2776
▁በተደጋጋሚ	-2777
ጠይቅ	-2778
ሳካ	-2779
ዳዳሪ	-2780
▁በመጨረሻ	-2781
▁መቅ	-2782
▁እጥረት	-2783
ታም	-2784
▁አጠቃላይ	-2785
▁ተቀባይነት	-2786
ባረ	-2787
▁ለአንድ	-2788
ቀፍ	-2789
▁በህገ	-2790
ንቲባ	-2791
▁ቤተሰብ	-2792
▁ይሁንና	-2793
ህነት	-2794
▁ትምህር	-2795
ህም	-2796
ከን	-2797
▁ተባለ	-2798
▁ኔ	-2799
▁ግዴ	-2800
▁ተገልጿል	-2801
▁ፒ	-2802
መኑ	-2803
▁ያሉትን	-2804
▁በቀላሉ	-2805
▁ታይ	-2806
▁አማርኛ	-2807
ምስት	-2808
▁አስመልክቶ	-2809
ብብር	-2810
▁ጓደኛ	-2811
▁ያገኘ	-2812
ቂዎች	-2813
▁ሊቀመን	-2814
▁ሎ	-2815
▁ብላ	-2816
ሰቦ	-2817
ኩር	-2818
ርሶ	-2819
▁ፕሮፌሰር	-2820
▁ሀይማኖት	-2821
▁ርእስ	-2822
እራብ	-2823
▁ፖለቲካዊ	-2824
▁ገልጿል	-2825
ረገ	-2826
▁ይመስለኛል	-2827
▁በሁለት	-2828
▁የፌዴራል	-2829
ማግሌ	-2830
ህዴ	-2831
▁የቤት	-2832
ጠኝነት	-2833
ቻሉ	-2834
▁ማርያም	-2835
▁እውቀት	-2836
▁ከድ	-2837
▁የሚያደርጉ	-2838
ስተካ	-2839
▁አልባ	-2840
▁ይቅርታ	-2841
ድቅ	-2842
▁ከዚህም	-2843
ሀዊ	-2844
▁ኒ	-2845
ላቂ	-2846
▁ስህተት	-2847
▁መራ	-2848
ፕሎ	-2849
ስተዋ	-2850
▁ሆስፒታል	-2851
▁ስቴትስ	-2852
▁ማክ	-2853
▁በምት	-2854
ብሮ	-2855
▁ያደረገው	-2856
▁በቀጥታ	-2857
▁እግ	-2858
▁ማህበራዊ	-2859
ታችሁ	-2860
▁በከተማ	-2861
▁ተመ	-2862
▁ደመ	-2863
▁አድርጓል	-2864
▁የያዘ	-2865
ፈፀሙ	-2866
▁በእው	-2867
▁የፅ	-2868
ድዮ	-2869
▁መሞ	-2870
ግባት	-2871
ላለፍ	-2872
ላችንም	-2873
ወገድ	-2874
▁ከኢ	-2875
ከሩ	-2876
▁የማህ	-2877
ዳው	-2878
ሰቢያ	-2879
▁አድራ	-2880
ድያ	-2881
▁ሀይማኖ	-2882
ሬታ	-2883
▁ካልተ	-2884
▁መጋቢት	-2885
▁የፊ	-2886
▁መረጃዎች	-2887
▁ተልእ	-2888
▁ከሁለት	-2889
▁መንግስታዊ	-2890
ከናወን	-2891
▁ያድር	-2892
▁በስተቀር	-2893
▁ውነ	-2894
▁ለማሻሻል	-2895
▁ዳን	-2896
መለከቱ	-2897
▁ሁሌ	-2898
ማዊ	-2899
▁ቁር	-2900
▁መሀል	-2901
▁የዛሬ	-2902
▁ጳውሎስ	-2903
▁ብርሀኑ	-2904
ሳተፉ	-2905
▁አጀንዳ	-2906
ሊና	-2907
▁ፀረ	-2908
▁የዲ	-2909
ማማ	-2910
ቨስትመንት	-2911
ሮቹ	-2912
▁አዛ	-2913
ፖሊስ	-2914
▁ወታደራዊ	-2915
▁አደር	-2916
ኖራቸው	-2917
▁መስዋእ	-2918
▁መገናኛ	-2919
ራክ	-2920
▁አሸናፊ	-2921
ሪት	-2922
ጠናከር	-2923
ፋል	-2924
▁ሊያስ	-2925
ሊን	-2926
ዮርጊስ	-2927
▁ትክክለኛ	-2928
▁በፀ	-2929
ረንሳይ	-2930
▁በህዝብ	-2931
▁ታህሳስ	-2932
▁ጌታቸው	-2933
ድሮስ	-2934
ገስ	-2935
▁ዮሀንስ	-2936
▁መፅሀ	-2937
▁የመጀመሪያው	-2938
▁ክርስቶስ	-2939
▁በብዙ	-2940
▁ለመስራት	-2941
▁ተይ	-2942
▁አይቻ	-2943
▁የላ	-2944
▁የሚቆጠሩ	-2945
ኒክ	-2946
▁በፅ	-2947
▁ፌዴ	-2948
▁አቡ	-2949
ጀመርያ	-2950
▁እኛም	-2951
▁ህል	-2952
▁ቃለ	-2953
▁ብዙሀን	-2954
ታሉ	-2955
▁የአገር	-2956
ንፈ	-2957
▁የሸ	-2958
▁ወቅታዊ	-2959
በራት	-2960
▁ቀይ	-2961
ባችን	-2962
▁ቪዲዮ	-2963
▁በበኩላቸው	-2964
▁ግርማ	-2965
ጅቱ	-2966
ማለን	-2967
ላቅ	-2968
ቅርብ	-2969
ገራሚ	-2970
ሰጠ	-2971
▁ባሻገር	-2972
ዛው	-2973
ረበ	-2974
ርቶዶ	-2975
ገልግ	-2976
▁ኑሮ	-2977
▁እንደምት	-2978
▁መርሀ	-2979
▁ቀድሞ	-2980
ግባቡ	-2981
▁አንድም	-2982
▁በቀጣይ	-2983
ባር	-2984
▁ደህንነት	-2985
▁ያሰ	-2986
▁በኮሮና	-2987
▁የህዝ	-2988
ጓዝ	-2989
ገሪቱን	-2990
▁በቀለ	-2991
▁ተሰማ	-2992
▁ዋናው	-2993
ፈጠር	-2994
▁ተቀብ	-2995
▁ምህረት	-2996
ዳደሩ	-2997
▁ችግሩ	-2998
▁የመፅሀፍ	-2999
በትና	-3000
ደቱ	-3001
መለከ	-3002
▁የሌለው	-3003
▁የእር	-3004
▁እስክ	-3005
ላቸውም	-3006
ፎር	-3007
▁በክልሉ	-3008
▁መጠየ	-3009
▁በመጠቀም	-3010
ኬሽን	-3011
▁ተሳትፎ	-3012
▁የባህር	-3013
ጣጥ	-3014
▁ምስክሮች	-3015
▁ይሰማ	-3016
▁ቅዳሜ	-3017
ማርያም	-3018
ዲያው	-3019
▁እየታ	-3020
▁የሚሆን	-3021
ኖችን	-3022
▁አስቸ	-3023
▁ለመሆን	-3024
▁በህይወት	-3025
ስቶች	-3026
ናሽ	-3027
▁አፈፃፀ	-3028
ችላለን	-3029
▁ገዳ	-3030
ጀምር	-3031
ያኑ	-3032
ሳችሁ	-3033
▁አማካኝነት	-3034
ይናንስ	-3035
▁ለራ	-3036
▁አባይ	-3037
▁ያደርጋል	-3038
▁ተልእኮ	-3039
ላትን	-3040
▁ባለሀብ	-3041
ሯቸው	-3042
ሳሉ	-3043
▁የማያ	-3044
▁ከንቲባ	-3045
ገባት	-3046
▁ስምንት	-3047
▁ማብራ	-3048
▁የምስ	-3049
▁ተን	-3050
▁ይታወቃል	-3051
▁ብቸኛው	-3052
ዝቃዜ	-3053
ዜማ	-3054
▁ለምንድን	-3055
▁እንችላለን	-3056
▁እሳት	-3057
▁አይደል	-3058
▁ሰላምን	-3059
▁ማቅረብ	-3060
ከተል	-3061
▁የተከሰ	-3062
▁መንፈሳዊ	-3063
▁የን	-3064
ሸነፍ	-3065
▁በሳ	-3066
▁ኩባንያዎች	-3067
▁ስንት	-3068
▁ወርቅ	-3069
▁እሁድ	-3070
ፆች	-3071
▁በአገሪቱ	-3072
ኖረ	-3073
▁በጋ	-3074
▁በሰው	-3075
▁ተሰጥ	-3076
ቪዥን	-3077
▁ሽማግሌ	-3078
▁ይገልፃ	-3079
▁ድንበር	-3080
▁የአገሪቱ	-3081
▁አስገራሚ	-3082
▁ሀላፊዎች	-3083
▁ብን	-3084
ዘረ	-3085
▁ነጋዴ	-3086
▁ካላ	-3087
▁ጫና	-3088
▁ቁጥጥር	-3089
ዘጋጁ	-3090
ነገረ	-3091
▁አምባሳደር	-3092
▁የኛ	-3093
▁ግድያ	-3094
▁ጥቃ	-3095
▁ከጎ	-3096
ደርሱ	-3097
▁የተከ	-3098
▁ብልፅግና	-3099
▁ቻይና	-3100
▁ሊቀመንበር	-3101
▁ቅዝቃዜ	-3102
ራች	-3103
ባበር	-3104
▁የሚገኝ	-3105
▁ቀጥሎ	-3106
ነታቸውን	-3107
ቅናቄ	-3108
ድም	-3109
▁እንደም	-3110
▁ምት	-3111
▁የመከላከያ	-3112
ንቶ	-3113
▁ሙዚቃ	-3114
ረዳው	-3115
▁አትሌ	-3116
▁ጂ	-3117
ፈለግ	-3118
ስቡክ	-3119
ሏቸው	-3120
▁ብድር	-3121
ገለፀው	-3122
▁ስፖርት	-3123
▁ህዳር	-3124
ኑት	-3125
ሉትን	-3126
▁አሻ	-3127
▁ዘመናዊ	-3128
▁ገባ	-3129
▁ቀጠ	-3130
ረኞች	-3131
▁ሰን	-3132
▁የኢህአዴግ	-3133
ጠመ	-3134
ንስሀ	-3135
▁አይገባ	-3136
ወሰን	-3137
▁ከደ	-3138
ዋሳ	-3139
▁ግጭ	-3140
በውን	-3141
▁እንስ	-3142
▁ለጥ	-3143
▁አጠና	-3144
ርነት	-3145
ፕሎማ	-3146
ጠናቀቅ	-3147
ነቅ	-3148
▁ለገ	-3149
ጋንዳ	-3150
ንድር	-3151
▁ብዛት	-3152
▁አፍሪቃ	-3153
▁ቁጥ	-3154
ለዉ	-3155
ዶቹ	-3156
▁በሁሉም	-3157
▁ህዝብን	-3158
▁እያደረገ	-3159
▁አታው	-3160
ፍቶ	-3161
▁ማንነት	-3162
▁ዋስትና	-3163
▁ወታደሮች	-3164
▁ወዘ	-3165
ነሰ	-3166
ኘት	-3167
ጠውን	-3168
▁ስርጭት	-3169
ማሪዎች	-3170
▁ጉዳዩ	-3171
▁ጠቁመዋል	-3172
▁ሰል	-3173
ዳድር	-3174
▁በፍጥነት	-3175
ላንት	-3176
ኩን	-3177
ላቸዋል	-3178
▁ከዛ	-3179
▁ተሳታ	-3180
▁ይመልከቱ	-3181
▁የአን	-3182
▁ጁ	-3183
▁ጠባ	-3184
▁ሙስሊ	-3185
▁ነገሮችን	-3186
▁ራሳቸውን	-3187
ጣዩ	-3188
▁ይጠበ	-3189
▁ቡድኖች	-3190
▁የወደ	-3191
ዘጋጀው	-3192
▁ወረርሽኝ	-3193
▁ትልቁ	-3194
▁በሀገሪቱ	-3195
ፍትህ	-3196
▁ብቃት	-3197
▁ፍፁም	-3198
▁ተደራ	-3199
ፈፅ	-3200
ፋቸው	-3201
▁ቸ	-3202
▁አስኪያ	-3203
▁መስዋእት	-3204
ፈታ	-3205
▁አዝ	-3206
ለድ	-3207
▁ፀጋ	-3208
▁በትክ	-3209
▁የተባበሩት	-3210
ጣቱ	-3211
▁ምሽት	-3212
▁በውጭ	-3213
▁መቼም	-3214
▁ታሪ	-3215
▁የንስሀ	-3216
ማቸውን	-3217
▁ጠቃሚ	-3218
▁ዘንድሮ	-3219
▁እንደገለፁት	-3220
▁ወንድም	-3221
ታወቁ	-3222
ቀመጥ	-3223
ምብ	-3224
ሰጣቸው	-3225
ካተ	-3226
▁መጨ	-3227
▁እስቲ	-3228
▁የሀይማኖት	-3229
ለሽ	-3230
ሳችን	-3231
ገውን	-3232
▁መኖሪያ	-3233
▁በእርግጥ	-3234
ክርስቲያን	-3235
ቂቅ	-3236
▁ተመስ	-3237
ዩም	-3238
ይቱ	-3239
▁የሀገሪቱ	-3240
ወራ	-3241
▁እንዳስ	-3242
▁ይጠብ	-3243
▁ይሰራ	-3244
ማረ	-3245
▁ተች	-3246
▁ትክክል	-3247
▁የሚከተ	-3248
▁ትራንስ	-3249
▁አንዲት	-3250
ካይ	-3251
▁መኮንን	-3252
▁መጥፎ	-3253
▁አለን	-3254
▁ጀርመን	-3255
▁ደሳ	-3256
▁አይደሉም	-3257
ዎቻችን	-3258
መቻ	-3259
ጦታ	-3260
ብቅ	-3261
መለከተው	-3262
▁እንደሆኑ	-3263
ሬዎች	-3264
▁ሁኔታዎች	-3265
▁በቦ	-3266
ፍሪቃ	-3267
▁አነስተኛ	-3268
ኳር	-3269
ሴት	-3270
▁ካልሆነ	-3271
ወዳ	-3272
ስተው	-3273
ባባሪ	-3274
▁ፊልም	-3275
▁አደባባይ	-3276
▁አልቻ	-3277
▁መረ	-3278
▁አርቲ	-3279
▁ሆቴል	-3280
▁ሁል	-3281
▁ለይ	-3282
▁እያስ	-3283
▁መዘ	-3284
▁ነውና	-3285
▁አስቸጋሪ	-3286
የሩ	-3287
▁ያደረጉት	-3288
ጥረ	-3289
▁በን	-3290
▁አብዮ	-3291
▁ታማኝ	-3292
ቀቅ	-3293
▁የፌደራል	-3294
▁ወዘተ	-3295
ሪው	-3296
▁የሚመራ	-3297
ጣሉ	-3298
▁እውቅና	-3299
▁አደረገ	-3300
▁የሳ	-3301
▁ምስክር	-3302
ደስ	-3303
▁ዜጋ	-3304
ነበሩ	-3305
ደንት	-3306
▁ወንዶች	-3307
▁ለመግ	-3308
ናን	-3309
▁ተያይ	-3310
▁በላ	-3311
ጥረው	-3312
▁በአግባቡ	-3313
▁ጠላት	-3314
▁ብርሀን	-3315
▁አዎ	-3316
▁ያም	-3317
▁ማብራሪያ	-3318
ቢት	-3319
▁ከእነዚህ	-3320
በስ	-3321
ለኝም	-3322
▁በሁለ	-3323
▁ሆና	-3324
▁በድር	-3325
▁ተብለው	-3326
ለስ	-3327
▁ገለፁ	-3328
ቡቲ	-3329
ሊያን	-3330
▁ኤጀንሲ	-3331
▁ውጤታማ	-3332
ምጣት	-3333
▁ሌሎችም	-3334
▁የእኔ	-3335
ግስት	-3336
▁ሲሆኑ	-3337
▁ምንድነው	-3338
▁የረ	-3339
▁የቱ	-3340
▁ታሪካዊ	-3341
▁እንዳለበት	-3342
▁ወይንም	-3343
▁ኮርፖ	-3344
▁ዙር	-3345
በታ	-3346
ሙር	-3347
ስፋት	-3348
▁በባህር	-3349
▁መሆናቸው	-3350
ሸን	-3351
▁የአውሮፓ	-3352
መጣል	-3353
ያለሁ	-3354
ፈዋል	-3355
▁የሚባለው	-3356
▁በዝ	-3357
▁ያነሳ	-3358
ርቶዶክስ	-3359
▁ይጠበቃል	-3360
ከም	-3361
▁ድርድር	-3362
▁ማው	-3363
▁ጉብኝ	-3364
▁ሶማ	-3365
▁የተሰማ	-3366
ቆች	-3367
▁ዩኒቨርስቲ	-3368
ጨረታ	-3369
ለመ	-3370
▁በእጅ	-3371
▁ንብረ	-3372
▁ለዘላለም	-3373
ዟል	-3374
ነገር	-3375
▁የሰራ	-3376
▁ቅን	-3377
▁ደሳለኝ	-3378
ጪው	-3379
ችኋል	-3380
▁እየተደረገ	-3381
▁ማራ	-3382
▁የወሰ	-3383
▁ብዙም	-3384
▁ስላል	-3385
ኬንያ	-3386
▁አዘጋጅ	-3387
▁ጊዮርጊስ	-3388
ዴፓ	-3389
▁ክርስቲያኖች	-3390
▁በድን	-3391
▁የኢትዮ	-3392
▁መጠቀም	-3393
▁መናገር	-3394
ከሉ	-3395
▁ቅሬታ	-3396
ታወቅ	-3397
▁ስደተኞች	-3398
▁የሚመ	-3399
▁በሰጡት	-3400
ተኮ	-3401
ጫወት	-3402
▁አጠ	-3403
▁ሙስና	-3404
▁የባለ	-3405
ጎችን	-3406
▁የሚገ	-3407
▁ንቅናቄ	-3408
ድሜ	-3409
▁ከአዲስ	-3410
ጥን	-3411
▁የእኛ	-3412
▁ለሚያ	-3413
ዳጊ	-3414
ዶችን	-3415
▁አግባብ	-3416
ንጀል	-3417
▁ተስማ	-3418
ጠየቅ	-3419
▁ልምድ	-3420
▁ስራው	-3421
▁ሀኪ	-3422
▁ምግባር	-3423
▁በሞ	-3424
▁አብርሀ	-3425
▁የሚመጣ	-3426
ናገረው	-3427
▁መደበኛ	-3428
ጠላ	-3429
▁የጣ	-3430
ናቂ	-3431
▁የተመሰረተ	-3432
▁ባለቤ	-3433
▁ባለፈ	-3434
▁ኤል	-3435
ነታችን	-3436
▁የገለፁት	-3437
ኒኬሽን	-3438
▁በደንብ	-3439
▁መዳ	-3440
▁ተጨ	-3441
▁አይቻልም	-3442
▁በመስጠት	-3443
▁የተሳ	-3444
▁ሙያ	-3445
▁ሽልማት	-3446
▁መምህ	-3447
ቻለው	-3448
▁የመሳሰ	-3449
▁የሚሆነው	-3450
▁ተነስ	-3451
ኮኖሚያ	-3452
▁ኋላ	-3453
▁በአካባቢው	-3454
ቀሰ	-3455
ኖርም	-3456
ፈናቀ	-3457
▁ትራምፕ	-3458
ብህ	-3459
▁በዩ	-3460
ገደሉ	-3461
▁አቅራ	-3462
▁ደጋፊ	-3463
▁ቀውስ	-3464
▁አለብን	-3465
▁እንዳያ	-3466
ፈልግም	-3467
▁የዶ	-3468
▁ለማየት	-3469
ምራት	-3470
ራማ	-3471
▁ጥፋት	-3472
▁አንደኛ	-3473
ስተዋል	-3474
▁የሚያው	-3475
▁ጦ	-3476
▁ዳዊት	-3477
▁ደብረ	-3478
▁አያው	-3479
ያችን	-3480
▁ኬንያ	-3481
▁ይአ	-3482
ወሀ	-3483
▁ህዝቡን	-3484
▁ምንጮች	-3485
▁ቡድኑ	-3486
ዮችን	-3487
ገለግ	-3488
▁ተር	-3489
▁ክብ	-3490
▁አርብ	-3491
▁ካለው	-3492
▁አውሮፕላን	-3493
▁ምጣ	-3494
▁ምልክት	-3495
▁እንደመ	-3496
ረፍ	-3497
ውሰድ	-3498
ጋጥ	-3499
ናቸውን	-3500
▁በዘር	-3501
ፈጠሩ	-3502
▁በቆ	-3503
▁ባላ	-3504
▁የቢ	-3505
▁መፅሄ	-3506
▁አሳስ	-3507
ገኘት	-3508
▁የሚሸ	-3509
ችውን	-3510
▁ከፋ	-3511
▁ለዚህም	-3512
▁በማን	-3513
▁ድሮ	-3514
▁በአን	-3515
ኩም	-3516
ላቱ	-3517
ሴቶች	-3518
ካኤል	-3519
▁አየ	-3520
▁አይን	-3521
▁መፃህ	-3522
▁በሰሜን	-3523
ፅና	-3524
▁ምስራቅ	-3525
▁በይፋ	-3526
▁ይሻ	-3527
▁ተናግሯል	-3528
▁ገዢ	-3529
▁አስቀ	-3530
ቤን	-3531
▁ፈር	-3532
▁ስለሚያ	-3533
▁ሰነድ	-3534
▁ግዴታ	-3535
▁ታዋቂ	-3536
▁ፍቃ	-3537
▁ሰራተኛ	-3538
▁አድርገዋል	-3539
▁ዝግጁ	-3540
▁የሚገል	-3541
▁ለመፍታት	-3542
▁ፈፅሞ	-3543
▁በቤተ	-3544
ፃፈ	-3545
ቃለን	-3546
ፃሜ	-3547
▁አንስቶ	-3548
▁ስራውን	-3549
▁አገዛዝ	-3550
ሻው	-3551
ላለህ	-3552
▁መድሀኒት	-3553
▁ጥላቻ	-3554
ዶነት	-3555
ለናል	-3556
ፈፀመው	-3557
በርካታ	-3558
ገልግሎት	-3559
▁ሁሉን	-3560
ቻለሁ	-3561
▁ኦነግ	-3562
በራቸው	-3563
▁የግድ	-3564
ስክ	-3565
ነውን	-3566
▁ጠየ	-3567
ጠንቀ	-3568
ሆኗ	-3569
▁ተቀም	-3570
▁አታውቅም	-3571
▁የገባ	-3572
ጨመረ	-3573
▁ዝና	-3574
▁አበበ	-3575
▁ተስፋዬ	-3576
▁ቂ	-3577
▁አሳል	-3578
▁በማይ	-3579
▁ጤ	-3580
ምባሲ	-3581
▁የሰጡት	-3582
ሻሻያ	-3583
▁ውል	-3584
▁ትዝ	-3585
▁ጋዜጠኞች	-3586
▁አሰፋ	-3587
▁ዘረ	-3588
▁የእግዚአብሄር	-3589
ችበት	-3590
▁ጥቁር	-3591
▁አጭር	-3592
ናትን	-3593
▁ቀርቶ	-3594
ጌታ	-3595
ደገፍ	-3596
▁ሰበር	-3597
▁ከውጭ	-3598
ፈተ	-3599
▁መሰል	-3600
▁በጭ	-3601
▁የመሬት	-3602
▁ከኤ	-3603
ኒስት	-3604
▁ርበነ	-3605
▁ክስተ	-3606
▁አይሆንም	-3607
ገኘውን	-3608
▁ሀይሉ	-3609
▁መልእክ	-3610
ብስ	-3611
▁ቅዱ	-3612
ማሩ	-3613
ለዋ	-3614
ቲክ	-3615
▁በካ	-3616
▁ፆ	-3617
▁በማሳ	-3618
ቀርበውን	-3619
▁ቅድመ	-3620
ሀድ	-3621
▁በረከት	-3622
▁ግም	-3623
▁ፈል	-3624
▁የተባሉ	-3625
▁በፓ	-3626
▁የተፈጥሮ	-3627
▁ሳምን	-3628
ቶን	-3629
▁እኔን	-3630
▁ያመለክ	-3631
▁ተረ	-3632
ቃወም	-3633
ወረ	-3634
ግግር	-3635
▁በፕ	-3636
▁ነች	-3637
ረጋጋት	-3638
▁ማጣ	-3639
▁ይባላል	-3640
▁ስልክ	-3641
▁በዋና	-3642
▁ጀመረ	-3643
▁ግንዛቤ	-3644
ጥፍ	-3645
ብናል	-3646
ዘጋጀት	-3647
▁ተደ	-3648
▁አቤቱ	-3649
ዲን	-3650
ሪፖር	-3651
ዲና	-3652
ጃም	-3653
ፃፍ	-3654
▁ቀጠሮ	-3655
ግሩ	-3656
▁የሶ	-3657
ንግተን	-3658
ዛቸው	-3659
▁ጉዳዩን	-3660
▁ሳይንስ	-3661
▁የተጠቀ	-3662
▁ወይዘ	-3663
▁እሱን	-3664
▁ምክንያቶች	-3665
▁የስልጣን	-3666
▁መረጃዎችን	-3667
▁የታሪክ	-3668
▁ይታያል	-3669
ናሉ	-3670
ኮኖሚያዊ	-3671
▁ዋነኛ	-3672
ማሉ	-3673
▁የሚሰራ	-3674
ሳተፍ	-3675
▁ማታ	-3676
ነን	-3677
▁በሚገኘው	-3678
▁ጠላ	-3679
ውንም	-3680
▁ስጦታ	-3681
ልኮ	-3682
▁ለግ	-3683
ረጋገጠ	-3684
ልካም	-3685
▁ለኢ	-3686
▁ወንዝ	-3687
▁መልሶ	-3688
ቤል	-3689
▁የሚመስ	-3690
▁ከገ	-3691
▁የቀድሞው	-3692
ሬዳ	-3693
መልስ	-3694
ስተዳደር	-3695
ራኒ	-3696
▁የከ	-3697
▁ኢሳ	-3698
▁የፓርቲ	-3699
▁መብቶች	-3700
▁አንቺ	-3701
ዳዩ	-3702
▁ለመጀመሪያ	-3703
▁መጋ	-3704
▁መመር	-3705
▁መና	-3706
▁ምረ	-3707
▁ዘው	-3708
▁ሽብር	-3709
▁ለቀ	-3710
ይይት	-3711
▁መሬ	-3712
ለየ	-3713
▁ባሉ	-3714
▁የማን	-3715
ኖቻችን	-3716
ዛሪ	-3717
▁ግምት	-3718
▁ሁላችንም	-3719
ቋረጥ	-3720
▁ውስ	-3721
▁ዎ	-3722
▁መዛ	-3723
ቃሽ	-3724
▁ሚንስትር	-3725
▁እንዳልሆነ	-3726
▁በአገር	-3727
▁ዝግጅ	-3728
▁ቋሚ	-3729
▁የተመረ	-3730
▁ረቂቅ	-3731
ኔራል	-3732
▁ችሎት	-3733
▁የጀርመን	-3734
ፈለጉ	-3735
▁በአብዛ	-3736
▁አእምሮ	-3737
▁ጥንቃቄ	-3738
▁እል	-3739
ቅቋል	-3740
▁አውጥ	-3741
ቲቪ	-3742
ፈነ	-3743
ቅን	-3744
ያቸውን	-3745
▁ፕሪ	-3746
▁ሲያስ	-3747
▁እንዲያውም	-3748
▁ክቡር	-3749
▁እቅ	-3750
▁ኦሮሚያ	-3751
▁በፌ	-3752
ባን	-3753
▁በዛ	-3754
▁ልና	-3755
ይነት	-3756
▁ቅጣት	-3757
▁ገብቶ	-3758
▁እንዳሉ	-3759
ቀረቡ	-3760
ተኞችን	-3761
▁ገለፀ	-3762
ስተና	-3763
ጠራው	-3764
ዎችም	-3765
ቶችህ	-3766
አዴን	-3767
ራቴ	-3768
▁የሚያሳይ	-3769
▁ያለፈ	-3770
ኡዲ	-3771
ንቀሳቀሱ	-3772
ራም	-3773
▁ካሉ	-3774
▁ሁሌም	-3775
▁እንጠቀ	-3776
ያሉ	-3777
▁ሀጢአተኛ	-3778
▁ኢትዮጵያዊያን	-3779
▁ምርምር	-3780
▁አቀፉ	-3781
▁አዘ	-3782
▁ልኡ	-3783
▁ቃላት	-3784
▁ምእራፍ	-3785
ዲሱ	-3786
▁ደረሰ	-3787
▁የየ	-3788
▁በትክክል	-3789
▁በተቃ	-3790
▁በኦ	-3791
▁የባዶነት	-3792
▁የሚሰጥ	-3793
ቆት	-3794
▁ደርሶ	-3795
ኪዎችን	-3796
▁ተችሏል	-3797
▁በየአመቱ	-3798
ኩስ	-3799
▁አረጋግ	-3800
▁ይደረ	-3801
▁ድርጅቱ	-3802
▁እንጠቀማለን	-3803
▁እጣ	-3804
▁ታደሰ	-3805
▁ላለፉት	-3806
▁እንዳሉት	-3807
ራጭ	-3808
ጫው	-3809
▁የህይወት	-3810
▁በመላው	-3811
▁ሆኑ	-3812
ላስ	-3813
▁በሀገር	-3814
▁ሰብሳቢ	-3815
▁ጠቅላላ	-3816
▁ትብብር	-3817
▁ድንቅ	-3818
▁አሰልጣኝ	-3819
ጃቸው	-3820
ኖሪያ	-3821
ለኛ	-3822
▁ነፍስህ	-3823
ወስድ	-3824
ንበት	-3825
ምም	-3826
ደቀ	-3827
ገዝ	-3828
▁ተቋማ	-3829
▁ድንጋ	-3830
ቱና	-3831
ሪዝም	-3832
▁ሳቢያ	-3833
▁ይመ	-3834
▁ያወ	-3835
▁የይ	-3836
ሰነ	-3837
ሞችን	-3838
▁እነሆ	-3839
▁በቴ	-3840
ራፊ	-3841
ባችሁ	-3842
▁እንደሚሆን	-3843
▁ልብስ	-3844
ያጭ	-3845
▁ምናምን	-3846
▁ይቆ	-3847
▁ማመን	-3848
▁በተግባር	-3849
▁ማሰብ	-3850
▁ሆን	-3851
▁ችሎታ	-3852
▁መምህር	-3853
ግዳ	-3854
ፈሩ	-3855
▁እየተካሄደ	-3856
▁ርቀት	-3857
ካሄዱ	-3858
▁ማሀበር	-3859
▁ያደረ	-3860
▁ባንኮች	-3861
▁አጣ	-3862
▁የሚደረግ	-3863
▁እርስዎ	-3864
ጉር	-3865
▁ወዳጅ	-3866
▁ሁለቱም	-3867
▁ፔ	-3868
▁ቴዎ	-3869
▁ለነ	-3870
▁እስክንድር	-3871
ዮቹ	-3872
▁አገልግሎታችንን	-3873
▁አዳራሽ	-3874
▁የእግር	-3875
▁ቶሎ	-3876
▁አቅርቦት	-3877
ባጭ	-3878
▁መጠበቅ	-3879
ኳን	-3880
ሶማሌ	-3881
▁ስሙ	-3882
▁የድን	-3883
ላቁ	-3884
▁በዳ	-3885
▁የሙዚቃ	-3886
ጣኝ	-3887
▁በሶ	-3888
ንዳንድ	-3889
▁ሁለተኛው	-3890
▁ድንጋይ	-3891
ገባቸው	-3892
▁በነበረው	-3893
▁ማረጋገ	-3894
▁ለሌሎች	-3895
ፋው	-3896
ረጋጋ	-3897
▁ብሩ	-3898
ሲያ	-3899
ተህ	-3900
▁ተከታታይ	-3901
ሰቃ	-3902
ሳቁ	-3903
▁ሰባ	-3904
▁አያሌ	-3905
▁ለታ	-3906
ትናንት	-3907
▁ያልሆነ	-3908
▁ተፈጥሮ	-3909
▁ማይ	-3910
▁አለቃ	-3911
▁ያስረዳ	-3912
ከተለው	-3913
▁እንደሚሉት	-3914
▁ተው	-3915
▁የፕሮ	-3916
▁ከራ	-3917
▁የምናቀርበውን	-3918
▁ድምፃ	-3919
▁ያሳያል	-3920
ሙና	-3921
ሬዳዋ	-3922
▁ለረ	-3923
▁የበላይነት	-3924
▁ኩኪዎችን	-3925
ሻንጉ	-3926
▁መቃ	-3927
▁ሰዉ	-3928
▁ለርስዎ	-3929
▁አፈፃፀም	-3930
▁የለበትም	-3931
▁ተሽከር	-3932
▁መሆኑንም	-3933
ነካ	-3934
▁የሚቀ	-3935
ካሪዎች	-3936
▁ያደረጉ	-3937
▁ከመንግስት	-3938
ለማችን	-3939
▁ያህዌ	-3940
ቃለሁ	-3941
ቦና	-3942
▁ያድርጉ	-3943
▁ስለም	-3944
ቀጥለው	-3945
▁ዘግቧል	-3946
▁ዜናዊ	-3947
ርሀት	-3948
▁ስለሆነም	-3949
▁በፊ	-3950
▁አይመስለኝም	-3951
ምረት	-3952
ገለፅ	-3953
▁በምድር	-3954
▁አፄ	-3955
▁ደራሲ	-3956
▁ለሙ	-3957
▁የአቶ	-3958
▁መገ	-3959
▁እንዳት	-3960
▁ብዙዎች	-3961
ክህ	-3962
▁ያለመ	-3963
▁ሰኞ	-3964
▁ሼር	-3965
▁አደራ	-3966
▁ታጣ	-3967
ሁዳ	-3968
▁አነጋ	-3969
ወሰነ	-3970
▁በኢን	-3971
▁ኮሚሽ	-3972
▁ጊዜያት	-3973
▁የሚችለው	-3974
▁የብሄራዊ	-3975
▁ሳን	-3976
ታዎች	-3977
በሪያ	-3978
▁የሰማ	-3979
▁ስለነበር	-3980
▁ቀረ	-3981
▁የተወ	-3982
ዘም	-3983
ቻይና	-3984
ክታር	-3985
▁የተቀመ	-3986
ሄደ	-3987
▁ገዥ	-3988
▁ከሆኑ	-3989
▁በማህ	-3990
ቆይ	-3991
ጠብቅ	-3992
▁ተመር	-3993
ዞች	-3994
▁ምሁራን	-3995
▁ማጥ	-3996
▁መግቢያ	-3997
▁ተያይዞ	-3998
ሁፍ	-3999
▁መወሰ	-4000
ሪስ	-4001
ስቀ	-4002
▁የብሄር	-4003
ሙስ	-4004
▁በቅርብ	-4005
▁መከላከል	-4006
▁ምስጋና	-4007
▁ሚስት	-4008
▁ቅርንጫ	-4009
▁ተናገሩ	-4010
▁ለሁሉም	-4011
▁ሀብረት	-4012
▁መስተዳድር	-4013
▁አሳይ	-4014
ገኙበት	-4015
▁ማሻሻያ	-4016
ዴት	-4017
▁በየት	-4018
ጆቹ	-4019
▁ቤተክርስቲያን	-4020
▁ፍትሀዊ	-4021
▁ይናገ	-4022
▁የሚያደርግ	-4023
ለደ	-4024
▁መደረጉ	-4025
▁የጠቅላይ	-4026
▁ሰፈር	-4027
ሚዎች	-4028
▁ወይዘሮ	-4029
ልአ	-4030
▁አደሮች	-4031
▁እሷ	-4032
▁የተሰራ	-4033
▁አስኪያጅ	-4034
▁ያኔ	-4035
▁ስቃይ	-4036
▁ባለሀብቶች	-4037
▁የባህል	-4038
▁ላይም	-4039
▁አብዛኞቹ	-4040
▁ህብረተሰቡ	-4041
▁የሚያደር	-4042
▁በምእራብ	-4043
▁አጠቃ	-4044
በዛ	-4045
▁ሀገሮች	-4046
▁ሀይሌ	-4047
▁በሀላ	-4048
▁ከመስ	-4049
▁ይረዳ	-4050
▁ለካ	-4051
▁የተናገሩት	-4052
ነሳት	-4053
ከታተል	-4054
መስረት	-4055
▁ይቀጥ	-4056
▁እያንዳንዱ	-4057
▁ስላሴ	-4058
ስበው	-4059
▁አካሄድ	-4060
▁የግብፅ	-4061
ሟላ	-4062
▁ስና	-4063
▁ኮሮና	-4064
ችም	-4065
▁ተጠናቅቋል	-4066
ብይ	-4067
ኖስ	-4068
▁ሶስተኛ	-4069
▁ይናገራል	-4070
▁ሾ	-4071
ኒቨርሲቲ	-4072
▁ስርአቱ	-4073
▁በምርጫ	-4074
▁ዬ	-4075
▁በነፃ	-4076
ስተኛው	-4077
▁ግዙ	-4078
▁ጨዋታዎች	-4079
▁እንደሚገኝ	-4080
ገመ	-4081
ንባታ	-4082
▁ወድ	-4083
ግነት	-4084
▁ገልፀው	-4085
ገናኝ	-4086
▁ዳንኤል	-4087
▁ቁጭ	-4088
ረፈ	-4089
▁በመፍ	-4090
▁መስፍን	-4091
ዥም	-4092
ፋሪ	-4093
▁ዘላቂ	-4094
▁አዋጁ	-4095
▁የእው	-4096
ፍር	-4097
▁የግብርና	-4098
▁ሚዛ	-4099
▁እየተሰራ	-4100
ልት	-4101
▁የሚሰሩ	-4102
▁ግፍ	-4103
▁ስራዎችን	-4104
▁ለመያዝ	-4105
▁እንደምን	-4106
▁ጥራት	-4107
▁አገሪቱ	-4108
▁የአስቸኳይ	-4109
▁ልታ	-4110
▁ማዳ	-4111
▁የዞ	-4112
▁በምስራቅ	-4113
ነራል	-4114
▁ስምም	-4115
▁አደገኛ	-4116
በለ	-4117
▁አንዳር	-4118
▁ደንብ	-4119
▁ግር	-4120
▁ሪፖርተር	-4121
▁የሀይል	-4122
አለም	-4123
ፍረት	-4124
▁ከተለያዩ	-4125
ወቀ	-4126
▁የአር	-4127
▁ኢኮኖሚያዊ	-4128
▁አብዱ	-4129
▁ያንን	-4130
▁የፍቅር	-4131
▁ብቻውን	-4132
▁ምኞ	-4133
ምረው	-4134
▁ቀጣይ	-4135
ጥሩ	-4136
▁ቀዳሚ	-4137
እይ	-4138
▁በማንኛውም	-4139
▁ከክ	-4140
▁ክለብ	-4141
▁ይጠይ	-4142
▁የቻይና	-4143
▁ከኮ	-4144
▁ከዘ	-4145
▁ክልላዊ	-4146
▁ተወላጆች	-4147
ቀኑ	-4148
▁ከሁሉም	-4149
▁መወ	-4150
ዎቻቸው	-4151
ሬሽኑ	-4152
▁እሱም	-4153
▁የቴሌ	-4154
▁ግብረ	-4155
▁ለመፍጠር	-4156
▁ኮሌ	-4157
▁የጨ	-4158
▁ተደርጓል	-4159
ነዋል	-4160
▁ሰጪ	-4161
▁ብሎም	-4162
ምፅ	-4163
▁አሀ	-4164
ንቱ	-4165
▁እውን	-4166
▁ምንዛሪ	-4167
ገማ	-4168
▁ማእከላዊ	-4169
▁ያጋ	-4170
▁በመሆናቸው	-4171
▁አለማየሁ	-4172
▁እኛን	-4173
▁ሀሳቦች	-4174
▁እንዲሆኑ	-4175
ገልገል	-4176
▁በጦር	-4177
▁እስራኤ	-4178
ህዶ	-4179
▁አይነቱ	-4180
▁የህዳሴ	-4181
ሻንጉል	-4182
▁ከበደ	-4183
▁ከወጣ	-4184
ዊተር	-4185
ፍል	-4186
▁ቢኖር	-4187
▁በርስ	-4188
ቸውም	-4189
▁ተአ	-4190
በጥ	-4191
ነብ	-4192
▁አኳ	-4193
▁ረጅም	-4194
ረከ	-4195
▁ጎል	-4196
ዛኝ	-4197
▁ምእ	-4198
▁ቀና	-4199
▁በስፋት	-4200
▁ይሰጣል	-4201
ወሩ	-4202
▁አፋ	-4203
▁ጉብኝት	-4204
▁ሰሜን	-4205
መታ	-4206
ዘዋ	-4207
▁ወልደ	-4208
ከናው	-4209
▁የተገኘ	-4210
ፈቱ	-4211
ንቀሳቀስ	-4212
ገላ	-4213
ጥቅ	-4214
▁ወጥቶ	-4215
ርዱ	-4216
▁የክልል	-4217
▁አንዱን	-4218
ገቡት	-4219
▁አውሮፓ	-4220
ላሴ	-4221
▁ኢንጂ	-4222
▁ለል	-4223
▁ይወ	-4224
▁በቀን	-4225
▁ይተ	-4226
▁ችግሩን	-4227
▁በሚገባ	-4228
መኝ	-4229
ንቦት	-4230
▁ክን	-4231
▁ምነው	-4232
▁እየጨመረ	-4233
▁ትላንት	-4234
▁አምላ	-4235
▁ወደሚ	-4236
▁አላው	-4237
ምቤ	-4238
ችሉም	-4239
▁ገንዘ	-4240
▁ፖለቲከኞች	-4241
▁ህገወጥ	-4242
▁ከጊዜ	-4243
ቆስ	-4244
▁እየሆነ	-4245
▁ሰጥቶ	-4246
▁ለማን	-4247
ክብ	-4248
▁በሀገራችን	-4249
▁ደርሷል	-4250
▁የሚፈልጉ	-4251
ጋሉ	-4252
ጋው	-4253
ፎቶ	-4254
ቢዎች	-4255
ድድር	-4256
ቋረ	-4257
▁አረጋ	-4258
▁ቢሊ	-4259
▁ተፈና	-4260
▁በፖለቲካ	-4261
ሰኞ	-4262
ሜሽን	-4263
▁የአካባቢ	-4264
▁ይፈል	-4265
▁አሊ	-4266
ካች	-4267
ገበው	-4268
▁እያሳ	-4269
▁በአብዛኛው	-4270
▁ጃዋር	-4271
▁ለሁለት	-4272
ውጣ	-4273
▁መፈ	-4274
▁ከየት	-4275
▁በእነዚህ	-4276
▁የተያዙ	-4277
▁ይኸው	-4278
▁ፍፃሜ	-4279
▁ገለፃ	-4280
ታወቀው	-4281
▁መፍጠር	-4282
▁በትምህርት	-4283
▁የሚሰጠው	-4284
▁ቴዎድሮስ	-4285
▁ሽን	-4286
▁የሚች	-4287
▁ብሄረሰቦች	-4288
ናቱ	-4289
ሸጥ	-4290
ረቱ	-4291
▁ወላጆች	-4292
▁ተግባራት	-4293
▁መሄድ	-4294
▁ታማ	-4295
▁የሚገር	-4296
ገዳ	-4297
ሀሀ	-4298
ለታል	-4299
ጋዮች	-4300
▁ወዲያው	-4301
▁መጠየቅ	-4302
▁አስቀድሞ	-4303
▁በሆኑ	-4304
▁አቡነ	-4305
▁መንደር	-4306
ሮን	-4307
▁በመግለፅ	-4308
ሴፍ	-4309
▁በቡ	-4310
ሏላዊ	-4311
▁በከ	-4312
▁በመካ	-4313
ሶችን	-4314
▁ነግ	-4315
ከሰት	-4316
ታለች	-4317
ያስፖ	-4318
▁የተጋ	-4319
▁ክትትል	-4320
ርን	-4321
▁ዳግም	-4322
ዝን	-4323
ዳንቱ	-4324
▁ሁልጊዜ	-4325
▁ገደማ	-4326
▁ፕሮጀክቶች	-4327
ጲያ	-4328
ዋለን	-4329
▁አባቶች	-4330
▁የሚገኙት	-4331
ሰና	-4332
▁ኦርቶዶክስ	-4333
▁ኤም	-4334
▁ሸዋ	-4335
▁ጨረታ	-4336
ስኤ	-4337
▁የደም	-4338
▁ፋይ	-4339
▁የሚያስተ	-4340
▁በብዛት	-4341
▁ይጨ	-4342
▁ፀሀይ	-4343
ሮድ	-4344
▁እቃዎች	-4345
▁ኢሳት	-4346
▁የቆየ	-4347
▁ከአለም	-4348
ፍጨ	-4349
▁ዩናይትድ	-4350
▁የኑ	-4351
▁በድጋሚ	-4352
ለብ	-4353
▁ግቢ	-4354
▁አለመሆኑ	-4355
▁ባደረጉት	-4356
▁አመታዊ	-4357
ንሰር	-4358
▁አብረው	-4359
▁በየጊዜው	-4360
ላውያን	-4361
▁ይስ	-4362
▁ዘጠና	-4363
ራቴጂ	-4364
▁ግጥ	-4365
▁የፕሬ	-4366
ዋሪ	-4367
▁ማጥፋት	-4368
▁የራሱን	-4369
▁ሚያ	-4370
▁ድራማ	-4371
ረናል	-4372
▁የተሰኘ	-4373
▁አመሰ	-4374
▁በአጭር	-4375
▁ሀገራዊ	-4376
▁በኋላም	-4377
▁በአማርኛ	-4378
▁እንደነበረ	-4379
▁ለመሆኑ	-4380
ከበረ	-4381
▁ጥልቅ	-4382
ቨር	-4383
▁ይሉ	-4384
▁ክህ	-4385
ሰለ	-4386
▁ፓርላማ	-4387
ገዱ	-4388
ታደር	-4389
▁በተለያየ	-4390
ኔል	-4391
▁ካፒ	-4392
ቀበል	-4393
▁ባለበት	-4394
▁ፊል	-4395
▁ሴራ	-4396
▁ተከሳ	-4397
▁ተሞክ	-4398
▁ቬ	-4399
▁በነበረ	-4400
▁ቅርፅ	-4401
▁ጀመር	-4402
ብቻ	-4403
▁አልበ	-4404
▁እሳ	-4405
▁ተመልክ	-4406
ቪል	-4407
▁ትርፍ	-4408
ሞክራ	-4409
▁ኤር	-4410
ዊው	-4411
▁በሚለው	-4412
▁ውሰ	-4413
▁መስጠ	-4414
▁ሀይለማርያም	-4415
▁ተነግ	-4416
▁ፉ	-4417
የሩሳሌ	-4418
▁ሀገራ	-4419
▁በደል	-4420
▁መገደ	-4421
▁አይነ	-4422
▁ተገን	-4423
▁ንፁህ	-4424
▁ሳለ	-4425
▁ውድድ	-4426
ፊው	-4427
ሰብሰብ	-4428
▁ዘርፎች	-4429
▁እዳ	-4430
▁የሆ	-4431
▁ዴሞክራሲ	-4432
▁መያ	-4433
▁ስኬ	-4434
ጠናቀቀ	-4435
▁መፅሄት	-4436
▁እዚያ	-4437
▁ሀገሪቱ	-4438
ሞቱ	-4439
ሰባሰብ	-4440
▁የች	-4441
▁በውስ	-4442
▁የተሰጠ	-4443
ጣሪዎች	-4444
▁የማእ	-4445
▁ያለን	-4446
▁ቅድሚያ	-4447
▁ኤምባሲ	-4448
▁የከፋ	-4449
▁አንደኛው	-4450
▁ያደ	-4451
▁ይፈልጋል	-4452
▁የሁለ	-4453
▁የተደረገው	-4454
ፈለገው	-4455
ገነዘ	-4456
ያሜ	-4457
ፃፉ	-4458
▁የአካባቢው	-4459
ምፒዮ	-4460
▁የተጣ	-4461
▁ያመለክታል	-4462
▁ድረ	-4463
▁ቤተሰቦ	-4464
▁ማረጋገጫ	-4465
ገሬ	-4466
ቃን	-4467
▁ቀስ	-4468
▁በጠ	-4469
ደባ	-4470
▁ሰውዬ	-4471
▁አመልክተዋል	-4472
ፎርሜሽን	-4473
ንቀሳ	-4474
▁ምኒ	-4475
▁እንድታ	-4476
▁ሳት	-4477
▁መግባት	-4478
ሳኤ	-4479
▁እጩ	-4480
▁ደካ	-4481
▁ተሳታፊ	-4482
▁ችግሮችን	-4483
ሪታ	-4484
ወግ	-4485
▁የዋጋ	-4486
ሶማሊያ	-4487
ማው	-4488
▁ተነሳ	-4489
▁በግብ	-4490
▁ህጉ	-4491
▁በእጅጉ	-4492
▁በሲ	-4493
▁ጀግ	-4494
▁የሱዳን	-4495
▁ተሰም	-4496
▁መውሰድ	-4497
▁ሰጥተዋል	-4498
▁ህዳሴ	-4499
▁ለቅ	-4500
ደባባይ	-4501
▁ይኖራል	-4502
በዝ	-4503
▁ስለማይ	-4504
ግሪ	-4505
▁ሀውል	-4506
ዊያን	-4507
▁የኤሌክትሪክ	-4508
ሰሙ	-4509
▁ማቆ	-4510
ባቸውም	-4511
▁ተወስ	-4512
▁ለአለም	-4513
▁ይሆናሉ	-4514
ክኒክ	-4515
▁መሳሪያዎች	-4516
▁ጎዳና	-4517
▁ይል	-4518
▁የስፖርት	-4519
በን	-4520
▁የአባ	-4521
ሪፖርተር	-4522
ጠንቀቂያ	-4523
ነገሩ	-4524
▁በደረ	-4525
ኖቹ	-4526
▁ጣልቃ	-4527
ኑም	-4528
▁ምቹ	-4529
ኮት	-4530
▁ባህላዊ	-4531
▁ክለቦች	-4532
▁አደረጃ	-4533
ጎዳ	-4534
▁የቁ	-4535
▁ታላቁ	-4536
▁ለፍርድ	-4537
▁አገኘ	-4538
▁ግል	-4539
▁ለመናገር	-4540
▁እንደሚችሉ	-4541
▁አንዴ	-4542
ታወቂያ	-4543
ርና	-4544
ዳምጡ	-4545
▁በመጥ	-4546
▁ባሉት	-4547
ገሉ	-4548
▁ሆነዋል	-4549
▁አሳሳቢ	-4550
ስም	-4551
▁ብቅ	-4552
ብጥ	-4553
በረሰቡ	-4554
▁የሻ	-4555
▁የበረ	-4556
ቀና	-4557
ፍረስ	-4558
▁ኢሳያስ	-4559
ተርኔት	-4560
▁አስቸኳይ	-4561
▁ነገሩ	-4562
▁የሚሰማ	-4563
እየ	-4564
ያዎች	-4565
▁መገለ	-4566
ኮም	-4567
▁ገደብ	-4568
ድል	-4569
▁ክርክር	-4570
▁አሳዛኝ	-4571
ህዴድ	-4572
ትንና	-4573
▁ፍልስ	-4574
▁መፃህፍት	-4575
ሪያው	-4576
▁አይገባም	-4577
▁የመረጃ	-4578
▁መስቀል	-4579
▁ከስራ	-4580
▁ሰላምና	-4581
▁ፈጣን	-4582
▁የተወሰነ	-4583
▁ማክሰኞ	-4584
▁እርግጥ	-4585
▁ከዋ	-4586
▁ሰአታት	-4587
ልምና	-4588
▁ጥበ	-4589
▁ባስ	-4590
▁የፍትህ	-4591
▁ቆይቷል	-4592
▁አርባ	-4593
▁አውሮፕላ	-4594
▁ያወጣ	-4595
▁ዲሲ	-4596
▁የጭ	-4597
▁ከቤተ	-4598
▁በሚገኙ	-4599
▁ምልክ	-4600
▁ምርቶች	-4601
▁በፍፁም	-4602
▁ደጋፊዎች	-4603
▁ያለም	-4604
ደራጀ	-4605
ወች	-4606
▁የሚገባው	-4607
▁ሲነ	-4608
▁ሚካኤል	-4609
▁ለበ	-4610
▁እመ	-4611
▁የብዙ	-4612
ዳቸውን	-4613
▁ከሳ	-4614
ቶቹን	-4615
መኔ	-4616
▁ስእ	-4617
▁የብር	-4618
▁እንግዳ	-4619
▁ከሶስት	-4620
▁ለጋ	-4621
ጠሉ	-4622
ወትር	-4623
▁አንዷ	-4624
▁ዝቅተኛ	-4625
ሳችንን	-4626
▁ሄክታር	-4627
▁እርግጠኛ	-4628
▁መያዝ	-4629
▁መቀመ	-4630
▁ከማንኛውም	-4631
ክሩ	-4632
ደጓ	-4633
▁እንግሊዝ	-4634
▁አምና	-4635
▁የፋይናንስ	-4636
ያዝያ	-4637
ሀይ	-4638
▁ትስ	-4639
▁ይደረጋል	-4640
▁የጨረታ	-4641
▁ስትል	-4642
▁ጠባቂ	-4643
▁ብርቱ	-4644
▁ፍቅ	-4645
እና	-4646
ፐር	-4647
ክን	-4648
ውንት	-4649
▁ሌሎችን	-4650
▁መሰረተ	-4651
ኝት	-4652
▁በኤርትራ	-4653
▁ሀገራችን	-4654
▁አላውቅም	-4655
▁በራስ	-4656
▁ውዝ	-4657
▁ባልተ	-4658
በሻ	-4659
ዛል	-4660
▁የሴቶች	-4661
▁ዲሞክራሲ	-4662
▁በፍቅር	-4663
▁አረቢያ	-4664
▁እንዲያስ	-4665
ጓዴ	-4666
▁ስዩም	-4667
▁የሁለት	-4668
ያዘው	-4669
ላይታ	-4670
▁በሁለቱ	-4671
▁በእስር	-4672
ሎን	-4673
▁ቀርቦ	-4674
ፎካ	-4675
ጥል	-4676
ፃፈው	-4677
▁ተራራ	-4678
▁አባባል	-4679
▁አፅ	-4680
▁በሂ	-4681
▁ባወጣው	-4682
ባበል	-4683
▁ዊ	-4684
ይዝ	-4685
▁ዎቹ	-4686
ቆጣጠ	-4687
▁የለውጥ	-4688
ራንስፖርት	-4689
▁ለማቅረብ	-4690
ቆሙ	-4691
መታት	-4692
▁አንዳርጋቸው	-4693
በጣ	-4694
▁ቁሳቁ	-4695
▁መስክ	-4696
▁በአስ	-4697
ልልስ	-4698
ለላ	-4699
▁አቅርበዋል	-4700
▁እስራኤል	-4701
▁ፕላ	-4702
ዝነስ	-4703
▁ያመ	-4704
▁ለማረጋገጥ	-4705
ላቻ	-4706
▁ጭንቅ	-4707
ምቤላ	-4708
▁ከፊ	-4709
ሽንግተን	-4710
ዝገባ	-4711
▁ተጫዋቾች	-4712
▁ሰይጣን	-4713
▁ፅሁፎች	-4714
▁ናይ	-4715
▁ተሾ	-4716
ሪን	-4717
▁በተደረገው	-4718
ደርጉት	-4719
▁ዲፕሎማ	-4720
▁ለሰው	-4721
▁በቀር	-4722
ምፒክ	-4723
ሰበው	-4724
▁የእስራኤል	-4725
▁የተፈጠረ	-4726
▁ደህና	-4727
▁መብራት	-4728
▁አላህ	-4729
▁የፀረ	-4730
ፎችን	-4731
▁ተበ	-4732
▁ተክ	-4733
▁የኩ	-4734
▁አስደናቂ	-4735
ቿን	-4736
▁መረዳት	-4737
▁ምእራብ	-4738
▁ንም	-4739
▁ሰማይ	-4740
▁የፈጠ	-4741
ማመን	-4742
ናትና	-4743
▁መንስኤ	-4744
▁ሲኖ	-4745
ዚያው	-4746
▁ህልውና	-4747
▁በሶስት	-4748
▁የተዘጋጀ	-4749
▁መጀመ	-4750
ሀንነት	-4751
ደደ	-4752
▁ቅርብ	-4753
ከናወኑ	-4754
ቲክስ	-4755
▁ካድ	-4756
ራቾች	-4757
▁ሏላዊ	-4758
▁ቁልፍ	-4759
▁የአፍሪቃ	-4760
▁አስተባባሪ	-4761
▁ዝርያ	-4762
▁በተካሄደው	-4763
▁ሰጥቷል	-4764
ጠየቁ	-4765
▁ሲታ	-4766
ረንጓዴ	-4767
▁ይበልጣ	-4768
ርጦ	-4769
▁ቀለም	-4770
▁በሚያስ	-4771
▁ይመጣል	-4772
▁ሰለሞን	-4773
▁ካስ	-4774
▁ክፍት	-4775
ቡእ	-4776
▁እንደተናገሩት	-4777
▁ፍለጋ	-4778
▁ጄኔራል	-4779
ሬም	-4780
▁መንግስትን	-4781
▁አብዛኛው	-4782
▁ስላለ	-4783
▁ማሰ	-4784
ቢው	-4785
ምያ	-4786
▁የሱ	-4787
ዳሉ	-4788
▁ቤቱን	-4789
▁የነፃነት	-4790
መናዊ	-4791
▁ቆሻሻ	-4792
▁ወንድሞ	-4793
▁መቀሌ	-4794
▁የመጡ	-4795
ዋይ	-4796
▁እይታ	-4797
▁የጊዜ	-4798
▁በቤ	-4799
ሸጋ	-4800
▁ሂደ	-4801
▁የሊ	-4802
▁ጠዋት	-4803
ላለሁ	-4804
▁የአካል	-4805
ቢያው	-4806
▁ገር	-4807
▁ሀሙስ	-4808
▁በዲ	-4809
ታና	-4810
▁የሩ	-4811
▁የተዋ	-4812
▁ለእኔ	-4813
▁ብራ	-4814
ራክሽን	-4815
▁ጭማሪ	-4816
ደሩ	-4817
ለውም	-4818
ሬድ	-4819
▁በሺ	-4820
ቋንቋ	-4821
▁ፈቃደኛ	-4822
▁ነጭ	-4823
▁ህሊና	-4824
▁አለች	-4825
▁የእስ	-4826
ከፋፈል	-4827
▁የኪ	-4828
▁ዛፍ	-4829
ላለፉ	-4830
▁የላቀ	-4831
ጠፉ	-4832
ረና	-4833
ላህ	-4834
▁ተዘግ	-4835
▁እየተባለ	-4836
ኮል	-4837
መለከታቸው	-4838
▁በአምላክ	-4839
▁ስለማ	-4840
▁የተጀመረው	-4841
ራቱ	-4842
▁ህፃን	-4843
▁መመለስ	-4844
▁ኢንስ	-4845
▁በግል	-4846
▁እየቀ	-4847
▁ለማንኛውም	-4848
ርሱም	-4849
